
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>python高级 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="数据库.html" />
    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="./">
            
                <a href="./">
            
                    
                    开发
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.2.1" data-path="python高级.html">
            
                <a href="python高级.html">
            
                    
                    python高级
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="数据库.html">
            
                <a href="数据库.html">
            
                    
                    数据库
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="数据类型.html">
            
                <a href="数据类型.html">
            
                    
                    数据类型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="数据结构与算法.html">
            
                <a href="数据结构与算法.html">
            
                    
                    数据结构与算法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.5" data-path="爬虫.html">
            
                <a href="爬虫.html">
            
                    
                    爬虫
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.6" data-path="网络协议.html">
            
                <a href="网络协议.html">
            
                    
                    网络协议
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.7" data-path="系统编程.html">
            
                <a href="系统编程.html">
            
                    
                    系统编程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.8" data-path="vue.html">
            
                <a href="vue.html">
            
                    
                    vue
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.9" data-path="线程、进程、协程.html">
            
                <a href="线程、进程、协程.html">
            
                    
                    线程、进程、协程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.10" data-path="linux.html">
            
                <a href="linux.html">
            
                    
                    linux
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.11" data-path="web.html">
            
                <a href="web.html">
            
                    
                    web
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../part2/">
            
                <a href="../part2/">
            
                    
                    网络安全
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../part2/渗透测试.html">
            
                <a href="../part2/渗透测试.html">
            
                    
                    渗透测试
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../part2/等级保护.html">
            
                <a href="../part2/等级保护.html">
            
                    
                    等级保护
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="../part2/风险评估.html">
            
                <a href="../part2/风险评估.html">
            
                    
                    风险评估
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="../part2/应急响应.html">
            
                <a href="../part2/应急响应.html">
            
                    
                    应急响应
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.5" data-path="../part2/安全巡检.html">
            
                <a href="../part2/安全巡检.html">
            
                    
                    安全巡检
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >python高级</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="python&#x9AD8;&#x7EA7;">python&#x9AD8;&#x7EA7;</h1>
<h3 id="python-&#x4E2D;&#x7C7B;&#x65B9;&#x6CD5;&#x3001;&#x7C7B;&#x5B9E;&#x4F8B;&#x65B9;&#x6CD5;&#x3001;&#x9759;&#x6001;&#x65B9;&#x6CD5;&#x6709;&#x4F55;&#x533A;&#x522B;&#xFF1F;">Python &#x4E2D;&#x7C7B;&#x65B9;&#x6CD5;&#x3001;&#x7C7B;&#x5B9E;&#x4F8B;&#x65B9;&#x6CD5;&#x3001;&#x9759;&#x6001;&#x65B9;&#x6CD5;&#x6709;&#x4F55;&#x533A;&#x522B;&#xFF1F;</h3>
<p>&#x7C7B;&#x65B9;&#x6CD5;&#xFF1A;&#x662F;&#x7C7B;&#x5BF9;&#x8C61;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5728;&#x5B9A;&#x4E49;&#x65F6;&#x9700;&#x8981;&#x5728;&#x4E0A;&#x65B9;&#x4F7F;&#x7528;&#x201C;@classmethod&#x201D;&#x8FDB;&#x884C;&#x88C5;&#x9970;&#xFF0C;&#x5F62;&#x53C2;&#x4E3A; cls&#xFF0C; &#x8868;&#x793A;&#x7C7B;&#x5BF9;&#x8C61;&#xFF0C;&#x7C7B;&#x5BF9;&#x8C61;&#x548C;&#x5B9E;&#x4F8B;&#x5BF9;&#x8C61;&#x90FD;&#x53EF;&#x8C03;&#x7528;&#xFF1B; </p>
<p>&#x7C7B;&#x5B9E;&#x4F8B;&#x65B9;&#x6CD5;&#xFF1A;&#x662F;&#x7C7B;&#x5B9E;&#x4F8B;&#x5316;&#x5BF9;&#x8C61;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x53EA;&#x6709;&#x5B9E;&#x4F8B;&#x5BF9;&#x8C61;&#x53EF;&#x4EE5;&#x8C03;&#x7528;&#xFF0C;&#x5F62;&#x53C2;&#x4E3A; self&#xFF0C;&#x6307;&#x4EE3;&#x5BF9;&#x8C61;&#x672C;&#x8EAB;&#xFF1B; </p>
<p>&#x9759;&#x6001;&#x65B9;&#x6CD5;&#xFF1A;&#x662F;&#x4E00;&#x4E2A;&#x4EFB;&#x610F;&#x51FD;&#x6570;&#xFF0C;&#x5728;&#x5176;&#x4E0A;&#x65B9;&#x4F7F;&#x7528;&#x201C;@staticmethod&#x201D;&#x8FDB;&#x884C;&#x88C5;&#x9970;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x5BF9;&#x8C61;&#x76F4;&#x63A5;&#x8C03;&#x7528;&#xFF0C; &#x9759;&#x6001;&#x65B9;&#x6CD5;&#x5B9E;&#x9645;&#x4E0A;&#x8DDF;&#x8BE5;&#x7C7B;&#x6CA1;&#x6709;&#x592A;&#x5927;&#x5173;&#x7CFB;&#x3002;</p>
<h3 id="python-&#x7684;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x673A;&#x5236;&#x53CA;&#x8C03;&#x4F18;&#x624B;&#x6BB5;&#xFF1F;">Python &#x7684;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x673A;&#x5236;&#x53CA;&#x8C03;&#x4F18;&#x624B;&#x6BB5;&#xFF1F;</h3>
<p>&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x673A;&#x5236;&#xFF1A;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x3001;&#x5783;&#x573E;&#x56DE;&#x6536;&#x3001;&#x5185;&#x5B58;&#x6C60;&#x3002; &#x5F15;&#x7528;&#x8BA1;&#x6570;&#xFF1A; &#x5F15;&#x7528;&#x8BA1;&#x6570;&#x662F;&#x4E00;&#x79CD;&#x975E;&#x5E38;&#x9AD8;&#x6548;&#x7684;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x624B;&#x6BB5;&#xFF0C; &#x5F53;&#x4E00;&#x4E2A; Python &#x5BF9;&#x8C61;&#x88AB;&#x5F15;&#x7528;&#x65F6;&#x5176;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x589E;&#x52A0; 1&#xFF0C; &#x5F53; &#x5176;&#x4E0D;&#x518D;&#x88AB;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x5F15;&#x7528;&#x65F6;&#x5219;&#x8BA1;&#x6570;&#x51CF; 1. &#x5F53;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x7B49;&#x4E8E; 0 &#x65F6;&#x5BF9;&#x8C61;&#x88AB;&#x5220;&#x9664;&#x3002; </p>
<p>&#x5783;&#x573E;&#x56DE;&#x6536; &#xFF1A; </p>
<ol>
<li>&#x5F15;&#x7528;&#x8BA1;&#x6570; &#x5F15;&#x7528;&#x8BA1;&#x6570;&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x5783;&#x573E;&#x6536;&#x96C6;&#x673A;&#x5236;&#xFF0C;&#x800C;&#x4E14;&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x6700;&#x76F4;&#x89C2;&#xFF0C;&#x6700;&#x7B80;&#x5355;&#x7684;&#x5783;&#x573E;&#x6536;&#x96C6;&#x6280;&#x672F;&#x3002;&#x5F53; Python &#x7684;&#x67D0; &#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x964D;&#x4E3A; 0 &#x65F6;&#xFF0C;&#x8BF4;&#x660E;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x5F15;&#x7528;&#x6307;&#x5411;&#x8BE5;&#x5BF9;&#x8C61;&#xFF0C;&#x8BE5;&#x5BF9;&#x8C61;&#x5C31;&#x6210;&#x4E3A;&#x8981;&#x88AB;&#x56DE;&#x6536;&#x7684;&#x5783;&#x573E;&#x4E86;&#x3002;&#x6BD4;&#x5982; &#x67D0;&#x4E2A;&#x65B0;&#x5EFA;&#x5BF9;&#x8C61;&#xFF0C;&#x5B83;&#x88AB;&#x5206;&#x914D;&#x7ED9;&#x67D0;&#x4E2A;&#x5F15;&#x7528;&#xFF0C;&#x5BF9;&#x8C61;&#x7684;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x53D8;&#x4E3A; 1&#x3002;&#x5982;&#x679C;&#x5F15;&#x7528;&#x88AB;&#x5220;&#x9664;&#xFF0C;&#x5BF9;&#x8C61;&#x7684;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x4E3A; 0&#xFF0C; &#x90A3;&#x4E48;&#x8BE5;&#x5BF9;&#x8C61;&#x5C31;&#x53EF;&#x4EE5;&#x88AB;&#x5783;&#x573E;&#x56DE;&#x6536;&#x3002;&#x4E0D;&#x8FC7;&#x5982;&#x679C;&#x51FA;&#x73B0;&#x5FAA;&#x73AF;&#x5F15;&#x7528;&#x7684;&#x8BDD;&#xFF0C;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x673A;&#x5236;&#x5C31;&#x4E0D;&#x518D;&#x8D77;&#x6709;&#x6548;&#x7684;&#x4F5C;&#x7528;&#x4E86;</li>
</ol>
<ol>
<li>&#x6807;&#x8BB0;&#x6E05;&#x9664; &#x5982;&#x679C;&#x4E24;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x90FD;&#x4E3A; 1&#xFF0C;&#x4F46;&#x662F;&#x4EC5;&#x4EC5;&#x5B58;&#x5728;&#x4ED6;&#x4EEC;&#x4E4B;&#x95F4;&#x7684;&#x5FAA;&#x73AF;&#x5F15;&#x7528;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E24;&#x4E2A;&#x5BF9;&#x8C61;&#x90FD;&#x662F;&#x9700;&#x8981;&#x88AB; &#x56DE;&#x6536;&#x7684;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5B83;&#x4EEC;&#x7684;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x867D;&#x7136;&#x8868;&#x73B0;&#x4E3A;&#x975E; 0&#xFF0C;&#x4F46;&#x5B9E;&#x9645;&#x4E0A;&#x6709;&#x6548;&#x7684;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x4E3A; 0&#x3002;&#x6240;&#x4EE5;&#x5148;&#x5C06;&#x5FAA;&#x73AF;&#x5F15; &#x7528;&#x6458;&#x6389;&#xFF0C;&#x5C31;&#x4F1A;&#x5F97;&#x51FA;&#x8FD9;&#x4E24;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x6709;&#x6548;&#x8BA1;&#x6570;&#x3002;</li>
</ol>
<ol>
<li>&#x5206;&#x4EE3;&#x56DE;&#x6536; &#x4ECE;&#x524D;&#x9762;&#x201C;&#x6807;&#x8BB0;-&#x6E05;&#x9664;&#x201D;&#x8FD9;&#x6837;&#x7684;&#x5783;&#x573E;&#x6536;&#x96C6;&#x673A;&#x5236;&#x6765;&#x770B;&#xFF0C;&#x8FD9;&#x79CD;&#x5783;&#x573E;&#x6536;&#x96C6;&#x673A;&#x5236;&#x6240;&#x5E26;&#x6765;&#x7684;&#x989D;&#x5916;&#x64CD;&#x4F5C;&#x5B9E;&#x9645;&#x4E0A;&#x4E0E;&#x7CFB;&#x7EDF; &#x4E2D;&#x603B;&#x7684;&#x5185;&#x5B58;&#x5757;&#x7684;&#x6570;&#x91CF;&#x662F;&#x76F8;&#x5173;&#x7684;&#xFF0C;&#x5F53;&#x9700;&#x8981;&#x56DE;&#x6536;&#x7684;&#x5185;&#x5B58;&#x5757;&#x8D8A;&#x591A;&#x65F6;&#xFF0C;&#x5783;&#x573E;&#x68C0;&#x6D4B;&#x5E26;&#x6765;&#x7684;&#x989D;&#x5916;&#x64CD;&#x4F5C;&#x5C31;&#x8D8A;&#x591A;&#xFF0C;&#x800C;&#x5783;&#x573E; &#x56DE;&#x6536;&#x5E26;&#x6765;&#x7684;&#x989D;&#x5916;&#x64CD;&#x4F5C;&#x5C31;&#x8D8A;&#x5C11;&#xFF1B;&#x53CD;&#x4E4B;&#xFF0C;&#x5F53;&#x9700;&#x56DE;&#x6536;&#x7684;&#x5185;&#x5B58;&#x5757;&#x8D8A;&#x5C11;&#x65F6;&#xFF0C;&#x5783;&#x573E;&#x68C0;&#x6D4B;&#x5C31;&#x5C06;&#x6BD4;&#x5783;&#x573E;&#x56DE;&#x6536;&#x5E26;&#x6765;&#x66F4;&#x5C11;&#x7684;&#x989D; &#x5916;&#x64CD;&#x4F5C;</li>
</ol>
<p>&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF1A; </p>
<p>&#x5F53;&#x67D0;&#x4E9B;&#x5185;&#x5B58;&#x5757; M &#x7ECF;&#x8FC7;&#x4E86; 3 &#x6B21;&#x5783;&#x573E;&#x6536;&#x96C6;&#x7684;&#x6E05;&#x6D17;&#x4E4B;&#x540E;&#x8FD8;&#x5B58;&#x6D3B;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x5C06;&#x5185;&#x5B58;&#x5757; M &#x5212;&#x5230;&#x4E00;&#x4E2A;&#x96C6;&#x5408; A &#x4E2D;&#x53BB;&#xFF0C;&#x800C;&#x65B0;&#x5206;&#x914D;&#x7684;&#x5185;&#x5B58;&#x90FD;&#x5212;&#x5206;&#x5230;&#x96C6;&#x5408; B &#x4E2D;&#x53BB;&#x3002;&#x5F53;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5F00;&#x59CB;&#x5DE5;&#x4F5C;&#x65F6;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x90FD;&#x53EA;&#x5BF9;&#x96C6;&#x5408; B &#x8FDB; &#x884C;&#x5783;&#x573E;&#x56DE;&#x6536;&#xFF0C;&#x800C;&#x5BF9;&#x96C6;&#x5408; A &#x8FDB;&#x884C;&#x5783;&#x573E;&#x56DE;&#x6536;&#x8981;&#x9694;&#x76F8;&#x5F53;&#x957F;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x540E;&#x624D;&#x8FDB;&#x884C;&#xFF0C;&#x8FD9;&#x5C31;&#x4F7F;&#x5F97;&#x5783;&#x573E;&#x6536;&#x96C6;&#x673A;&#x5236;&#x9700;&#x8981;&#x5904; &#x7406;&#x7684;&#x5185;&#x5B58;&#x5C11;&#x4E86;&#xFF0C;&#x6548;&#x7387;&#x81EA;&#x7136;&#x5C31;&#x63D0;&#x9AD8;&#x4E86;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x96C6;&#x5408; B &#x4E2D;&#x7684;&#x67D0;&#x4E9B;&#x5185;&#x5B58;&#x5757;&#x7531;&#x4E8E;&#x5B58;&#x6D3B;&#x65F6;&#x95F4;&#x957F;&#x800C;&#x4F1A;&#x88AB;&#x8F6C; &#x79FB;&#x5230;&#x96C6;&#x5408; A &#x4E2D;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x96C6;&#x5408; A &#x4E2D;&#x5B9E;&#x9645;&#x4E0A;&#x4E5F;&#x5B58;&#x5728;&#x4E00;&#x4E9B;&#x5783;&#x573E;&#xFF0C;&#x8FD9;&#x4E9B;&#x5783;&#x573E;&#x7684;&#x56DE;&#x6536;&#x4F1A;&#x56E0;&#x4E3A;&#x8FD9;&#x79CD;&#x5206;&#x4EE3;&#x7684;&#x673A;&#x5236;&#x800C; &#x88AB;&#x5EF6;&#x8FDF;&#x3002; </p>
<p>&#x5185;&#x5B58;&#x6C60;&#xFF1A; </p>
<ol>
<li>Python &#x7684;&#x5185;&#x5B58;&#x673A;&#x5236;&#x5448;&#x73B0;&#x91D1;&#x5B57;&#x5854;&#x5F62;&#x72B6;&#xFF0C;-1&#xFF0C;-2 &#x5C42;&#x4E3B;&#x8981;&#x6709;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#xFF1B;</li>
</ol>
<ol>
<li>&#x7B2C; 0 &#x5C42;&#x662F; C &#x4E2D;&#x7684; malloc&#xFF0C;free &#x7B49;&#x5185;&#x5B58;&#x5206;&#x914D;&#x548C;&#x91CA;&#x653E;&#x51FD;&#x6570;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#xFF1B;</li>
</ol>
<ol>
<li>&#x7B2C; 1 &#x5C42;&#x548C;&#x7B2C; 2 &#x5C42;&#x662F;&#x5185;&#x5B58;&#x6C60;&#xFF0C;&#x6709; Python &#x7684;&#x63A5;&#x53E3;&#x51FD;&#x6570; PyMem_Malloc &#x51FD;&#x6570;&#x5B9E;&#x73B0;&#xFF0C;&#x5F53;&#x5BF9;&#x8C61;&#x5C0F;&#x4E8E; 256K &#x65F6;&#x6709;&#x8BE5;&#x5C42;&#x76F4;&#x63A5;&#x5206;&#x914D;&#x5185;&#x5B58;&#xFF1B;</li>
</ol>
<ol>
<li>&#x7B2C; 3 &#x5C42;&#x662F;&#x6700;&#x4E0A;&#x5C42;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x5BF9; Python &#x5BF9;&#x8C61;&#x7684;&#x76F4;&#x63A5;&#x64CD;&#x4F5C;&#xFF1B;</li>
</ol>
<p>Python &#x5728;&#x8FD0;&#x884C;&#x671F;&#x95F4;&#x4F1A;&#x5927;&#x91CF;&#x5730;&#x6267;&#x884C; malloc &#x548C; free &#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x9891;&#x7E41;&#x5730;&#x5728;&#x7528;&#x6237;&#x6001;&#x548C;&#x6838;&#x5FC3;&#x6001;&#x4E4B;&#x95F4;&#x8FDB;&#x884C;</p>
<p>&#x5207;&#x6362;&#xFF0C;&#x8FD9;&#x5C06;&#x4E25;&#x91CD;&#x5F71;&#x54CD; Python &#x7684;&#x6267;&#x884C;&#x6548;&#x7387;&#x3002;&#x4E3A;&#x4E86;&#x52A0;&#x901F; Python &#x7684;&#x6267;&#x884C;&#x6548;&#x7387;&#xFF0C;Python &#x5F15;&#x5165;&#x4E86;&#x4E00;&#x4E2A;&#x5185;&#x5B58;&#x6C60;&#x673A;&#x5236;&#xFF0C;&#x7528;&#x4E8E;&#x7BA1;&#x7406;&#x5BF9;&#x5C0F;&#x5757;&#x5185;&#x5B58;&#x7684;&#x7533;&#x8BF7;&#x548C;&#x91CA;&#x653E;&#x3002;Python &#x5185;&#x90E8;&#x9ED8;&#x8BA4;&#x7684;&#x5C0F;&#x5757;&#x5185;&#x5B58;&#x4E0E;&#x5927;&#x5757;&#x5185;&#x5B58;&#x7684;&#x5206;&#x754C;&#x70B9;&#x5B9A;&#x5728; 256 &#x4E2A;&#x5B57;&#x8282;&#xFF0C;&#x5F53;&#x7533;&#x8BF7;&#x7684;&#x5185;&#x5B58;&#x5C0F;&#x4E8E; 256 &#x5B57;&#x8282;&#x65F6;&#xFF0C;PyObject_Malloc &#x4F1A;&#x5728;&#x5185;&#x5B58;&#x6C60;&#x4E2D;&#x7533;&#x8BF7;&#x5185;&#x5B58;&#xFF1B;&#x5F53;&#x7533;&#x8BF7;&#x7684;&#x5185;&#x5B58;&#x5927;&#x4E8E; 256 &#x5B57;&#x8282;&#x65F6;&#xFF0C; PyObject_Malloc &#x7684;&#x884C;&#x4E3A;&#x5C06;&#x8715;&#x5316;&#x4E3A; malloc &#x7684;&#x884C;&#x4E3A;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x901A;&#x8FC7;&#x4FEE;&#x6539; Python &#x6E90;&#x4EE3;&#x7801;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6539;&#x53D8;&#x8FD9;&#x4E2A;&#x9ED8;&#x8BA4;&#x503C;&#xFF0C;&#x4ECE;&#x800C;&#x6539;&#x53D8; Python &#x7684;&#x9ED8;&#x8BA4;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x884C;&#x4E3A;&#x3002;</p>
<p>&#x8C03;&#x4F18;&#x624B;&#x6BB5;&#xFF08;&#x4E86;&#x89E3;&#xFF09; </p>
<p>1.&#x624B;&#x52A8;&#x5783;&#x573E;&#x56DE;&#x6536; </p>
<p>2.&#x8C03;&#x9AD8;&#x5783;&#x573E;&#x56DE;&#x6536;&#x9608;&#x503C; </p>
<p>3.&#x907F;&#x514D;&#x5FAA;&#x73AF;&#x5F15;&#x7528;&#xFF08;&#x624B;&#x52A8;&#x89E3;&#x5FAA;&#x73AF;&#x5F15;&#x7528;&#x548C;&#x4F7F;&#x7528;&#x5F31;&#x5F15;&#x7528;&#xFF09; </p>
<h3 id="&#x5185;&#x5B58;&#x6CC4;&#x9732;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x5982;&#x4F55;&#x907F;&#x514D;&#xFF1F;">&#x5185;&#x5B58;&#x6CC4;&#x9732;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x5982;&#x4F55;&#x907F;&#x514D;&#xFF1F;</h3>
<p>&#x6307;&#x7531;&#x4E8E;&#x758F;&#x5FFD;&#x6216;&#x9519;&#x8BEF;&#x9020;&#x6210;&#x7A0B;&#x5E8F;&#x672A;&#x80FD;&#x91CA;&#x653E;&#x5DF2;&#x7ECF;&#x4E0D;&#x518D;&#x4F7F;&#x7528;&#x7684;&#x5185;&#x5B58;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x5185;&#x5B58;&#x6CC4;&#x6F0F;&#x5E76;&#x975E;&#x6307;&#x5185;&#x5B58;&#x5728;&#x7269;&#x7406;&#x4E0A;&#x7684; &#x6D88;&#x5931;&#xFF0C;&#x800C;&#x662F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5206;&#x914D;&#x67D0;&#x6BB5;&#x5185;&#x5B58;&#x540E;&#xFF0C;&#x7531;&#x4E8E;&#x8BBE;&#x8BA1;&#x9519;&#x8BEF;&#xFF0C;&#x5931;&#x53BB;&#x4E86;&#x5BF9;&#x8BE5;&#x6BB5;&#x5185;&#x5B58;&#x7684;&#x63A7;&#x5236;&#xFF0C;&#x56E0;&#x800C;&#x9020;&#x6210;&#x4E86;&#x5185;&#x5B58;&#x7684;&#x6D6A;&#x8D39;&#x3002;&#x5BFC;&#x81F4;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x901F;&#x5EA6;&#x51CF;&#x6162;&#x751A;&#x81F3;&#x7CFB;&#x7EDF;&#x5D29;&#x6E83;&#x7B49;&#x4E25;&#x91CD;&#x540E;&#x679C;&#x3002; &#x6709; del() &#x51FD;&#x6570;&#x7684;&#x5BF9;&#x8C61;&#x95F4;&#x7684;&#x5FAA;&#x73AF;&#x5F15;&#x7528;&#x662F;&#x5BFC;&#x81F4;&#x5185;&#x5B58;&#x6CC4;&#x6F0F;&#x7684;&#x4E3B;&#x51F6;&#x3002; &#x4E0D;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x65F6;&#x4F7F;&#x7528;:del object &#x6765;&#x5220;&#x9664;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x5C31;&#x53EF;&#x4EE5;&#x6709;&#x6548;&#x9632;&#x6B62;&#x5185;&#x5B58;&#x6CC4;&#x6F0F;&#x95EE;&#x9898;&#x3002; &#x901A;&#x8FC7; Python &#x6269;&#x5C55;&#x6A21;&#x5757; gc &#x6765;&#x67E5;&#x770B;&#x4E0D;&#x80FD;&#x56DE;&#x6536;&#x7684;&#x5BF9;&#x8C61;&#x7684;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#x3002; &#x53EF;&#x4EE5;&#x901A;&#x8FC7; sys.getrefcount(obj) &#x6765;&#x83B7;&#x53D6;&#x5BF9;&#x8C61;&#x7684;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#xFF0C;&#x5E76;&#x6839;&#x636E;&#x8FD4;&#x56DE;&#x503C;&#x662F;&#x5426;&#x4E3A; 0 &#x6765;&#x5224;&#x65AD;&#x662F;&#x5426;&#x5185;&#x5B58; &#x6CC4;&#x6F0F;&#x3002;</p>
<h3 id="python-&#x51FD;&#x6570;&#x8C03;&#x7528;&#x7684;&#x65F6;&#x5019;&#x53C2;&#x6570;&#x7684;&#x4F20;&#x9012;&#x65B9;&#x5F0F;&#x662F;&#x503C;&#x4F20;&#x9012;&#x8FD8;&#x662F;&#x5F15;&#x7528;&#x4F20;&#x9012;&#xFF1F;">Python &#x51FD;&#x6570;&#x8C03;&#x7528;&#x7684;&#x65F6;&#x5019;&#x53C2;&#x6570;&#x7684;&#x4F20;&#x9012;&#x65B9;&#x5F0F;&#x662F;&#x503C;&#x4F20;&#x9012;&#x8FD8;&#x662F;&#x5F15;&#x7528;&#x4F20;&#x9012;&#xFF1F;</h3>
<p>Python &#x7684;&#x53C2;&#x6570;&#x4F20;&#x9012;&#x6709;&#xFF1A;&#x4F4D;&#x7F6E;&#x53C2;&#x6570;&#x3001;&#x9ED8;&#x8BA4;&#x53C2;&#x6570;&#x3001;&#x53EF;&#x53D8;&#x53C2;&#x6570;&#x3001;&#x5173;&#x952E;&#x5B57;&#x53C2;&#x6570;&#x3002; </p>
<p>&#x51FD;&#x6570;&#x7684;&#x4F20;&#x503C;&#x5230;&#x5E95;&#x662F;&#x503C;&#x4F20;&#x9012;&#x8FD8;&#x662F;&#x5F15;&#x7528;&#x4F20;&#x9012;&#xFF0C;&#x8981;&#x5206;&#x60C5;&#x51B5;</p>
<p>&#x4E0D;&#x53EF;&#x53D8;&#x53C2;&#x6570;&#x7528;&#x503C;&#x4F20;&#x9012;&#xFF1A; </p>
<p>&#x50CF;&#x6574;&#x6570;&#x548C;&#x5B57;&#x7B26;&#x4E32;&#x8FD9;&#x6837;&#x7684;&#x4E0D;&#x53EF;&#x53D8;&#x5BF9;&#x8C61;&#xFF0C;&#x662F;&#x901A;&#x8FC7;&#x62F7;&#x8D1D;&#x8FDB;&#x884C;&#x4F20;&#x9012;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x65E0;&#x8BBA;&#x5982;&#x4F55;&#x90FD;&#x4E0D;&#x53EF;&#x80FD;&#x5728;&#x539F;&#x5904;&#x6539;&#x53D8; </p>
<p>&#x4E0D;&#x53EF;&#x53D8;&#x5BF9;&#x8C61; &#x53EF;&#x53D8;&#x53C2;&#x6570;&#x662F;&#x5F15;&#x7528;&#x4F20;&#x9012;&#x7684;&#xFF1A; &#x6BD4;&#x5982;&#x50CF;&#x5217;&#x8868;&#xFF0C;&#x5B57;&#x5178;&#x8FD9;&#x6837;&#x7684;&#x5BF9;&#x8C61;&#x662F;&#x901A;&#x8FC7;&#x5F15;&#x7528;&#x4F20;&#x9012;&#x3001;&#x548C; C &#x8BED;&#x8A00;&#x91CC;&#x9762;&#x7684;&#x7528;&#x6307;&#x9488;&#x4F20;&#x9012;&#x6570;&#x7EC4;&#x5F88;&#x76F8;&#x4F3C;&#xFF0C;&#x53EF;&#x53D8;&#x5BF9;&#x8C61; &#x80FD;&#x5728;&#x51FD;&#x6570;&#x5185;&#x90E8;&#x6539;&#x53D8;&#x3002;</p>
<h3 id="&#x5BF9;&#x7F3A;&#x7701;&#x53C2;&#x6570;&#x7684;&#x7406;&#x89E3;-&#xFF1F;">&#x5BF9;&#x7F3A;&#x7701;&#x53C2;&#x6570;&#x7684;&#x7406;&#x89E3; &#xFF1F;</h3>
<p>&#x7F3A;&#x7701;&#x53C2;&#x6570;&#x6307;&#x5728;&#x8C03;&#x7528;&#x51FD;&#x6570;&#x7684;&#x65F6;&#x5019;&#x6CA1;&#x6709;&#x4F20;&#x5165;&#x53C2;&#x6570;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8C03;&#x7528;&#x9ED8;&#x8BA4;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x5728;&#x8C03;&#x7528;&#x51FD;&#x6570;&#x7684;&#x540C;&#x65F6;&#x8D4B;&#x503C;&#x65F6;&#xFF0C;&#x6240;&#x4F20;&#x5165;&#x7684;&#x53C2;&#x6570;&#x4F1A;&#x66FF;&#x4EE3;&#x9ED8;&#x8BA4;&#x53C2;&#x6570;&#x3002; <em>args &#x662F;&#x4E0D;&#x5B9A;&#x957F;&#x53C2;&#x6570;&#xFF0C;&#x4ED6;&#x53EF;&#x4EE5;&#x8868;&#x793A;&#x8F93;&#x5165;&#x53C2;&#x6570;&#x662F;&#x4E0D;&#x786E;&#x5B9A;&#x7684;&#xFF0C;&#x53EF;&#x4EE5;&#x662F;&#x4EFB;&#x610F;&#x591A;&#x4E2A;&#x3002; *</em>kwargs &#x662F;&#x5173;&#x952E;&#x5B57;&#x53C2;&#x6570;&#xFF0C;&#x8D4B;&#x503C;&#x7684;&#x65F6;&#x5019;&#x662F;&#x4EE5;&#x952E; = &#x503C;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x53C2;&#x6570;&#x662F;&#x53EF;&#x4EE5;&#x4EFB;&#x610F;&#x591A;&#x5BF9;&#x5728;&#x5B9A;&#x4E49;&#x51FD;&#x6570;&#x7684;&#x65F6;&#x5019; &#x4E0D;&#x786E;&#x5B9A;&#x4F1A;&#x6709;&#x591A;&#x5C11;&#x53C2;&#x6570;&#x4F1A;&#x4F20;&#x5165;&#x65F6;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#x3002;</p>
<h3 id="&#x4E3A;&#x4EC0;&#x4E48;&#x51FD;&#x6570;&#x540D;&#x5B57;&#x53EF;&#x4EE5;&#x5F53;&#x505A;&#x53C2;&#x6570;&#x7528;">&#x4E3A;&#x4EC0;&#x4E48;&#x51FD;&#x6570;&#x540D;&#x5B57;&#x53EF;&#x4EE5;&#x5F53;&#x505A;&#x53C2;&#x6570;&#x7528;?</h3>
<p>Python &#x4E2D;&#x4E00;&#x5207;&#x7686;&#x5BF9;&#x8C61;&#xFF0C;&#x51FD;&#x6570;&#x540D;&#x662F;&#x51FD;&#x6570;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x7A7A;&#x95F4;&#xFF0C;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x3002;</p>
<h3 id="map-&#x51FD;&#x6570;&#x548C;-reduce-&#x51FD;&#x6570;&#xFF1F;">map &#x51FD;&#x6570;&#x548C; reduce &#x51FD;&#x6570;&#xFF1F;</h3>
<p>&#x2460;&#x4ECE;&#x53C2;&#x6570;&#x65B9;&#x9762;&#x6765;&#x8BB2;&#xFF1A; map()&#x5305;&#x542B;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x662F;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x662F;&#x5E8F;&#x5217;&#xFF08;&#x5217;&#x8868; &#x6216;&#x5143;&#x7EC4;&#xFF09;&#x3002;&#x5176;&#x4E2D;&#xFF0C;&#x51FD;&#x6570;&#xFF08;&#x5373; map &#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x4F4D;&#x7F6E;&#x7684;&#x51FD;&#x6570;&#xFF09;&#x53EF;&#x4EE5;&#x63A5;&#x6536;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x53C2;&#x6570;&#x3002; reduce()&#x7B2C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x662F;&#x51FD;&#x6570;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x662F;&#x5E8F;&#x5217;&#xFF08;&#x5217;&#x8868;&#x6216;&#x5143;&#x7EC4;&#xFF09;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5176;&#x51FD;&#x6570;&#x5FC5;&#x987B;&#x63A5;&#x6536;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#x3002; &#x2461;&#x4ECE;&#x5BF9;&#x4F20;&#x8FDB;&#x53BB;&#x7684;&#x6570;&#x503C;&#x4F5C;&#x7528;&#x6765;&#x8BB2;&#xFF1A; map()&#x662F;&#x5C06;&#x4F20;&#x5165;&#x7684;&#x51FD;&#x6570;&#x4F9D;&#x6B21;&#x4F5C;&#x7528;&#x5230;&#x5E8F;&#x5217;&#x7684;&#x6BCF;&#x4E2A;&#x5143;&#x7D20;&#xFF0C;&#x6BCF;&#x4E2A;&#x5143;&#x7D20;&#x90FD;&#x662F;&#x72EC;&#x81EA;&#x88AB;&#x51FD;&#x6570;&#x201C;&#x4F5C;&#x7528;&#x201D;&#x4E00;&#x6B21; &#x3002;reduce()&#x662F;&#x5C06;&#x4F20;&#x4EBA;&#x7684;&#x51FD;&#x6570;&#x4F5C;&#x7528;&#x5728;&#x5E8F;&#x5217;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x5F97;&#x5230;&#x7ED3;&#x679C;&#x540E;&#xFF0C;&#x628A;&#x8FD9;&#x4E2A;&#x7ED3;&#x679C;&#x7EE7;&#x7EED;&#x4E0E;&#x4E0B;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x4F5C;&#x7528;&#xFF08;&#x7D2F;&#x79EF;&#x8BA1;&#x7B97;&#xFF09;&#x3002;</p>
<h3 id="&#x9012;&#x5F52;&#x51FD;&#x6570;&#x505C;&#x6B62;&#x7684;&#x6761;&#x4EF6;&#xFF1F;">&#x9012;&#x5F52;&#x51FD;&#x6570;&#x505C;&#x6B62;&#x7684;&#x6761;&#x4EF6;&#xFF1F;</h3>
<p>&#x9012;&#x5F52;&#x7684;&#x7EC8;&#x6B62;&#x6761;&#x4EF6;&#x4E00;&#x822C;&#x5B9A;&#x4E49;&#x5728;&#x9012;&#x5F52;&#x51FD;&#x6570;&#x5185;&#x90E8;&#xFF0C;&#x5728;&#x9012;&#x5F52;&#x8C03;&#x7528;&#x524D;&#x8981;&#x505A;&#x4E00;&#x4E2A;&#x6761;&#x4EF6;&#x5224;&#x65AD;&#xFF0C;&#x6839;&#x636E;&#x5224;&#x65AD;&#x7684;&#x7ED3;&#x679C;&#x9009;&#x62E9; &#x662F;&#x7EE7;&#x7EED;&#x8C03;&#x7528;&#x81EA;&#x8EAB;&#xFF0C;&#x8FD8;&#x662F; return;&#x8FD4;&#x56DE;&#x7EC8;&#x6B62;&#x9012;&#x5F52;&#x3002; </p>
<p>&#x7EC8;&#x6B62;&#x7684;&#x6761;&#x4EF6;&#xFF1A;</p>
<ol>
<li>&#x5224;&#x65AD;&#x9012;&#x5F52;&#x7684;&#x6B21;&#x6570;&#x662F;&#x5426;&#x8FBE;&#x5230;&#x67D0;&#x4E00;&#x9650;&#x5B9A;&#x503C;</li>
</ol>
<ol>
<li>&#x5224;&#x65AD;&#x8FD0;&#x7B97;&#x7684;&#x7ED3;&#x679C;&#x662F;&#x5426;&#x8FBE;&#x5230;&#x67D0;&#x4E2A;&#x8303;&#x56F4;&#x7B49;&#xFF0C;&#x6839;&#x636E;&#x8BBE;&#x8BA1;&#x7684;&#x76EE;&#x7684;&#x6765;&#x9009;&#x62E9;</li>
</ol>
<h3 id="&#x56DE;&#x8C03;&#x51FD;&#x6570;&#xFF0C;&#x5982;&#x4F55;&#x901A;&#x4FE1;&#x7684;">&#x56DE;&#x8C03;&#x51FD;&#x6570;&#xFF0C;&#x5982;&#x4F55;&#x901A;&#x4FE1;&#x7684;?</h3>
<p>&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x662F;&#x628A;&#x51FD;&#x6570;&#x7684;&#x5730;&#x5740;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#x4F20;&#x9012;&#x7ED9;&#x53E6;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x5C06;&#x6574;&#x4E2A;&#x51FD;&#x6570;&#x5F53;&#x4F5C;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x8D4B;&#x503C;&#x7ED9;&#x8C03;&#x7528;&#x7684;&#x51FD;&#x6570;&#x3002;</p>
<h3 id="&#x4EC0;&#x4E48;&#x662F;-lambda-&#x51FD;&#x6570;&#xFF1F;-&#x6709;&#x4EC0;&#x4E48;&#x597D;&#x5904;&#xFF1F;">&#x4EC0;&#x4E48;&#x662F; lambda &#x51FD;&#x6570;&#xFF1F; &#x6709;&#x4EC0;&#x4E48;&#x597D;&#x5904;&#xFF1F;</h3>
<p>lambda &#x51FD;&#x6570;&#x662F;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x63A5;&#x6536;&#x4EFB;&#x610F;&#x591A;&#x4E2A;&#x53C2;&#x6570;(&#x5305;&#x62EC;&#x53EF;&#x9009;&#x53C2;&#x6570;)&#x5E76;&#x4E14;&#x8FD4;&#x56DE;&#x5355;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#x503C;&#x7684;&#x51FD;&#x6570; 1&#x3001;lambda&#x51FD;&#x6570;&#x6BD4;&#x8F83;&#x8F7B;&#x4FBF;&#xFF0C;&#x5373;&#x7528;&#x5373;&#x4ECD;&#xFF0C;&#x5F88;&#x9002;&#x5408;&#x9700;&#x8981;&#x5B8C;&#x6210;&#x4E00;&#x9879;&#x529F;&#x80FD;&#xFF0C;&#x4F46;&#x662F;&#x6B64;&#x529F;&#x80FD;&#x53EA;&#x5728;&#x6B64;&#x4E00;&#x5904;&#x4F7F;&#x7528;&#xFF0C; &#x8FDE;&#x540D;&#x5B57;&#x90FD;&#x5F88;&#x968F;&#x610F;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF1B; 2&#x3001;&#x533F;&#x540D;&#x51FD;&#x6570;&#xFF0C;&#x4E00;&#x822C;&#x7528;&#x6765;&#x7ED9; filter&#xFF0C; map &#x8FD9;&#x6837;&#x7684;&#x51FD;&#x6570;&#x5F0F;&#x7F16;&#x7A0B;&#x670D;&#x52A1;; 3&#x3001;&#x4F5C;&#x4E3A;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#xFF0C;&#x4F20;&#x9012;&#x7ED9;&#x67D0;&#x4E9B;&#x5E94;&#x7528;&#xFF0C;&#x6BD4;&#x5982;&#x6D88;&#x606F;&#x5904;&#x7406;</p>
<h3 id="&#x5355;&#x4F8B;&#x6A21;&#x5F0F;&#x7684;&#x5E94;&#x7528;&#x573A;&#x666F;&#x6709;&#x54EA;&#x4E9B;&#xFF1F;">&#x5355;&#x4F8B;&#x6A21;&#x5F0F;&#x7684;&#x5E94;&#x7528;&#x573A;&#x666F;&#x6709;&#x54EA;&#x4E9B;&#xFF1F;</h3>
<p>&#x5355;&#x4F8B;&#x6A21;&#x5F0F;&#x5E94;&#x7528;&#x7684;&#x573A;&#x666F;&#x4E00;&#x822C;&#x53D1;&#x73B0;&#x5728;&#x4EE5;&#x4E0B;&#x6761;&#x4EF6;&#x4E0B;&#xFF1A; &#xFF08;1&#xFF09;&#x8D44;&#x6E90;&#x5171;&#x4EAB;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x907F;&#x514D;&#x7531;&#x4E8E;&#x8D44;&#x6E90;&#x64CD;&#x4F5C;&#x65F6;&#x5BFC;&#x81F4;&#x7684;&#x6027;&#x80FD;&#x6216;&#x635F;&#x8017;&#x7B49;&#x3002;&#x5982;&#x65E5;&#x5FD7;&#x6587;&#x4EF6;&#xFF0C;&#x5E94;&#x7528;&#x914D;&#x7F6E;&#x3002; &#xFF08;2&#xFF09;&#x63A7;&#x5236;&#x8D44;&#x6E90;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x65B9;&#x4FBF;&#x8D44;&#x6E90;&#x4E4B;&#x95F4;&#x7684;&#x4E92;&#x76F8;&#x901A;&#x4FE1;&#x3002;&#x5982;&#x7EBF;&#x7A0B;&#x6C60;&#x7B49;&#x3002; 1.&#x7F51;&#x7AD9;&#x7684;&#x8BA1;&#x6570;&#x5668; 2.&#x5E94;&#x7528;&#x914D;&#x7F6E; 3.&#x591A;&#x7EBF;&#x7A0B;&#x6C60; 4. &#x6570;&#x636E;&#x5E93;&#x914D;&#x7F6E;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x8FDE;&#x63A5;&#x6C60; 5.&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x65E5;&#x5FD7;&#x5E94;&#x7528;....</p>
<h3 id="&#x51FD;&#x6570;&#x88C5;&#x9970;&#x5668;&#x6709;&#x4EC0;&#x4E48;&#x4F5C;&#x7528;&#xFF1F;">&#x51FD;&#x6570;&#x88C5;&#x9970;&#x5668;&#x6709;&#x4EC0;&#x4E48;&#x4F5C;&#x7528;&#xFF1F;</h3>
<p>&#x88C5;&#x9970;&#x5668;&#x672C;&#x8D28;&#x4E0A;&#x662F;&#x4E00;&#x4E2A; Python &#x51FD;&#x6570;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x5728;&#x8BA9;&#x5176;&#x4ED6;&#x51FD;&#x6570;&#x5728;&#x4E0D;&#x9700;&#x8981;&#x505A;&#x4EFB;&#x4F55;&#x4EE3;&#x7801;&#x7684;&#x53D8;&#x52A8;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#x589E;&#x52A0;&#x989D;&#x5916;&#x7684;&#x529F;&#x80FD;&#x3002;&#x88C5; &#x9970;&#x5668;&#x7684;&#x8FD4;&#x56DE;&#x503C;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x5B83;&#x7ECF;&#x5E38;&#x7528;&#x4E8E;&#x6709;&#x5207;&#x9762;&#x9700;&#x6C42;&#x7684;&#x573A;&#x666F;&#x3002; &#x6BD4;&#x5982;&#xFF1A;&#x63D2;&#x5165;&#x65E5;&#x5FD7;&#x3001;&#x6027;&#x80FD;&#x6D4B;&#x8BD5;&#x3001;&#x4E8B;&#x52A1;&#x5904;&#x7406;&#x3001;&#x7F13;&#x5B58;&#x3001; &#x6743;&#x9650;&#x7684;&#x6821;&#x9A8C;&#x7B49;&#x573A;&#x666F; &#x6709;&#x4E86;&#x88C5;&#x9970;&#x5668;&#x5C31;&#x53EF;&#x4EE5;&#x62BD;&#x79BB;&#x51FA;&#x5927;&#x91CF;&#x7684;&#x4E0E;&#x51FD;&#x6570;&#x529F;&#x80FD;&#x672C;&#x8EAB;&#x65E0;&#x5173;&#x7684;&#x96F7;&#x540C;&#x4EE3;&#x7801;&#x5E76;&#x53D1;&#x5E76;&#x7EE7;&#x7EED;&#x4F7F;&#x7528;&#x3002;</p>
<h3 id="&#x751F;&#x6210;&#x5668;&#x3001;&#x8FED;&#x4EE3;&#x5668;&#x7684;&#x533A;&#x522B;&#xFF1F;">&#x751F;&#x6210;&#x5668;&#x3001;&#x8FED;&#x4EE3;&#x5668;&#x7684;&#x533A;&#x522B;&#xFF1F;</h3>
<p>&#x8FED;&#x4EE3;&#x5668;&#x662F;&#x4E00;&#x4E2A;&#x66F4;&#x62BD;&#x8C61;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x4EFB;&#x4F55;&#x5BF9;&#x8C61;&#xFF0C;&#x5982;&#x679C;&#x5B83;&#x7684;&#x7C7B;&#x6709; next &#x65B9;&#x6CD5;&#x548C; iter &#x65B9;&#x6CD5;&#x8FD4;&#x56DE;&#x81EA;&#x5DF1;&#x672C;&#x8EAB;&#xFF0C;&#x5BF9;&#x4E8E;string&#x3001;list&#x3001; dict&#x3001;tuple &#x7B49;&#x8FD9;&#x7C7B;&#x5BB9;&#x5668;&#x5BF9;&#x8C61;&#xFF0C;&#x4F7F;&#x7528; for &#x5FAA;&#x73AF;&#x904D;&#x5386;&#x662F;&#x5F88;&#x65B9;&#x4FBF;&#x7684;&#x3002;&#x5728;&#x540E;&#x53F0; for &#x8BED;&#x53E5;&#x5BF9;&#x5BB9;&#x5668;&#x5BF9;&#x8C61;&#x8C03;&#x7528; iter()&#x51FD;&#x6570;&#xFF0C;iter() &#x662F; python &#x7684;&#x5185;&#x7F6E;&#x51FD;&#x6570;&#x3002;iter()&#x4F1A;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x5B9A;&#x4E49;&#x4E86; next()&#x65B9;&#x6CD5;&#x7684;&#x8FED;&#x4EE3;&#x5668;&#x5BF9;&#x8C61;&#xFF0C;&#x5B83;&#x5728;&#x5BB9;&#x5668;&#x4E2D;&#x9010;&#x4E2A;&#x8BBF;&#x95EE;&#x5BB9;&#x5668;&#x5185;&#x5143;&#x7D20;&#xFF0C;next() &#x4E5F;&#x662F; python &#x7684;&#x5185;&#x7F6E;&#x51FD;&#x6570;&#x3002;&#x5728;&#x6CA1;&#x6709;&#x540E;&#x7EED;&#x5143;&#x7D20;&#x65F6;&#xFF0C;next()&#x4F1A;&#x629B;&#x51FA;&#x4E00;&#x4E2A; StopIteration &#x5F02;&#x5E38;&#x3002; &#x751F;&#x6210;&#x5668;&#xFF08;Generator&#xFF09;&#x662F;&#x521B;&#x5EFA;&#x8FED;&#x4EE3;&#x5668;&#x7684;&#x7B80;&#x5355;&#x800C;&#x5F3A;&#x5927;&#x7684;&#x5DE5;&#x5177;&#x3002;&#x5B83;&#x4EEC;&#x5199;&#x8D77;&#x6765;&#x5C31;&#x50CF;&#x662F;&#x6B63;&#x89C4;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x53EA;&#x662F;&#x5728;&#x9700;&#x8981;&#x8FD4;&#x56DE;&#x6570; &#x636E;&#x7684;&#x65F6;&#x5019;&#x4F7F;&#x7528; yield &#x8BED;&#x53E5;&#x3002;&#x6BCF;&#x6B21; next()&#x88AB;&#x8C03;&#x7528;&#x65F6;&#xFF0C;&#x751F;&#x6210;&#x5668;</p>
<p>&#x4F1A;&#x8FD4;&#x56DE;&#x5B83;&#x8131;&#x79BB;&#x7684;&#x4F4D;&#x7F6E;&#xFF08;&#x5B83;&#x8BB0;&#x5FC6;&#x8BED;&#x53E5;&#x6700;&#x540E;&#x4E00;&#x6B21;&#x6267;&#x884C;&#x7684;&#x4F4D;&#x7F6E; &#x548C;&#x6240;&#x6709;&#x7684;&#x6570;&#x636E;&#x503C;&#xFF09; &#x533A;&#x522B;&#xFF1A;&#x751F;&#x6210;&#x5668;&#x80FD;&#x505A;&#x5230;&#x8FED;&#x4EE3;&#x5668;&#x80FD;&#x505A;&#x7684;&#x6240;&#x6709;&#x4E8B;,&#x800C;&#x4E14;&#x56E0;&#x4E3A;&#x81EA;&#x52A8;&#x521B;&#x5EFA;&#x4E86; iter()&#x548C; next()&#x65B9;&#x6CD5;,&#x751F;&#x6210;&#x5668;&#x663E;&#x5F97;&#x7279;&#x522B;&#x7B80;&#x6D01;,&#x800C;&#x4E14; &#x751F;&#x6210;&#x5668;&#x4E5F;&#x662F;&#x9AD8;&#x6548;&#x7684;&#xFF0C;&#x4F7F;&#x7528;&#x751F;&#x6210;&#x5668;&#x8868;&#x8FBE;&#x5F0F;&#x53D6;&#x4EE3;&#x5217;&#x8868;&#x89E3;&#x6790;&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x8282;&#x7701;&#x5185;&#x5B58;&#x3002;&#x9664;&#x4E86;&#x521B;&#x5EFA;&#x548C;&#x4FDD;&#x5B58;&#x7A0B;&#x5E8F;&#x72B6;&#x6001;&#x7684;&#x81EA;&#x52A8;&#x65B9;&#x6CD5;,&#x5F53; &#x53D1;&#x751F;&#x5668;&#x7EC8;&#x7ED3;&#x65F6;,&#x8FD8;&#x4F1A;&#x81EA;&#x52A8;&#x629B;&#x51FA; StopIteration &#x5F02;&#x5E38;&#x3002;</p>
<h3 id="python-&#x4E2D;-yield-&#x7684;&#x7528;&#x6CD5;&#xFF1F;">Python &#x4E2D; yield &#x7684;&#x7528;&#x6CD5;&#xFF1F;</h3>
<p>yield &#x5C31;&#x662F;&#x4FDD;&#x5B58;&#x5F53;&#x524D;&#x7A0B;&#x5E8F;&#x6267;&#x884C;&#x72B6;&#x6001;&#x3002;&#x4F60;&#x7528; for &#x5FAA;&#x73AF;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6BCF;&#x6B21;&#x53D6;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x4F1A;&#x8BA1;&#x7B97;&#x4E00;&#x6B21;&#x3002;&#x7528; yield &#x7684;&#x51FD;&#x6570; &#x53EB; generator&#xFF0C;&#x548C; iterator &#x4E00;&#x6837;&#xFF0C;&#x5B83;&#x7684;&#x597D;&#x5904;&#x662F;&#x4E0D;&#x7528;&#x4E00;&#x6B21;&#x8BA1;&#x7B97;&#x6240;&#x6709;&#x5143;&#x7D20;&#xFF0C;&#x800C;&#x662F;&#x7528;&#x4E00;&#x6B21;&#x7B97;&#x4E00;&#x6B21;&#xFF0C;&#x53EF;&#x4EE5;&#x8282;&#x7701;&#x5F88;&#x591A;&#x7A7A;&#x95F4;&#x3002;generator &#x6BCF;&#x6B21;&#x8BA1;&#x7B97;&#x9700;&#x8981;&#x4E0A;&#x4E00;&#x6B21;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#xFF0C;&#x6240;&#x4EE5;&#x7528; yield&#xFF0C;&#x5426;&#x5219;&#x4E00; return&#xFF0C;&#x4E0A;&#x6B21;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#x5C31;&#x6CA1;&#x4E86;&#x3002;</p>
<h3 id="python-&#x4E2D;&#x7684;&#x53EF;&#x53D8;&#x5BF9;&#x8C61;&#x548C;&#x4E0D;&#x53EF;&#x53D8;&#x5BF9;&#x8C61;&#xFF1F;">Python &#x4E2D;&#x7684;&#x53EF;&#x53D8;&#x5BF9;&#x8C61;&#x548C;&#x4E0D;&#x53EF;&#x53D8;&#x5BF9;&#x8C61;&#xFF1F;</h3>
<p>&#x4E0D;&#x53EF;&#x53D8;&#x5BF9;&#x8C61;&#xFF0C;&#x8BE5;&#x5BF9;&#x8C61;&#x6240;&#x6307;&#x5411;&#x7684;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x503C;&#x4E0D;&#x80FD;&#x88AB;&#x6539;&#x53D8;&#x3002;&#x5F53;&#x6539;&#x53D8;&#x67D0;&#x4E2A;&#x53D8;&#x91CF;&#x65F6;&#x5019;&#xFF0C;&#x7531;&#x4E8E;&#x5176;&#x6240;&#x6307;&#x7684;&#x503C;&#x4E0D;&#x80FD;&#x88AB;&#x6539;&#x53D8;&#xFF0C;&#x76F8;&#x5F53; &#x4E8E;&#x628A;&#x539F;&#x6765;&#x7684;&#x503C;&#x590D;&#x5236;&#x4E00;&#x4EFD;&#x540E;&#x518D;&#x6539;&#x53D8;&#xFF0C;&#x8FD9;&#x4F1A;&#x5F00;&#x8F9F;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x53D8;&#x91CF;&#x518D;&#x6307;&#x5411;&#x8FD9;&#x4E2A;&#x65B0;&#x7684;&#x5730;&#x5740;&#x3002; &#x53EF;&#x53D8;&#x5BF9;&#x8C61;&#xFF0C;&#x8BE5;&#x5BF9;&#x8C61;&#x6240;&#x6307;&#x5411;&#x7684;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x503C;&#x53EF;&#x4EE5;&#x88AB;&#x6539;&#x53D8;&#x3002;&#x53D8;&#x91CF;&#xFF08;&#x51C6;&#x786E;&#x7684;&#x8BF4;&#x662F;&#x5F15;&#x7528;&#xFF09;&#x6539;&#x53D8;&#x540E;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x5176;&#x6240;&#x6307;&#x7684;&#x503C;&#x76F4;&#x63A5; &#x53D1;&#x751F;&#x6539;&#x53D8;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x53D1;&#x751F;&#x590D;&#x5236;&#x884C;&#x4E3A;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x5F00;&#x8F9F;&#x65B0;&#x7684;&#x51FA;&#x5730;&#x5740;&#xFF0C;&#x901A;&#x4FD7;&#x70B9;&#x8BF4;&#x5C31;&#x662F;&#x539F;&#x5730;&#x6539;&#x53D8;&#x3002;</p>
<p>Python &#x4E2D;&#xFF0C;&#x6570;&#x503C;&#x7C7B;&#x578B;&#xFF08;int &#x548C; float&#xFF09;&#x3001;&#x5B57;&#x7B26;&#x4E32; str&#x3001;&#x5143;&#x7EC4; tuple &#x90FD;&#x662F;&#x4E0D;&#x53EF;&#x53D8;&#x7C7B;&#x578B;&#x3002;&#x800C;&#x5217;&#x8868; list&#x3001;&#x5B57;&#x5178;dict&#x3001;&#x96C6;&#x5408; set &#x662F;&#x53EF;&#x53D8;&#x7C7B;&#x578B;&#x3002;</p>
<h3 id="python-&#x4E2D;-is-&#x548C;&#x7684;&#x533A;&#x522B;&#xFF1F;">Python &#x4E2D; is &#x548C;==&#x7684;&#x533A;&#x522B;&#xFF1F;</h3>
<p>is &#x5224;&#x65AD;&#x7684;&#x662F; a &#x5BF9;&#x8C61;&#x662F;&#x5426;&#x5C31;&#x662F; b &#x5BF9;&#x8C61;&#xFF0C;&#x662F;&#x901A;&#x8FC7; id &#x6765;&#x5224;&#x65AD;&#x7684;&#x3002; ==&#x5224;&#x65AD;&#x7684;&#x662F; a &#x5BF9;&#x8C61;&#x7684;&#x503C;&#x662F;&#x5426;&#x548C; b &#x5BF9;&#x8C61;&#x7684;&#x503C;&#x76F8;&#x7B49;&#xFF0C;&#x662F;&#x901A;&#x8FC7; value &#x6765;&#x5224;&#x65AD;&#x7684;&#x3002;</p>
<h3 id="python-&#x7684;&#x9B54;&#x6CD5;&#x65B9;&#x6CD5;">Python &#x7684;&#x9B54;&#x6CD5;&#x65B9;&#x6CD5;</h3>
<p>&#x9B54;&#x6CD5;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x53EF;&#x4EE5;&#x7ED9;&#x4F60;&#x7684;&#x7C7B;&#x589E;&#x52A0;&#x9B54;&#x529B;&#x7684;&#x7279;&#x6B8A;&#x65B9;&#x6CD5;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x7684;&#x5BF9;&#x8C61;&#x5B9E;&#x73B0; &#xFF08;&#x91CD;&#x8F7D;&#xFF09;&#x4E86;&#x8FD9;&#x4E9B;&#x65B9;&#x6CD5;&#x4E2D;&#x7684;&#x67D0;&#x4E00;&#x4E2A;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A; &#x65B9;&#x6CD5;&#x5C31;&#x4F1A;&#x5728;&#x7279;&#x6B8A;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x88AB; Python &#x6240;&#x8C03;&#x7528;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x81EA;&#x5DF1;&#x60F3;&#x8981;&#x7684;&#x884C;&#x4E3A;&#xFF0C;&#x800C;&#x8FD9;&#x4E00;&#x5207;&#x90FD;&#x662F;&#x81EA;&#x52A8;&#x53D1;&#x751F;&#x7684;&#x3002; &#x5B83;&#x4EEC;&#x7ECF;&#x5E38;&#x662F; &#x4E24;&#x4E2A;&#x4E0B;&#x5212;&#x7EBF;&#x5305;&#x56F4;&#x6765;&#x547D;&#x540D;&#x7684;&#xFF08;&#x6BD4;&#x5982; init&#xFF0C;lt&#xFF09;&#xFF0C;Python &#x7684;&#x9B54;&#x6CD5;&#x65B9;&#x6CD5;&#x662F;&#x975E;&#x5E38;&#x5F3A;&#x5927;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x4E86;&#x89E3;&#x5176;&#x4F7F;&#x7528;&#x65B9;&#x6CD5;&#x4E5F;&#x53D8;&#x5F97; &#x5C24;&#x4E3A;&#x91CD;&#x8981;&#xFF01;</p>
<p>init &#x6784;&#x9020;&#x5668;&#xFF0C;&#x5F53;&#x4E00;&#x4E2A;&#x5B9E;&#x4F8B;&#x88AB;&#x521B;&#x5EFA;&#x7684;&#x65F6;&#x5019;&#x521D;&#x59CB;&#x5316;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x4F46;&#x662F;&#x5B83;&#x5E76; &#x4E0D;&#x662F;&#x5B9E;&#x4F8B;&#x5316;&#x8C03;&#x7528;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x3002;new&#x624D;&#x662F;&#x5B9E;&#x4F8B;&#x5316;&#x5BF9;&#x8C61;&#x8C03;&#x7528;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#xFF0C;&#x5B83;&#x53EA;&#x53D6;&#x4E0B; cls &#x53C2;&#x6570;&#xFF0C;&#x5E76;&#x628A; &#x5176;&#x4ED6;&#x53C2;&#x6570;&#x4F20;&#x7ED9; init&#x3002; new&#x5F88;&#x5C11;&#x4F7F;&#x7528;&#xFF0C;&#x4F46;&#x662F;&#x4E5F;&#x6709;&#x5B83;&#x9002;&#x5408;&#x7684;&#x573A;&#x666F;&#xFF0C;&#x5C24;&#x5176; &#x662F;&#x5F53;&#x7C7B;&#x7EE7;&#x627F;&#x81EA;&#x4E00;&#x4E2A;&#x50CF;&#x5143;&#x7EC4;&#x6216;&#x8005;&#x5B57;&#x7B26;&#x4E32;&#x8FD9;&#x6837;&#x4E0D;&#x7ECF;&#x5E38;&#x6539;&#x53D8;&#x7684;&#x7C7B;&#x578B;&#x7684;&#x65F6;&#x5019;&#x3002; call &#x5141;&#x8BB8;&#x4E00;&#x4E2A;&#x7C7B;&#x7684;&#x5B9E;&#x4F8B;&#x50CF;&#x51FD;&#x6570;&#x4E00;&#x6837;&#x88AB;&#x8C03;&#x7528; &#x3002; getitem &#x5B9A;&#x4E49;&#x83B7;&#x53D6;&#x5BB9;&#x5668;&#x4E2D;&#x6307;&#x5B9A;&#x5143;&#x7D20;&#x7684;&#x884C;&#x4E3A;&#xFF0C;&#x76F8;&#x5F53;&#x4E8E; self[key] &#x3002; getattr &#x5B9A;&#x4E49;&#x5F53;&#x7528;&#x6237;&#x8BD5;&#x56FE;&#x8BBF;&#x95EE;&#x4E00;&#x4E2A;&#x4E0D;&#x5B58;&#x5728;&#x5C5E;&#x6027;&#x7684;&#x65F6;&#x5019;&#x7684;&#x884C;&#x4E3A; &#x3002; setattr &#x5B9A;&#x4E49;&#x5F53;&#x4E00;&#x4E2A;&#x5C5E;&#x6027;&#x88AB;&#x8BBE;&#x7F6E;&#x7684;&#x65F6;&#x5019;&#x7684;&#x884C;&#x4E3A; &#x3002; getattribute &#x5B9A;&#x4E49;&#x5F53;&#x4E00;&#x4E2A;&#x5C5E;&#x6027;&#x88AB;&#x8BBF;&#x95EE;&#x7684;&#x65F6;&#x5019;&#x7684;&#x884C;&#x4E3A; &#x3002;</p>
<h3 id="&#x8C08;&#x8C08;&#x4F60;&#x5BF9;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x7406;&#x89E3;&#xFF1F;">&#x8C08;&#x8C08;&#x4F60;&#x5BF9;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x7406;&#x89E3;&#xFF1F;</h3>
<p>&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x662F;&#x76F8;&#x5BF9;&#x4E8E;&#x9762;&#x5411;&#x8FC7;&#x7A0B;&#x800C;&#x8A00;&#x7684;&#x3002;&#x9762;&#x5411;&#x8FC7;&#x7A0B;&#x8BED;&#x8A00;&#x662F;&#x4E00;&#x79CD;&#x57FA;&#x4E8E;&#x529F;&#x80FD;&#x5206;&#x6790;&#x7684;&#x3001;&#x4EE5;&#x7B97;&#x6CD5;&#x4E3A;&#x4E2D;&#x5FC3;&#x7684;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x65B9;&#x6CD5;&#xFF1B;&#x800C;&#x9762; &#x5411;&#x5BF9;&#x8C61;&#x662F;&#x4E00;&#x79CD;&#x57FA;&#x4E8E;&#x7ED3;&#x6784;&#x5206;&#x6790;&#x7684;&#x3001;&#x4EE5;&#x6570;&#x636E;&#x4E3A;&#x4E2D;&#x5FC3;&#x7684;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x601D;&#x60F3;&#x3002;&#x5728;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x8BED;&#x8A00;&#x4E2D;&#x6709;&#x4E00;&#x4E2A;&#x6709;&#x5F88;&#x91CD;&#x8981;&#x4E1C;&#x897F;&#xFF0C;&#x53EB;&#x505A;&#x7C7B;&#x3002; &#x9762;&#x5411;&#x5BF9;&#x8C61;&#x6709;&#x4E09;&#x5927;&#x7279;&#x6027;&#xFF1A;&#x5C01;&#x88C5;&#x3001;&#x7EE7;&#x627F;&#x3001;&#x591A;&#x6001;&#x3002;</p>
<h3 id="python-&#x91CC;-match-&#x4E0E;-search-&#x7684;&#x533A;&#x522B;&#xFF1F;">Python &#x91CC; match &#x4E0E; search &#x7684;&#x533A;&#x522B;&#xFF1F;</h3>
<p>match()&#x51FD;&#x6570;&#x53EA;&#x68C0;&#x6D4B; RE &#x662F;&#x4E0D;&#x662F;&#x5728; string &#x7684;&#x5F00;&#x59CB;&#x4F4D;&#x7F6E;&#x5339;&#x914D;&#xFF0C; search()&#x4F1A;&#x626B;&#x63CF;&#x6574;&#x4E2A; string &#x67E5;&#x627E;&#x5339;&#x914D;&#xFF1B;&#x4E5F;&#x5C31;&#x662F;&#x8BF4; match()&#x53EA;&#x6709;&#x5728; 0 &#x4F4D;&#x7F6E;&#x5339;&#x914D;&#x6210;&#x529F;&#x7684;&#x8BDD;&#x624D;&#x6709;&#x8FD4;&#x56DE;&#xFF0C; &#x5982;&#x679C;&#x4E0D;&#x662F;&#x5F00;&#x59CB;&#x4F4D;&#x7F6E;&#x5339;&#x914D;&#x6210;&#x529F;&#x7684;&#x8BDD;&#xFF0C;match()&#x5C31;&#x8FD4;&#x56DE; none&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev " aria-label="Previous page: 开发">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="数据库.html" class="navigation navigation-next " aria-label="Next page: 数据库">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"python高级","level":"1.2.1","depth":2,"next":{"title":"数据库","level":"1.2.2","depth":2,"path":"part1/数据库.md","ref":"part1/数据库.md","articles":[]},"previous":{"title":"开发","level":"1.2","depth":1,"path":"part1/README.md","ref":"part1/README.md","articles":[{"title":"python高级","level":"1.2.1","depth":2,"path":"part1/python高级.md","ref":"part1/python高级.md","articles":[]},{"title":"数据库","level":"1.2.2","depth":2,"path":"part1/数据库.md","ref":"part1/数据库.md","articles":[]},{"title":"数据类型","level":"1.2.3","depth":2,"path":"part1/数据类型.md","ref":"part1/数据类型.md","articles":[]},{"title":"数据结构与算法","level":"1.2.4","depth":2,"path":"part1/数据结构与算法.md","ref":"part1/数据结构与算法.md","articles":[]},{"title":"爬虫","level":"1.2.5","depth":2,"path":"part1/爬虫.md","ref":"part1/爬虫.md","articles":[]},{"title":"网络协议","level":"1.2.6","depth":2,"path":"part1/网络协议.md","ref":"part1/网络协议.md","articles":[]},{"title":"系统编程","level":"1.2.7","depth":2,"path":"part1/系统编程.md","ref":"part1/系统编程.md","articles":[]},{"title":"vue","level":"1.2.8","depth":2,"path":"part1/vue.md","ref":"part1/vue.md","articles":[]},{"title":"线程、进程、协程","level":"1.2.9","depth":2,"path":"part1/线程、进程、协程.md","ref":"part1/线程、进程、协程.md","articles":[]},{"title":"linux","level":"1.2.10","depth":2,"path":"part1/linux.md","ref":"part1/linux.md","articles":[]},{"title":"web","level":"1.2.11","depth":2,"path":"part1/web.md","ref":"part1/web.md","articles":[]}]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"part1/python高级.md","mtime":"2020-09-17T02:25:31.324Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-09-17T03:27:10.161Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

