
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>爬虫 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="网络协议.html" />
    
    
    <link rel="prev" href="数据结构与算法.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="./">
            
                <a href="./">
            
                    
                    开发
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="python高级.html">
            
                <a href="python高级.html">
            
                    
                    python高级
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="数据库.html">
            
                <a href="数据库.html">
            
                    
                    数据库
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="数据类型.html">
            
                <a href="数据类型.html">
            
                    
                    数据类型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="数据结构与算法.html">
            
                <a href="数据结构与算法.html">
            
                    
                    数据结构与算法
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2.5" data-path="爬虫.html">
            
                <a href="爬虫.html">
            
                    
                    爬虫
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.6" data-path="网络协议.html">
            
                <a href="网络协议.html">
            
                    
                    网络协议
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.7" data-path="系统编程.html">
            
                <a href="系统编程.html">
            
                    
                    系统编程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.8" data-path="vue.html">
            
                <a href="vue.html">
            
                    
                    vue
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.9" data-path="线程、进程、协程.html">
            
                <a href="线程、进程、协程.html">
            
                    
                    线程、进程、协程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.10" data-path="linux.html">
            
                <a href="linux.html">
            
                    
                    linux
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.11" data-path="web.html">
            
                <a href="web.html">
            
                    
                    web
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../part2/">
            
                <a href="../part2/">
            
                    
                    网络安全
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../part2/渗透测试.html">
            
                <a href="../part2/渗透测试.html">
            
                    
                    渗透测试
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../part2/等级保护.html">
            
                <a href="../part2/等级保护.html">
            
                    
                    等级保护
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="../part2/风险评估.html">
            
                <a href="../part2/风险评估.html">
            
                    
                    风险评估
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="../part2/应急响应.html">
            
                <a href="../part2/应急响应.html">
            
                    
                    应急响应
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.5" data-path="../part2/安全巡检.html">
            
                <a href="../part2/安全巡检.html">
            
                    
                    安全巡检
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >爬虫</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x722C;&#x866B;">&#x722C;&#x866B;</h1>
<h2 id="&#x722C;&#x53D6;&#x6570;&#x636E;&#x540E;&#x4F7F;&#x7528;&#x54EA;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x5B58;&#x50A8;&#x6570;&#x636E;&#x7684;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#xFF1F;">&#x722C;&#x53D6;&#x6570;&#x636E;&#x540E;&#x4F7F;&#x7528;&#x54EA;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x5B58;&#x50A8;&#x6570;&#x636E;&#x7684;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#xFF1F;</h2>
<p>&#x4E00;&#x822C;&#x722C;&#x866B;&#x4F7F;&#x7528;&#x7684;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x662F;&#x6839;&#x636E;&#x9879;&#x76EE;&#x6765;&#x5B9A;&#x7684;&#x3002;&#x5982;&#x9700;&#x6C42;&#x65B9;&#x6307;&#x5B9A;&#x4E86;&#x4F7F;&#x7528;&#x4EC0;&#x4E48;&#x6570;&#x636E;&#x5E93;&#x3001;&#x5982;&#x679C;&#x6CA1;&#x6307;&#x5B9A;&#xFF0C;&#x90A3;&#x4E48; &#x51B3;&#x5B9A;&#x6743;&#x5C31;&#x5728;&#x722C;&#x866B;&#x7A0B;&#x5E8F;&#x5458;&#x624B;&#x91CC;&#xFF0C;&#x5982;&#x679C;&#x81EA;&#x9009;&#x7684;&#x8BDD;&#xFF0C;mysql &#x548C; mongodb &#x7528;&#x7684;&#x90FD;&#x662F;&#x6BD4;&#x8F83;&#x591A;&#x7684;&#x3002;&#x4F46;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x636E;&#x5E93;&#x54C1;&#x79CD;&#x6709;&#x5404;&#x81EA;&#x7684;&#x4F18;&#x7F3A;&#x70B9;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x573A;&#x666F;&#x4EFB;&#x4F55;&#x4E00;&#x79CD;&#x6570;&#x636E;&#x5E93;&#x90FD;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x5B58;&#x50A8;&#xFF0C;&#x4F46;&#x662F;&#x67D0;&#x79CD;&#x53EF;&#x80FD;&#x4F1A;&#x66F4;&#x597D;&#x3002;&#x6BD4;&#x5982;&#x5982;&#x679C;&#x6293; &#x53D6;&#x7684;&#x6570;&#x636E;&#x4E4B;&#x95F4;&#x7684;&#x8026;&#x5408;&#x6027;&#x5F88;&#x9AD8;&#xFF0C;&#x5173;&#x7CFB;&#x6BD4;&#x8F83;&#x590D;&#x6742;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x4E48; mysql &#x53EF;&#x80FD;&#x4F1A;&#x662F;&#x66F4;&#x597D;&#x7684;&#x9009;&#x62E9;&#x3002;&#x5982;&#x679C;&#x6293;&#x53D6;&#x7684;&#x6570;&#x636E;&#x662F; &#x5206;&#x7248;&#x5757;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x6CA1;&#x6709;&#x76F8;&#x4F3C;&#x6027;&#x6216;&#x5173;&#x8054;&#x6027;&#x4E0D;&#x5F3A;&#xFF0C;&#x90A3;&#x4E48;&#x53EF;&#x80FD; mongodb &#x4F1A;&#x66F4;&#x597D;&#x3002;&#x3002;&#x53E6;&#x5916;&#x4E3B;&#x6D41;&#x7684;&#x51E0;&#x79CD;&#x6C38; &#x4E45;&#x5B58;&#x50A8;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x90FD;&#x662F;&#x5177;&#x5907;&#x5904;&#x7406;&#x9AD8;&#x5E76;&#x53D1;&#x3001;&#x5177;&#x5907;&#x5B58;&#x50A8;&#x5927;&#x91CF;&#x6570;&#x636E;&#x7684;&#x80FD;&#x529B;&#x7684;&#xFF0C;&#x53EA;&#x662F;&#x7531;&#x4E8E;&#x5404;&#x81EA;&#x7684;&#x5B9E;&#x73B0;&#x673A;&#x5236;&#x4E0D;&#x4E00;&#x6837;&#xFF0C; &#x56E0;&#x6B64;&#x4F18;&#x5316;&#x65B9;&#x6848;&#x4E5F;&#x662F;&#x4E0D;&#x5C3D;&#x76F8;&#x540C;&#x3002;</p>
<p><strong>&#x603B;&#x7ED3;&#xFF1A;</strong>&#x6570;&#x636E;&#x5E93;&#x7684;&#x9009;&#x62E9;&#x5C3D;&#x91CF;&#x4ECE;&#x9879;&#x76EE;&#x7684;&#x6570;&#x636E;&#x5B58;&#x5728;&#x7684;&#x7279;&#x6027;&#x6765;&#x8003;&#x8651;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E2A; &#x95EE;&#x9898;&#x5C31;&#x662F;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x6700;&#x64C5;&#x957F;&#x90A3;&#x79CD;&#x6570;&#x636E;&#x5E93;&#x3002;</p>
<p>MongoDB &#x662F;&#x4F7F;&#x7528;&#x6BD4;&#x8F83;&#x591A;&#x7684;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x8FD9;&#x91CC;&#x4EE5; MongoDB &#x4E3A;&#x4F8B;&#xFF0C;&#x5927;&#x5BB6;&#x9700;&#x8981;&#x7ED3;&#x5408;&#x81EA;&#x5DF1;&#x771F;&#x5B9E;&#x5F00;&#x53D1;&#x73AF;&#x5883; &#x56DE;&#x7B54;&#x3002; </p>
<p><strong>&#x539F;&#x56E0;</strong>&#xFF1A;</p>
<p>1&#xFF09;&#x4E0E;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x76F8;&#x6BD4;MongoDB &#x7684;&#x4F18;&#x70B9;&#x5982;&#x4E0B;&#x3002;</p>
<p> &#x2460;&#x5F31;&#x4E00;&#x81F4;&#x6027;&#xFF08;&#x6700;&#x7EC8;&#x4E00;&#x81F4;&#xFF09;&#xFF0C;&#x66F4;&#x80FD;&#x4FDD;&#x8BC1;&#x7528;&#x6237;&#x7684;&#x8BBF;&#x95EE;&#x901F;&#x5EA6; &#x4E3E;&#x4F8B;&#x6765;&#x8BF4;&#xFF0C;&#x5728;&#x4F20;&#x7EDF;&#x7684;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#xFF0C;&#x4E00;&#x4E2A; COUNT &#x7C7B;&#x578B;&#x7684;&#x64CD;&#x4F5C;&#x4F1A;&#x9501;&#x5B9A;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x4FDD;&#x8BC1; &#x5F97;&#x5230;&#x201C;&#x5F53;&#x524D;&#x201D;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x8F83;&#x7CBE;&#x786E;&#x503C;&#x3002;&#x8FD9;&#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F8B; &#x5982;&#x901A;&#x8FC7; ATM &#x67E5;&#x770B;&#x8D26;&#x6237;&#x4FE1;&#x606F;&#x7684;&#x65F6;&#x5019;&#x5F88;&#x91CD;&#x8981;&#xFF0C; &#x4F46;&#x5BF9;&#x4E8E; Wordnik &#x6765;&#x8BF4;&#xFF0C;&#x6570;&#x636E;&#x662F;&#x4E0D;&#x65AD;&#x66F4;&#x65B0;&#x548C;&#x589E;&#x957F;&#x7684;&#xFF0C;&#x8FD9;&#x79CD;&#x201C;&#x8F83;&#x7CBE;&#x786E;&#x201D;&#x7684;&#x4FDD;&#x8BC1;&#x51E0;&#x4E4E;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x610F;&#x4E49;&#xFF0C;&#x53CD;&#x800C; &#x4F1A;&#x4EA7;&#x751F;&#x5F88;&#x5927;&#x7684;&#x5EF6; &#x8FDF;&#x3002;&#x4ED6;&#x4EEC;&#x9700;&#x8981;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x201C;&#x5927;&#x7EA6;&#x201D;&#x7684;&#x6570;&#x5B57;&#x4EE5;&#x53CA;&#x66F4;&#x5FEB;&#x7684;&#x5904;&#x7406;&#x901F;&#x5EA6;&#x3002; &#x4F46;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B; MongoDB &#x4F1A;&#x9501;&#x4F4F;&#x6570;&#x636E;&#x5E93;&#x3002;&#x5982;&#x679C;&#x6B64;&#x65F6;&#x6B63;&#x6709;&#x6570;&#x767E;&#x4E2A;&#x8BF7;&#x6C42;&#xFF0C;&#x5219;&#x5B83;&#x4EEC;&#x4F1A;&#x5806;&#x79EF;&#x8D77;&#x6765;&#xFF0C;&#x9020;&#x6210; &#x8BB8;&#x591A;&#x95EE;&#x9898;&#x3002;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x4E86;&#x4E0B;&#x9762;&#x7684;&#x4F18;&#x5316;&#x65B9;&#x5F0F;&#x6765;&#x907F;&#x514D;&#x9501;&#x5B9A;&#x3002; &#x6BCF;&#x6B21;&#x66F4;&#x65B0;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x5148;&#x67E5;&#x8BE2;&#x8BB0;&#x5F55;&#x3002;&#x67E5;&#x8BE2;&#x64CD;&#x4F5C;&#x4F1A;&#x5C06;&#x5BF9;&#x8C61;&#x653E;&#x5165;&#x5185;&#x5B58;&#xFF0C;&#x4E8E;&#x662F;&#x66F4;&#x65B0;&#x5219;&#x4F1A;&#x5C3D;&#x53EF;&#x80FD;&#x7684;&#x8FC5;&#x901F;&#x3002;&#x5728;&#x4E3B;/ &#x4ECE;&#x90E8;&#x7F72;&#x65B9;&#x6848;&#x4E2D;&#xFF0C;&#x4ECE;&#x8282;&#x70B9;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x201C;-pretouch&#x201D;&#x53C2;&#x6570;&#x8FD0;&#x884C;&#xFF0C;&#x8FD9;&#x4E5F;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x76F8;&#x540C;&#x7684;&#x6548;&#x679C;&#x3002; &#x4F7F;&#x7528;&#x591A;&#x4E2A; mongod &#x8FDB;&#x7A0B;&#x3002;&#x6211;&#x4EEC;&#x6839;&#x636E;&#x8BBF;&#x95EE;&#x6A21;&#x5F0F;&#x5C06;&#x6570;&#x636E;&#x5E93;&#x62C6;&#x5206;&#x6210;&#x591A;&#x4E2A;&#x8FDB;&#x7A0B;&#x3002;</p>
<p> &#x2461;&#x6587;&#x6863;&#x7ED3;&#x6784;&#x7684;&#x5B58;&#x50A8;&#x65B9;&#x5F0F;&#xFF0C;&#x80FD;&#x591F;&#x66F4;&#x4FBF;&#x6377;&#x7684;&#x83B7;&#x53D6;&#x6570;&#x636E;&#x3002; &#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x5C42;&#x7EA7;&#x5F0F;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x6765;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x8981;&#x5C06;&#x8FD9;&#x6837;&#x7684;&#x6570;&#x636E;&#x4F7F;&#x7528;&#x6241;&#x5E73;&#x5F0F;&#x7684;&#xFF0C;&#x8868;&#x72B6;&#x7684;&#x7ED3;&#x6784;&#x6765;&#x4FDD;&#x5B58;&#x6570;&#x636E;&#xFF0C; &#x8FD9;&#x65E0;&#x8BBA;&#x662F;&#x5728;&#x67E5;&#x8BE2;&#x8FD8;&#x662F;&#x83B7;&#x53D6;&#x6570;&#x636E;&#x65F6;&#x90FD;&#x5341;&#x5206;&#x56F0;&#x96BE;&#x3002; &#x2462;&#x5185;&#x7F6E; GridFS&#xFF0C;&#x652F;&#x6301;&#x5927;&#x5BB9;&#x91CF;&#x7684;&#x5B58;&#x50A8;&#x3002; GridFS &#x662F;&#x4E00;&#x4E2A;&#x51FA;&#x8272;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#xFF0C;&#x53EF;&#x4EE5;&#x652F;&#x6301;&#x6D77;&#x91CF;&#x7684;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x3002;&#x5185;&#x7F6E;&#x4E86; GridFS &#x4E86; MongoDB&#xFF0C; &#x80FD;&#x591F;&#x6EE1;&#x8DB3;&#x5BF9;&#x5927;&#x6570;&#x636E;&#x96C6;&#x7684;&#x5FEB;&#x901F;&#x8303;&#x56F4;&#x67E5;&#x8BE2;&#x3002;</p>
<p>&#x2463;&#x5185;&#x7F6E; Sharding&#x3002; &#x63D0;&#x4F9B;&#x57FA;&#x4E8E; Range &#x7684; Auto Sharding &#x673A;&#x5236;&#xFF1A;&#x4E00;&#x4E2A; collection &#x53EF;&#x6309;&#x7167;&#x8BB0;&#x5F55;&#x7684;&#x8303;&#x56F4;&#xFF0C;&#x5206;&#x6210;&#x82E5;&#x5E72;&#x4E2A;&#x6BB5;&#xFF0C; &#x5207;&#x5206;&#x5230;&#x4E0D;&#x540C;&#x7684; Shard &#x4E0A;&#x3002;Shards &#x53EF;&#x4EE5;&#x548C;&#x590D;&#x5236;&#x7ED3;&#x5408;&#xFF0C;&#x914D;&#x5408; Replica sets &#x80FD;&#x591F;&#x5B9E;&#x73B0;Sharding+fail-over&#xFF0C; &#x4E0D;&#x540C;&#x7684; Shard &#x4E4B;&#x95F4;&#x53EF;&#x4EE5;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x3002;&#x67E5;&#x8BE2;&#x662F;&#x5BF9; &#x5BA2;&#x6237;&#x7AEF;&#x662F;&#x900F;&#x660E;&#x7684;&#x3002;&#x5BA2;&#x6237;&#x7AEF;&#x6267;&#x884C;&#x67E5;&#x8BE2;&#xFF0C;&#x7EDF;&#x8BA1;&#xFF0C;MapReduce &#x7B49;&#x64CD;&#x4F5C;&#xFF0C;&#x8FD9;&#x4E9B;&#x4F1A;&#x88AB; MongoDB &#x81EA;&#x52A8;&#x8DEF;&#x7531;&#x5230;&#x540E;&#x7AEF;&#x7684;&#x6570;&#x636E;&#x8282;&#x70B9;&#x3002;&#x8FD9;&#x8BA9;&#x6211;&#x4EEC;&#x5173;&#x6CE8;&#x4E8E;&#x81EA;&#x5DF1;&#x7684;&#x4E1A;&#x52A1;&#xFF0C;&#x9002;&#x5F53;&#x7684; &#x65F6; &#x5019;&#x53EF;&#x4EE5;&#x65E0;&#x75DB;&#x7684;&#x5347;&#x7EA7;&#x3002;MongoDB &#x7684; Sharding &#x8BBE;&#x8BA1;&#x80FD;&#x529B;&#x8F83;&#x5927;&#x53EF;&#x652F;&#x6301;&#x7EA6; 20 petabytes&#xFF0C;&#x8DB3;&#x4EE5;&#x652F;&#x6491;&#x4E00;&#x822C; &#x5E94;&#x7528;&#x3002; &#x8FD9;&#x53EF;&#x4EE5;&#x4FDD;&#x8BC1; MongoDB &#x8FD0;&#x884C;&#x5728;&#x4FBF;&#x5B9C;&#x7684; PC &#x670D;&#x52A1;&#x5668;&#x96C6;&#x7FA4;&#x4E0A;&#x3002;PC &#x96C6;&#x7FA4;&#x6269;&#x5145;&#x8D77;&#x6765;&#x975E;&#x5E38;&#x65B9;&#x4FBF;&#x5E76;&#x4E14;&#x6210;&#x672C;&#x5F88;&#x4F4E;&#xFF0C; &#x907F;&#x514D;&#x4E86;&#x201C;sharding&#x201D;&#x64CD;&#x4F5C;&#x7684;&#x590D;&#x6742;&#x6027;&#x548C;&#x6210;&#x672C;&#x3002; </p>
<p>&#x2464;&#x7B2C;&#x4E09;&#x65B9;&#x652F;&#x6301;&#x4E30;&#x5BCC;&#x3002;(&#x8FD9;&#x662F;&#x4E0E;&#x5176;&#x4ED6;&#x7684; NoSQL &#x76F8;&#x6BD4;&#xFF0C;MongoDB &#x4E5F;&#x5177;&#x6709;&#x7684;&#x4F18;&#x52BF;) &#x73B0;&#x5728;&#x7F51;&#x7EDC;&#x4E0A;&#x7684;&#x5F88;&#x591A; NoSQL &#x5F00;&#x6E90;&#x6570;&#x636E;&#x5E93;&#x5B8C;&#x5168;&#x5C5E;&#x4E8E;&#x793E;&#x533A;&#x578B;&#x7684;&#xFF0C;&#x6CA1;&#x6709;&#x5B98;&#x65B9;&#x652F;&#x6301;&#xFF0C;&#x7ED9;&#x4F7F;&#x7528;&#x8005;&#x5E26;&#x6765;&#x4E86;&#x5F88;&#x5927;&#x7684; &#x98CE;&#x9669;&#x3002;&#x800C;&#x5F00;&#x6E90;&#x6587;&#x6863;&#x6570;&#x636E;&#x5E93; MongoDB &#x80CC;&#x540E;&#x6709;&#x5546;&#x4E1A;&#x516C;&#x53F8; 10gen &#x4E3A;&#x5176;&#x63D0;&#x4F9B;&#x4F9B;&#x5546;&#x4E1A;&#x57F9;&#x8BAD;&#x548C;&#x652F;&#x6301;&#x3002; &#x800C;&#x4E14; MongoDB &#x793E;&#x533A;&#x975E;&#x5E38;&#x6D3B;&#x8DC3;&#xFF0C;&#x5F88;&#x591A;&#x5F00;&#x53D1;&#x6846;&#x67B6;&#x90FD;&#x8FC5;&#x901F;&#x63D0;&#x4F9B;&#x4E86;&#x5BF9; MongDB &#x7684;&#x652F;&#x6301;&#x3002;&#x4E0D;&#x5C11;&#x77E5;&#x540D;&#x5927;&#x516C;&#x53F8; &#x548C;&#x7F51;&#x7AD9;&#x4E5F;&#x5728;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x4E2D;&#x4F7F;&#x7528; MongoDB&#xFF0C;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x521B;&#x65B0;&#x578B;&#x4F01;&#x4E1A;&#x8F6C;&#x800C;&#x4F7F;&#x7528; MongoDB &#x4F5C;&#x4E3A;&#x548C; Django&#xFF0C;RoR &#x6765;&#x642D;&#x914D;&#x7684;&#x6280;&#x672F;&#x65B9;&#x6848;&#x3002;</p>
<p> &#x2465;&#x6027;&#x80FD;&#x4F18;&#x8D8A; &#x5728;&#x4F7F;&#x7528;&#x573A;&#x5408;&#x4E0B;&#xFF0C;&#x5343;&#x4E07;&#x7EA7;&#x522B;&#x7684;&#x6587;&#x6863;&#x5BF9;&#x8C61;&#xFF0C;&#x8FD1; 10G &#x7684;&#x6570;&#x636E;&#xFF0C;&#x5BF9;&#x6709;&#x7D22;&#x5F15;&#x7684; ID &#x7684;&#x67E5;&#x8BE2;&#x4E0D;&#x4F1A;&#x6BD4; mysql &#x6162;&#xFF0C; &#x800C;&#x5BF9;&#x975E;&#x7D22;&#x5F15;&#x5B57;&#x6BB5;&#x7684;&#x67E5;&#x8BE2;&#xFF0C;&#x5219;&#x662F;&#x5168;&#x9762;&#x80DC;&#x51FA;&#x3002; mysql &#x5B9E;&#x9645;&#x65E0;&#x6CD5;&#x80DC;&#x4EFB;&#x5927;&#x6570;&#x636E;&#x91CF;&#x4E0B;&#x4EFB;&#x610F;&#x5B57;&#x6BB5;&#x7684;&#x67E5;&#x8BE2;&#xFF0C;&#x800C; mongodb &#x7684;&#x67E5;&#x8BE2;&#x6027;&#x80FD;&#x5B9E;&#x5728;&#x8BA9;&#x6211;&#x60CA;&#x8BB6;&#x3002;&#x5199;&#x5165;&#x6027;&#x80FD;&#x540C;&#x6837;&#x5F88;&#x4EE4;&#x4EBA;&#x6EE1;&#x610F;&#xFF0C;&#x540C;&#x6837;&#x5199;&#x5165;&#x767E;&#x4E07;&#x7EA7;&#x522B;&#x7684;&#x6570; &#x636E;&#xFF0C; mongodb &#x6BD4;&#x6211;&#x4EE5;&#x524D;&#x8BD5;&#x7528;&#x8FC7;&#x7684;couchdb &#x8981;&#x5FEB;&#x5F97;&#x591A;&#xFF0C;&#x57FA;&#x672C; 10 &#x5206;&#x949F;&#x4EE5;&#x4E0B;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x3002;&#x8865;&#x4E0A;&#x4E00;&#x53E5;&#xFF0C;&#x89C2;&#x5BDF;&#x8FC7; &#x7A0B;&#x4E2D; mongodb &#x90FD;&#x8FDC;&#x7B97;&#x4E0D;&#x4E0A;&#x662F; CPU &#x6740;&#x624B;&#x3002; </p>
<p>2)Mongodb &#x4E0E; redis &#x76F8;&#x6BD4;&#x8F83; </p>
<p>&#x2460;mongodb &#x6587;&#x4EF6;&#x5B58;&#x50A8;&#x662F; BSON &#x683C;&#x5F0F;&#x7C7B;&#x4F3C; JSON&#xFF0C;&#x6216;&#x81EA;&#x5B9A;&#x4E49;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x683C;&#x5F0F;&#x3002; mongodb &#x4E0E; redis &#x6027;&#x80FD;&#x90FD;&#x5F88;&#x4F9D;&#x8D56;&#x5185;&#x5B58;&#x7684;&#x5927;&#x5C0F;&#xFF0C;mongodb &#x6709;&#x4E30;&#x5BCC;&#x7684;&#x6570;&#x636E;&#x8868;&#x8FBE;&#x3001;&#x7D22;&#x5F15;&#xFF1B;&#x6700;&#x7C7B;&#x4F3C;&#x4E8E;&#x5173; &#x7CFB;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x652F;&#x6301;&#x4E30;&#x5BCC;&#x7684;&#x67E5;&#x8BE2;&#x8BED;&#x8A00;&#xFF0C;redis &#x6570;&#x636E;&#x4E30;&#x5BCC;&#xFF0C;&#x8F83;&#x5C11;&#x7684; IO &#xFF0C;&#x8FD9;&#x65B9;&#x9762; mongodb &#x4F18;&#x52BF;&#x660E;&#x663E;&#x3002;</p>
<p> &#x2461;mongodb &#x4E0D;&#x652F;&#x6301;&#x4E8B;&#x7269;&#xFF0C;&#x9760;&#x5BA2;&#x6237;&#x7AEF;&#x81EA;&#x8EAB;&#x4FDD;&#x8BC1;&#xFF0C;redis &#x652F;&#x6301;&#x4E8B;&#x7269;&#xFF0C;&#x6BD4;&#x8F83;&#x5F31;&#xFF0C;&#x4EC5;&#x80FD;&#x4FDD;&#x8BC1;&#x4E8B;&#x7269;&#x4E2D;&#x7684;&#x64CD; &#x4F5C;&#x6309;&#x987A;&#x5E8F;&#x6267;&#x884C;&#xFF0C;&#x8FD9;&#x65B9;&#x9762; redis &#x4F18;&#x4E8E;mongodb&#x3002; </p>
<p>&#x2462;mongodb &#x5BF9;&#x6D77;&#x91CF;&#x6570;&#x636E;&#x7684;&#x8BBF;&#x95EE;&#x6548;&#x7387;&#x63D0;&#x5347;&#xFF0C;redis &#x8F83;&#x5C0F;&#x6570;&#x636E;&#x91CF;&#x7684;&#x6027;&#x80FD;&#x53CA;&#x8FD0;&#x7B97;,&#x8FD9;&#x65B9;&#x9762; mongodb &#x6027;&#x80FD;&#x4F18;&#x4E8E; redis .monbgodb &#x6709; mapredurce &#x529F;&#x80FD;&#xFF0C;&#x63D0;&#x4F9B;&#x6570;&#x636E;&#x5206;&#x6790;&#xFF0C;redis &#x6CA1;&#x6709; &#xFF0C;&#x8FD9;&#x65B9;&#x9762; mongodb &#x4F18;&#x4E8E; redis &#x3002;</p>
<h2 id="&#x4F60;&#x7528;&#x8FC7;&#x7684;&#x722C;&#x866B;&#x6846;&#x67B6;&#x6216;&#x8005;&#x6A21;&#x5757;&#x6709;&#x54EA;&#x4E9B;&#xFF1F;&#x8C08;&#x8C08;&#x4ED6;&#x4EEC;&#x7684;&#x533A;&#x522B;&#x6216;&#x8005;&#x4F18;&#x7F3A;&#x70B9;&#xFF1F;">&#x4F60;&#x7528;&#x8FC7;&#x7684;&#x722C;&#x866B;&#x6846;&#x67B6;&#x6216;&#x8005;&#x6A21;&#x5757;&#x6709;&#x54EA;&#x4E9B;&#xFF1F;&#x8C08;&#x8C08;&#x4ED6;&#x4EEC;&#x7684;&#x533A;&#x522B;&#x6216;&#x8005;&#x4F18;&#x7F3A;&#x70B9;&#xFF1F;</h2>
<p>Python &#x81EA;&#x5E26;&#xFF1A;urllib&#x3001;urllib2 </p>
<p>&#x7B2C;&#x4E09;&#x65B9;&#xFF1A;requests&#xFF0C;aiohttp </p>
<p>&#x6846;&#x67B6;&#xFF1A; Scrapy&#x3001;pyspider urllib &#x548C; urllib2 &#x6A21;&#x5757;&#x90FD;&#x505A;&#x4E0E;&#x8BF7;&#x6C42; URL &#x76F8;&#x5173;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x4F46;&#x4ED6;&#x4EEC;&#x63D0;&#x4F9B;&#x4E0D;&#x540C;&#x7684;&#x529F;&#x80FD;&#x3002; </p>
<p>urllib2&#xFF1A;urllib2.urlopen &#x53EF;&#x4EE5;&#x63A5;&#x53D7;&#x4E00;&#x4E2A; Request &#x5BF9;&#x8C61;&#x6216;&#x8005; url&#xFF0C;&#xFF08;&#x5728;&#x63A5;&#x53D7; Request &#x5BF9;&#x8C61;&#x65F6;&#x5019;&#xFF0C;&#x5E76;&#x4EE5; &#x6B64;&#x53EF;&#x4EE5;&#x6765;&#x8BBE;&#x7F6E;&#x4E00;&#x4E2A; URL &#x7684;headers&#xFF09;&#xFF0C;urllib.urlopen &#x53EA;&#x63A5;&#x6536;&#x4E00;&#x4E2A; url&#x3002; urllib &#x6709; urlencode,urllib2 &#x6CA1;&#x6709;&#xFF0C;&#x56E0;&#x6B64;&#x603B;&#x662F;urllib&#xFF0C;urllib2 &#x5E38;&#x4F1A;&#x4E00;&#x8D77;&#x4F7F;&#x7528;&#x7684;&#x539F;&#x56E0;&#x3002;</p>
<p> scrapy &#x662F;&#x5C01;&#x88C5;&#x8D77;&#x6765;&#x7684;&#x6846;&#x67B6;&#xFF0C;&#x5B83;&#x5305;&#x542B;&#x4E86;&#x4E0B;&#x8F7D;&#x5668;&#xFF0C;&#x89E3;&#x6790;&#x5668;&#xFF0C;&#x65E5;&#x5FD7;&#x53CA;&#x5F02;&#x5E38;&#x5904;&#x7406;&#xFF0C;&#x57FA;&#x4E8E;&#x591A;&#x7EBF;&#x7A0B;&#xFF0C;twisted &#x7684; &#x65B9;&#x5F0F;&#x5904;&#x7406;&#xFF0C;&#x5BF9;&#x4E8E;&#x56FA;&#x5B9A;&#x5355;&#x4E2A;&#x7F51;&#x7AD9;&#x7684;&#x722C;&#x53D6;&#x5F00;&#x53D1;&#xFF0C;&#x6709;&#x4F18;&#x52BF;&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x4E8E;&#x591A;&#x7F51;&#x7AD9;&#x722C;&#x53D6;&#xFF0C;&#x5E76;&#x53D1;&#x53CA;&#x5206;&#x5E03;&#x5F0F;&#x5904;&#x7406;&#x65B9;&#x9762;&#xFF0C;&#x4E0D; &#x591F;&#x7075;&#x6D3B;&#xFF0C;&#x4E0D;&#x4FBF;&#x8C03;&#x6574;&#x4E0E;&#x62EC;&#x5C55;&#x3002;</p>
<ul>
<li>Scrapy &#x4F18;&#x70B9;&#xFF1A; scrapy &#x662F;&#x5F02;&#x6B65;&#x7684;&#xFF1B; &#x91C7;&#x53D6;&#x53EF;&#x8BFB;&#x6027;&#x66F4;&#x5F3A;&#x7684; xpath &#x4EE3;&#x66FF;&#x6B63;&#x5219;&#xFF1B; &#x5F3A;&#x5927;&#x7684;&#x7EDF;&#x8BA1;&#x548C; log &#x7CFB;&#x7EDF;&#xFF1B; &#x540C;&#x65F6;&#x5728;&#x4E0D;&#x540C;&#x7684; url &#x4E0A;&#x722C;&#x884C;&#xFF1B; &#x652F;&#x6301; shell &#x65B9;&#x5F0F;&#xFF0C;&#x65B9;&#x4FBF;&#x72EC;&#x7ACB;&#x8C03;&#x8BD5;&#xFF1B; &#x5199; middleware,&#x65B9;&#x4FBF;&#x5199;&#x4E00;&#x4E9B;&#x7EDF;&#x4E00;&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#xFF1B; &#x901A;&#x8FC7;&#x7BA1;&#x9053;&#x7684;&#x65B9;&#x5F0F;&#x5B58;&#x5165;&#x6570;&#x636E;&#x5E93;&#xFF1B;</li>
<li>Scrapy &#x7F3A;&#x70B9;&#xFF1A; &#x57FA;&#x4E8E; python &#x7684;&#x722C;&#x866B;&#x6846;&#x67B6;&#xFF0C;&#x6269;&#x5C55;&#x6027;&#x6BD4;&#x8F83;&#x5DEE;&#xFF1B; &#x57FA;&#x4E8E; twisted &#x6846;&#x67B6;&#xFF0C;&#x8FD0;&#x884C;&#x4E2D;&#x7684; exception &#x662F;&#x4E0D;&#x4F1A;&#x5E72;&#x6389;reactor&#xFF0C;&#x5E76;&#x4E14;&#x5F02;&#x6B65;&#x6846;&#x67B6;&#x51FA;&#x9519;&#x540E;&#x662F;&#x4E0D;&#x4F1A;&#x505C;&#x6389; &#x5176;&#x4ED6;&#x4EFB;&#x52A1;&#x7684;&#xFF0C;&#x6570;&#x636E;&#x51FA;&#x9519;&#x540E;&#x96BE;&#x4EE5;&#x5BDF;&#x89C9;&#x3002;</li>
</ul>
<p>request &#x662F;&#x4E00;&#x4E2A; HTTP &#x5E93;&#xFF0C; &#x5B83;&#x53EA;&#x662F;&#x7528;&#x6765;&#xFF0C;&#x8FDB;&#x884C;&#x8BF7;&#x6C42;&#xFF0C;&#x5BF9;&#x4E8E; HTTP &#x8BF7;&#x6C42;&#xFF0C;&#x4ED6;&#x662F;&#x4E00;&#x4E2A;&#x5F3A;&#x5927;&#x7684;&#x5E93;&#xFF0C;&#x4E0B;&#x8F7D;&#xFF0C;&#x89E3;&#x6790;&#x5168;&#x90E8;&#x81EA;&#x5DF1;&#x5904;&#x7406;&#xFF0C;&#x7075;&#x6D3B;&#x6027;&#x66F4;&#x9AD8;&#xFF0C;&#x9AD8;&#x5E76;&#x53D1;&#x4E0E;&#x5206;&#x5E03;&#x5F0F;&#x90E8;&#x7F72;&#x4E5F;&#x975E;&#x5E38;&#x7075;&#x6D3B;&#xFF0C;&#x5BF9;&#x4E8E;&#x529F;&#x80FD;&#x53EF;&#x4EE5;&#x66F4;&#x597D;&#x5B9E;&#x73B0; </p>
<p>aiohttp &#x662F;&#x4E00;&#x4E2A;&#x57FA;&#x4E8E; python3 &#x7684; asyncio &#x643A;&#x7A0B;&#x673A;&#x5236;&#x5B9E;&#x73B0;&#x7684;&#x4E00;&#x4E2A; http &#x5E93;&#xFF0C;&#x76F8;&#x6BD4; requests&#xFF0C;aiohttp &#x81EA;&#x8EAB;&#x5C31;&#x5177;&#x5907;&#x4E86;&#x5F02;&#x6B65;&#x529F;&#x80FD;&#x3002;&#x4F46;&#x53EA;&#x80FD;&#x5728; python3 &#x73AF;&#x5883;&#x4F7F;&#x7528;&#x3002; </p>
<p> Pyspider &#x662F;&#x4E00;&#x4E2A;&#x91CD;&#x91CF;&#x7EA7;&#x7684;&#x722C;&#x866B;&#x6846;&#x67B6;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x8BF4;&#x91CD;&#x91CF;&#x7EA7;&#xFF1F;&#x6211;&#x4EEC;&#x77E5;&#x9053; scrapy &#x6CA1;&#x6709;&#x6570;&#x636E;&#x5E93;&#x96C6;&#x6210;&#x3001;&#x6CA1; &#x6709;&#x5206;&#x5E03;&#x5F0F;&#x3001;&#x65AD;&#x70B9;&#x7EED;&#x722C;&#x7684;&#x652F;&#x6301;&#x3001;&#x6CA1;&#x6709; UI &#x63A7;&#x5236;&#x754C;&#x9762;&#x7B49;&#x7B49;&#x3001;&#x5982;&#x679C;&#x57FA;&#x4E8E; scrapy &#x60F3;&#x8981;&#x5B9E;&#x73B0;&#x8FD9;&#x4E9B;&#x529F;&#x80FD;&#xFF0C;&#x90FD;&#x9700;&#x8981; &#x81EA;&#x884C;&#x5F00;&#x53D1;&#xFF0C;&#x4F46; pyspider &#x90FD;&#x5DF2;&#x7ECF;&#x96C6;&#x6210;&#x4E86;&#x3002;&#x4F46;&#x4E5F;&#x6B63;&#x56E0;&#x5982;&#x6B64; pyspider &#x53E6;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x5C31;&#x662F;&#xFF0C;&#x6269;&#x5C55;&#x6027;&#x592A;&#x5DEE;&#xFF0C;&#x5B66; &#x4E60;&#x96BE;&#x5EA6;&#x8F83;&#x5927;</p>
<h2 id="&#x5199;&#x722C;&#x866B;&#x662F;&#x7528;&#x591A;&#x8FDB;&#x7A0B;&#x597D;&#xFF1F;&#x8FD8;&#x662F;&#x591A;&#x7EBF;&#x7A0B;&#x597D;&#xFF1F;-&#x4E3A;&#x4EC0;&#x4E48;">&#x5199;&#x722C;&#x866B;&#x662F;&#x7528;&#x591A;&#x8FDB;&#x7A0B;&#x597D;&#xFF1F;&#x8FD8;&#x662F;&#x591A;&#x7EBF;&#x7A0B;&#x597D;&#xFF1F; &#x4E3A;&#x4EC0;&#x4E48;</h2>
<p>&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5728;&#x9009;&#x62E9;&#x662F;&#x4F7F;&#x7528;&#x591A;&#x8FDB;&#x7A0B;&#x8FD8;&#x662F;&#x591A;&#x7EBF;&#x7A0B;&#x65F6;&#xFF0C;&#x4E3B;&#x8981;&#x8003;&#x8651;&#x7684;&#x4E1A;&#x52A1;&#x5230;&#x5E95;&#x662F; IO &#x5BC6;&#x96C6; &#x578B;&#xFF08;&#x591A;&#x7EBF;&#x7A0B;&#xFF09;&#x8FD8;&#x662F;&#x8BA1;&#x7B97;&#x5BC6;&#x96C6;&#x578B;&#xFF08;&#x591A;&#x8FDB;&#x7A0B;&#xFF09;&#x3002;&#x5728;&#x722C;&#x866B;&#x4E2D;&#xFF0C;&#x8BF7;&#x6C42;&#x7684;&#x5E76;&#x53D1;&#x4E1A;&#x52A1;&#x5C5E;&#x4E8E;&#x662F;&#x7F51;&#x7EDC; &#x7684; IO &#x7C7B;&#x578B;&#x4E1A;&#x52A1;&#xFF0C;&#x56E0;&#x6B64;&#x7F51;&#x7EDC;&#x5E76;&#x53D1;&#x9002;&#x5B9C;&#x4F7F;&#x7528;&#x591A;&#x7EBF;&#x7A0B;&#xFF1B;&#x4F46;&#x7279;&#x6B8A;&#x9700;&#x6C42;&#x4E0B;&#xFF0C;&#x6BD4;&#x5982;&#x4F7F;&#x7528; phantomjs &#x6216;&#x8005; chrome-headless &#x6765;&#x6293;&#x53D6;&#x7684;&#x722C;&#x866B;&#xFF0C;&#x5E94;&#x5F53;&#x662F;&#x591A;&#x8FDB;&#x7A0B;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x6BCF;&#x4E00;&#x4E2A; phan/chro &#x5B9E;&#x4F8B;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x4E86;&#xFF0C;&#x5E76;&#x53D1;&#x53EA;&#x80FD;&#x662F;&#x591A;&#x8FDB;&#x7A0B;&#x3002;&#x3002;&#x6B64;&#x5916;&#x722C;&#x866B;&#x4E2D;&#x8FD8;&#x662F;&#x6570;&#x636E;&#x5904;&#x7406; &#x4E1A;&#x52A1;&#xFF0C;&#x5982;&#x679C;&#x6570;&#x636E;&#x5904;&#x7406;&#x4E1A;&#x52A1;&#x662F;&#x4E00;&#x4E2A;&#x6BD4;&#x8F83;&#x8017;&#x65F6;&#x7684;&#x8BA1;&#x7B97;&#x578B;&#x64CD;&#x4F5C;&#xFF0C;&#x90A3;&#x4E48;&#x5BF9;&#x6570;&#x636E;&#x5904;&#x7406;&#x90E8;&#x5206;&#x5E94;&#x5F53; &#x8BBE;&#x4E3A;&#x591A;&#x8FDB;&#x7A0B;&#xFF0C;&#x4F46;&#x66F4;&#x591A;&#x53EF;&#x80FD;&#x4F1A;&#x8003;&#x8651;&#x5C06;&#x8BE5;&#x90E8;&#x5206;&#x6570;&#x636E;&#x5904;&#x7406;&#x64CD;&#x4F5C;&#x548C;&#x722C;&#x866B;&#x7A0B;&#x5E8F;&#x89E3;&#x8026;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x5148; &#x628A;&#x6570;&#x636E;&#x6293;&#x53D6;&#x4E0B;&#x6765;&#xFF0C;&#x4E8B;&#x540E;&#x5355;&#x72EC;&#x8FD0;&#x884C;&#x53E6;&#x5916;&#x7684;&#x7A0B;&#x5E8F;&#x89E3;&#x6790;&#x6570;&#x636E;&#x3002;</p>
<h2 id="&#x5E38;&#x89C1;&#x7684;&#x53CD;&#x722C;&#x866B;&#x548C;&#x5E94;&#x5BF9;&#x65B9;&#x6CD5;&#xFF1F;">&#x5E38;&#x89C1;&#x7684;&#x53CD;&#x722C;&#x866B;&#x548C;&#x5E94;&#x5BF9;&#x65B9;&#x6CD5;&#xFF1F;</h2>
<p>&#x53CD;&#x722C;&#x866B;&#x7B80;&#x5355;&#x7684;&#x8BF4;&#x6307;&#x7684;&#x662F;&#xFF1A;&#x7F51;&#x7AD9;&#x6839;&#x636E;&#x67D0;&#x4E9B;&#x56E0;&#x7D20;&#x65AD;&#x5B9A;&#x8BE5;&#x8BF7;&#x6C42;&#x662F;&#x4E00;&#x4E2A;&#x722C;&#x866B;&#x7A0B;&#x5E8F;&#x53D1;&#x51FA;&#x7684;&#x8BF7;&#x6C42;&#xFF0C;&#x7136;&#x540E;&#x5BF9;&#x8BE5;&#x8BF7;&#x6C42;&#x91C7;&#x53D6; &#x4E86;&#x4E00;&#x5B9A;&#x7684;&#x5236;&#x88C1;&#x63AA;&#x65BD;&#x3002; &#x56E0;&#x6B64;&#x53CD;&#x722C;&#x866B;&#x5E94;&#x8BE5;&#x4ECE;&#x4E24;&#x65B9;&#x9762;&#x6765;&#x63A2;&#x8BA8;&#xFF1A;</p>
<ol>
<li>&#x7F51;&#x7AD9;&#x5982;&#x4F55;&#x65AD;&#x5B9A;&#x8BE5;&#x8BF7;&#x6C42;&#x662F;&#x4E00;&#x4E2A;&#x722C;&#x866B;&#xFF1A;&#x8BF7;&#x6C42;&#x5934;&#x3001;&#x8BF7;&#x6C42;&#x9891;&#x7387;&#x3001;IP &#x5730;&#x5740;&#x3001;cookie &#x7B49;&#xFF08;&#x6301;&#x7EED;&#x66F4;&#x65B0;&#x8BF7;&#x6C42;&#x5934;&#x3001;cookie&#x3001;&#x7528;&#x6237; cookie &#x6C60;&#x3001;&#x4EE3;&#x7406; IP &#x6C60;&#x3001;&#x8BBE;&#x7F6E;&#x4E00;&#x5B9A;&#x7684;&#x5EF6;&#x65F6;&#xFF09;</li>
</ol>
<ol>
<li>&#x7F51;&#x7AD9;&#x5982;&#x4F55;&#x5236;&#x88C1;&#x8FD9;&#x4E2A;&#x5B83;&#x8BA4;&#x4E3A;&#x662F;&#x722C;&#x866B;&#x7684;&#x8BF7;&#x6C42;&#xFF08;&#x5047;&#x6570;&#x636E;&#x3001;&#x7A7A;&#x6570;&#x636E;&#x3001;&#x4E0D;&#x8FD4;&#x56DE;&#x54CD;&#x5E94;&#x3001;&#x9A8C;&#x8BC1;&#x7801;&#x3001;4xx &#x72B6;&#x6001;&#x7801;&#x7B49;&#xFF09;</li>
</ol>
<h3 id="&#x901A;&#x8FC7;-headers-&#x53CD;&#x722C;&#x866B;&#xFF1A;">&#x901A;&#x8FC7; Headers &#x53CD;&#x722C;&#x866B;&#xFF1A;</h3>
<p>&#x4ECE;&#x7528;&#x6237;&#x8BF7;&#x6C42;&#x7684; Headers &#x53CD;&#x722C;&#x866B;&#x662F;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x53CD;&#x722C;&#x866B;&#x7B56;&#x7565;&#x3002;&#x5F88;&#x591A;&#x7F51;&#x7AD9;&#x90FD;&#x4F1A;&#x5BF9; Headers &#x7684; User-Agent &#x8FDB;&#x884C;&#x68C0;&#x6D4B;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x90E8;&#x5206;&#x7F51;&#x7AD9;&#x4F1A;&#x5BF9; Referer &#x8FDB;&#x884C;&#x68C0;&#x6D4B;&#xFF08;&#x4E00;&#x4E9B;&#x8D44;&#x6E90;&#x7F51;&#x7AD9;&#x7684;&#x9632;&#x76D7;&#x94FE;&#x5C31;&#x662F;&#x68C0;&#x6D4B; Referer&#xFF09;&#x3002;&#x5982;&#x679C;&#x9047;&#x5230;&#x4E86;&#x8FD9;&#x7C7B;&#x53CD;&#x722C;&#x866B;&#x673A;&#x5236;&#xFF0C;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x5728;&#x722C;&#x866B;&#x4E2D;&#x6DFB;&#x52A0; Headers&#xFF0C;&#x5C06;&#x6D4F;&#x89C8;&#x5668;&#x7684; User-Agent &#x590D;&#x5236;&#x5230;&#x722C;&#x866B;&#x7684;Headers &#x4E2D;&#xFF1B;&#x6216;&#x8005;&#x5C06; Referer &#x503C;&#x4FEE;&#x6539;&#x4E3A;&#x76EE;&#x6807;&#x7F51;&#x7AD9;&#x57DF;&#x540D;&#x3002;&#x5BF9;&#x4E8E;&#x68C0;&#x6D4B; Headers &#x7684;&#x53CD;&#x722C;&#x866B;&#xFF0C;&#x5728;&#x722C;&#x866B;&#x4E2D;&#x4FEE;&#x6539;&#x6216; &#x8005;&#x6DFB;&#x52A0; Headers &#x5C31;&#x80FD;&#x5F88;&#x597D;&#x7684;&#x7ED5;&#x8FC7;&#x3002;</p>
<h3 id="&#x57FA;&#x4E8E;&#x7528;&#x6237;&#x884C;&#x4E3A;&#x53CD;&#x722C;&#x866B;&#xFF1A;">&#x57FA;&#x4E8E;&#x7528;&#x6237;&#x884C;&#x4E3A;&#x53CD;&#x722C;&#x866B;&#xFF1A;</h3>
<p>&#x8FD8;&#x6709;&#x4E00;&#x90E8;&#x5206;&#x7F51;&#x7AD9;&#x662F;&#x901A;&#x8FC7;&#x68C0;&#x6D4B;&#x7528;&#x6237;&#x884C;&#x4E3A;&#xFF0C;&#x4F8B;&#x5982;&#x540C;&#x4E00; IP &#x77ED;&#x65F6;&#x95F4;&#x5185;&#x591A;&#x6B21;&#x8BBF;&#x95EE;&#x540C;&#x4E00;&#x9875;&#x9762;&#xFF0C;&#x6216;&#x8005;&#x540C;&#x4E00;&#x8D26;&#x6237;&#x77ED;&#x65F6;&#x95F4;&#x5185;&#x591A;&#x6B21;&#x8FDB;&#x884C;&#x76F8;&#x540C;&#x64CD;&#x4F5C;&#x3002; &#x5927;&#x591A;&#x6570;&#x7F51;&#x7AD9;&#x90FD;&#x662F;&#x524D;&#x4E00;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x5BF9;&#x4E8E;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x4F7F;&#x7528; IP &#x4EE3;&#x7406;&#x5C31;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x3002;&#x53EF;&#x4EE5;&#x4E13;&#x95E8;&#x5199;&#x4E00;&#x4E2A;&#x722C;&#x866B;&#xFF0C;&#x722C;&#x53D6; &#x7F51;&#x4E0A;&#x516C;&#x5F00;&#x7684;&#x4EE3;&#x7406; ip&#xFF0C;&#x68C0;&#x6D4B;&#x540E;&#x5168;&#x90E8;&#x4FDD;&#x5B58;&#x8D77;&#x6765;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x4EE3;&#x7406; ip &#x722C;&#x866B;&#x7ECF;&#x5E38;&#x4F1A;&#x7528;&#x5230;&#xFF0C;&#x6700;&#x597D;&#x81EA;&#x5DF1;&#x51C6;&#x5907;&#x4E00;&#x4E2A;&#x3002;&#x6709;&#x4E86; &#x5927;&#x91CF;&#x4EE3;&#x7406; ip &#x540E;&#x53EF;&#x4EE5;&#x6BCF;&#x8BF7;&#x6C42;&#x51E0;&#x6B21;&#x66F4;&#x6362;&#x4E00;&#x4E2A; ip&#xFF0C;&#x8FD9;&#x5728; requests &#x6216;&#x8005; urllib2 &#x4E2D;&#x5F88;&#x5BB9;&#x6613;&#x505A;&#x5230;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x80FD;&#x5F88;&#x5BB9; &#x6613;&#x7684;&#x7ED5;&#x8FC7;&#x7B2C;&#x4E00;&#x79CD;&#x53CD;&#x722C;&#x866B;&#x3002; &#x5BF9;&#x4E8E;&#x7B2C;&#x4E8C;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x6BCF;&#x6B21;&#x8BF7;&#x6C42;&#x540E;&#x968F;&#x673A;&#x95F4;&#x9694;&#x51E0;&#x79D2;&#x518D;&#x8FDB;&#x884C;&#x4E0B;&#x4E00;&#x6B21;&#x8BF7;&#x6C42;&#x3002;&#x6709;&#x4E9B;&#x6709;&#x903B;&#x8F91;&#x6F0F;&#x6D1E;&#x7684;&#x7F51;&#x7AD9;&#xFF0C;&#x53EF; &#x4EE5;&#x901A;&#x8FC7;&#x8BF7;&#x6C42;&#x51E0;&#x6B21;&#xFF0C;&#x9000;&#x51FA;&#x767B;&#x5F55;&#xFF0C;&#x91CD;&#x65B0;&#x767B;&#x5F55;&#xFF0C;&#x7EE7;&#x7EED;&#x8BF7;&#x6C42;&#x6765;&#x7ED5;&#x8FC7;&#x540C;&#x4E00;&#x8D26;&#x53F7;&#x77ED;&#x65F6;&#x95F4;&#x5185;&#x4E0D;&#x80FD;&#x591A;&#x6B21;&#x8FDB;&#x884C;&#x76F8;&#x540C;&#x8BF7;&#x6C42;&#x7684;&#x9650; &#x5236;&#x3002;</p>
<h3 id="&#x52A8;&#x6001;&#x9875;&#x9762;&#x7684;&#x53CD;&#x722C;&#x866B;&#xFF1A;">&#x52A8;&#x6001;&#x9875;&#x9762;&#x7684;&#x53CD;&#x722C;&#x866B;&#xFF1A;</h3>
<p>&#x4E0A;&#x8FF0;&#x7684;&#x51E0;&#x79CD;&#x60C5;&#x51B5;&#x5927;&#x591A;&#x90FD;&#x662F;&#x51FA;&#x73B0;&#x5728;&#x9759;&#x6001;&#x9875;&#x9762;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x90E8;&#x5206;&#x7F51;&#x7AD9;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x722C;&#x53D6;&#x7684;&#x6570;&#x636E;&#x662F;&#x901A;&#x8FC7; ajax &#x8BF7;&#x6C42;&#x5F97;&#x5230;&#xFF0C;&#x6216;&#x8005;&#x901A;&#x8FC7; JavaScript &#x751F;&#x6210;&#x7684;&#x3002;&#x9996;&#x5148;&#x7528; Fiddler &#x5BF9;&#x7F51;&#x7EDC;&#x8BF7;&#x6C42;&#x8FDB;&#x884C;&#x5206;&#x6790;&#x3002;&#x5982;&#x679C;&#x80FD;&#x591F;&#x627E;&#x5230; ajax &#x8BF7;&#x6C42;&#xFF0C; &#x4E5F;&#x80FD;&#x5206;&#x6790;&#x51FA;&#x5177;&#x4F53;&#x7684;&#x53C2;&#x6570;&#x548C;&#x54CD;&#x5E94;&#x7684;&#x5177;&#x4F53;&#x542B;&#x4E49;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x80FD;&#x91C7;&#x7528;&#x4E0A;&#x9762;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x76F4;&#x63A5;&#x5229;&#x7528; requests &#x6216;&#x8005; urllib2 &#x6A21;&#x62DF; ajax &#x8BF7;&#x6C42;&#xFF0C;&#x5BF9;&#x54CD;&#x5E94;&#x7684; json &#x8FDB;&#x884C;&#x5206;&#x6790;&#x5F97;&#x5230;&#x9700;&#x8981;&#x7684;&#x6570;&#x636E;&#x3002; &#x80FD;&#x591F;&#x76F4;&#x63A5;&#x6A21;&#x62DF; ajax &#x8BF7;&#x6C42;&#x83B7;&#x53D6;&#x6570;&#x636E;&#x56FA;&#x7136;&#x662F;&#x6781;&#x597D;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x6709;&#x4E9B;&#x7F51;&#x7AD9;&#x628A; ajax &#x8BF7;&#x6C42;&#x7684;&#x6240;&#x6709;&#x53C2;&#x6570;&#x5168;&#x90E8;&#x52A0;&#x5BC6;&#x4E86;&#x3002; &#x6211;&#x4EEC;&#x6839;&#x672C;&#x6CA1;&#x529E;&#x6CD5;&#x6784;&#x9020;&#x81EA;&#x5DF1;&#x6240;&#x9700;&#x8981;&#x7684;&#x6570;&#x636E;&#x7684;&#x8BF7;&#x6C42;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x5C31;&#x7528; selenium+phantomJS&#xFF0C;&#x8C03;&#x7528;&#x6D4F;&#x89C8;&#x5668; &#x5185;&#x6838;&#xFF0C;&#x5E76;&#x5229;&#x7528; phantomJS &#x6267;&#x884C; js &#x6765;&#x6A21;&#x62DF;&#x4EBA;&#x4E3A;&#x64CD;&#x4F5C;&#x4EE5;&#x53CA;&#x89E6;&#x53D1;&#x9875;&#x9762;&#x4E2D;&#x7684; js &#x811A;&#x672C;&#x3002;&#x4ECE;&#x586B;&#x5199;&#x8868;&#x5355;&#x5230;&#x70B9;&#x51FB;&#x6309;&#x94AE;&#x518D; &#x5230;&#x6EDA;&#x52A8;&#x9875;&#x9762;&#xFF0C;&#x5168;&#x90E8;&#x90FD;&#x53EF;&#x4EE5;&#x6A21;&#x62DF;&#xFF0C;&#x4E0D;&#x8003;&#x8651;&#x5177;&#x4F53;&#x7684;&#x8BF7;&#x6C42;&#x548C;&#x54CD;&#x5E94;&#x8FC7;&#x7A0B;&#xFF0C;&#x53EA;&#x662F;&#x5B8C;&#x5B8C;&#x6574;&#x6574;&#x7684;&#x628A;&#x4EBA;&#x6D4F;&#x89C8;&#x9875;&#x9762;&#x83B7;&#x53D6;&#x6570;&#x636E; &#x7684;&#x8FC7;&#x7A0B;&#x6A21;&#x62DF;&#x4E00;&#x904D;&#x3002;</p>
<p>&#x7528;&#x8FD9;&#x5957;&#x6846;&#x67B6;&#x51E0;&#x4E4E;&#x80FD;&#x7ED5;&#x8FC7;&#x5927;&#x591A;&#x6570;&#x7684;&#x53CD;&#x722C;&#x866B;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4E0D;&#x662F;&#x5728;&#x4F2A;&#x88C5;&#x6210;&#x6D4F;&#x89C8;&#x5668;&#x6765;&#x83B7;&#x53D6;&#x6570;&#x636E;&#xFF08;&#x4E0A;&#x8FF0;&#x7684;&#x901A;&#x8FC7;&#x6DFB;&#x52A0; Headers &#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x5C31;&#x662F;&#x4E3A;&#x4E86;&#x4F2A;&#x88C5;&#x6210;&#x6D4F;&#x89C8;&#x5668;&#xFF09;&#xFF0C;&#x5B83;&#x672C;&#x8EAB;&#x5C31;&#x662F;&#x6D4F;&#x89C8;&#x5668;&#xFF0C;phantomJS &#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x6CA1;&#x6709;&#x754C;&#x9762;&#x7684; &#x6D4F;&#x89C8;&#x5668;&#xFF0C;&#x53EA;&#x662F;&#x64CD;&#x63A7;&#x8FD9;&#x4E2A;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x4E0D;&#x662F;&#x4EBA;&#x3002;&#x5229; selenium+phantomJS &#x80FD;&#x5E72;&#x5F88;&#x591A;&#x4E8B;&#x60C5;&#xFF0C;&#x4F8B;&#x5982;&#x8BC6;&#x522B;&#x70B9;&#x89E6;&#x5F0F; &#xFF08;12306&#xFF09;&#x6216;&#x8005;&#x6ED1;&#x52A8;&#x5F0F;&#x7684;&#x9A8C;&#x8BC1;&#x7801;&#xFF0C;&#x5BF9;&#x9875;&#x9762;&#x8868;&#x5355;&#x8FDB;&#x884C;&#x66B4;&#x529B;&#x7834;&#x89E3;&#x7B49;&#x3002;</p>
<h2 id="&#x9700;&#x8981;&#x767B;&#x5F55;&#x7684;&#x7F51;&#x9875;&#xFF0C;&#x5982;&#x4F55;&#x89E3;&#x51B3;&#x540C;&#x65F6;&#x9650;&#x5236;-ip&#xFF0C;cookiesession&#xFF08;&#x5176;&#x4E2D;&#x6709;&#x4E00;&#x4E9B;&#x662F;&#x52A8;&#x6001;&#x751F;&#x6210;&#x7684;&#xFF09;&#x5728;&#x4E0D;&#x4F7F;&#x7528;&#x52A8;&#x6001;&#x722C;&#x53D6;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF1F;">&#x9700;&#x8981;&#x767B;&#x5F55;&#x7684;&#x7F51;&#x9875;&#xFF0C;&#x5982;&#x4F55;&#x89E3;&#x51B3;&#x540C;&#x65F6;&#x9650;&#x5236; ip&#xFF0C;cookie,session&#xFF08;&#x5176;&#x4E2D;&#x6709;&#x4E00;&#x4E9B;&#x662F;&#x52A8;&#x6001;&#x751F;&#x6210;&#x7684;&#xFF09;&#x5728;&#x4E0D;&#x4F7F;&#x7528;&#x52A8;&#x6001;&#x722C;&#x53D6;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF1F;</h2>
<p>&#x89E3;&#x51B3;&#x9650;&#x5236; IP &#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4EE3;&#x7406; IP &#x5730;&#x5740;&#x6C60;&#x3001;&#x670D;&#x52A1;&#x5668;&#xFF1B; &#x4E0D;&#x9002;&#x7528;&#x52A8;&#x6001;&#x722C;&#x53D6;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x53CD;&#x7F16;&#x8BD1; JS &#x6587;&#x4EF6;&#x83B7;&#x53D6;&#x76F8;&#x5E94;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x6216;&#x8005;&#x6362;&#x7528;&#x5176;&#x4ED6;&#x5E73;&#x53F0;&#xFF08;&#x6BD4;&#x5982;&#x624B;&#x673A;&#x7AEF;&#xFF09; &#x770B;&#x770B;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x83B7;&#x53D6;&#x76F8;&#x5E94;&#x7684; json &#x6587;&#x4EF6;&#x3002;</p>
<h2 id="&#x9A8C;&#x8BC1;&#x7801;&#x7684;&#x89E3;&#x51B3;">&#x9A8C;&#x8BC1;&#x7801;&#x7684;&#x89E3;&#x51B3;?</h2>
<p>&#x56FE;&#x5F62;&#x9A8C;&#x8BC1;&#x7801;&#xFF1A;&#x5E72;&#x6270;&#x3001;&#x6742;&#x8272;&#x4E0D;&#x662F;&#x7279;&#x522B;&#x591A;&#x7684;&#x56FE;&#x7247;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5F00;&#x6E90;&#x5E93; Tesseract &#x8FDB;&#x884C;&#x8BC6;&#x522B;&#xFF0C;&#x592A;&#x8FC7;&#x590D;&#x6742;&#x7684;&#x9700;&#x8981; &#x501F;&#x52A9;&#x7B2C;&#x4E09;&#x65B9;&#x6253;&#x7801;&#x5E73;&#x53F0;&#x3002; &#x70B9;&#x51FB;&#x548C;&#x62D6;&#x52A8;&#x6ED1;&#x5757;&#x9A8C;&#x8BC1;&#x7801;&#x53EF;&#x4EE5;&#x501F;&#x52A9; selenium&#x3001;&#x65E0;&#x56FE;&#x5F62;&#x754C;&#x9762;&#x6D4F;&#x89C8;&#x5668;&#xFF08;chromedirver &#x6216;&#x8005; phantomjs&#xFF09; &#x548C; pillow &#x5305;&#x6765;&#x6A21;&#x62DF;&#x4EBA;&#x7684;&#x70B9;&#x51FB;&#x548C;&#x6ED1;&#x52A8;&#x64CD;&#x4F5C;&#xFF0C;pillow &#x53EF;&#x4EE5;&#x6839;&#x636E;&#x8272;&#x5DEE;&#x8BC6;&#x522B;&#x9700;&#x8981;&#x6ED1;&#x52A8;&#x7684;&#x4F4D;&#x7F6E;&#x3002; &#x624B;&#x52A8;&#x6253;&#x7801;&#xFF08;&#x6709;&#x7684;&#x9A8C;&#x8BC1;&#x7801;&#x786E;&#x5B9E;&#x65E0;&#x89E3;&#xFF09;</p>
<h2 id="&#x4F7F;&#x7528;&#x6700;&#x591A;&#x7684;&#x6570;&#x636E;&#x5E93;&#xFF08;mysql&#xFF0C;mongodb&#xFF0C;redis-&#x7B49;&#xFF09;&#xFF0C;&#x5BF9;&#x4ED6;&#x4EEC;&#x7684;&#x7406;&#x89E3;&#xFF1F;">&#x4F7F;&#x7528;&#x6700;&#x591A;&#x7684;&#x6570;&#x636E;&#x5E93;&#xFF08;Mysql&#xFF0C;Mongodb&#xFF0C;redis &#x7B49;&#xFF09;&#xFF0C;&#x5BF9;&#x4ED6;&#x4EEC;&#x7684;&#x7406;&#x89E3;&#xFF1F;</h2>
<p>MySQL &#x6570;&#x636E;&#x5E93;&#xFF1A;&#x5F00;&#x6E90;&#x514D;&#x8D39;&#x7684;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x9700;&#x8981;&#x5B9E;&#x73B0;&#x521B;&#x5EFA;&#x6570;&#x636E;&#x5E93;&#x3001;&#x6570;&#x636E;&#x8868;&#x548C;&#x8868;&#x7684;&#x5B57;&#x6BB5;&#xFF0C;&#x8868;&#x4E0E;&#x8868;&#x4E4B; &#x95F4;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x5173;&#x8054;&#xFF08;&#x4E00;&#x5BF9;&#x591A;&#x3001;&#x591A;&#x5BF9;&#x591A;&#xFF09;&#xFF0C;&#x662F;&#x6301;&#x4E45;&#x5316;&#x5B58;&#x50A8;&#x3002; </p>
<p>Mongodb &#x6570;&#x636E;&#x5E93;&#xFF1A;&#x662F;&#x975E;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x7684;&#x4E09;&#x5143;&#x7D20;&#x662F;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x3001;&#x96C6;&#x5408;&#x3001;&#x6587;&#x6863;&#xFF0C;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x6301;&#x4E45; &#x5316;&#x5B58;&#x50A8;&#xFF0C;&#x4E5F;&#x53EF;&#x4F5C;&#x4E3A;&#x5185;&#x5B58;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x5B58;&#x50A8;&#x6570;&#x636E;&#x4E0D;&#x9700;&#x8981;&#x4E8B;&#x5148;&#x8BBE;&#x5B9A;&#x683C;&#x5F0F;&#xFF0C;&#x6570;&#x636E;&#x4EE5;&#x952E;&#x503C;&#x5BF9;&#x7684;&#x5F62;&#x5F0F;&#x5B58;&#x50A8;&#x3002; </p>
<p>redis &#x6570;&#x636E;&#x5E93;&#xFF1A;&#x975E;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x4F7F;&#x7528;&#x524D;&#x53EF;&#x4EE5;&#x4E0D;&#x7528;&#x8BBE;&#x7F6E;&#x683C;&#x5F0F;&#xFF0C;&#x4EE5;&#x952E;&#x503C;&#x5BF9;&#x7684;&#x65B9;&#x5F0F;&#x4FDD;&#x5B58;&#xFF0C;&#x6587;&#x4EF6;&#x683C;&#x5F0F;&#x76F8;&#x5BF9;&#x81EA; &#x7531;&#xFF0C;&#x4E3B;&#x8981;&#x7528;&#x4E0E;&#x7F13;&#x5B58;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x6301;&#x4E45;&#x5316;&#x5B58;&#x50A8;&#x3002;</p>
<h2 id="&#x5B57;&#x7B26;&#x96C6;&#x548C;&#x5B57;&#x7B26;&#x7F16;&#x7801;">&#x5B57;&#x7B26;&#x96C6;&#x548C;&#x5B57;&#x7B26;&#x7F16;&#x7801;</h2>
<p>&#x5B57;&#x7B26;&#x662F;&#x5404;&#x79CD;&#x6587;&#x5B57;&#x548C;&#x7B26;&#x53F7;&#x7684;&#x603B;&#x79F0;&#xFF0C;&#x5305;&#x62EC;&#x5404;&#x4E2A;&#x56FD;&#x5BB6;&#x6587;&#x5B57;&#x3001;&#x6807;&#x70B9;&#x7B26;&#x53F7;&#x3001;&#x56FE;&#x5F62;&#x7B26;&#x53F7;&#x3001;&#x6570;&#x5B57;&#x7B49;&#x3002; &#x5B57;&#x7B26;&#x96C6;&#x662F;&#x591A;&#x4E2A;&#x5B57;&#x7B26;&#x7684;&#x96C6;&#x5408;&#xFF0C;&#x5B57;&#x7B26;&#x96C6;&#x79CD;&#x7C7B;&#x8F83;&#x591A;&#xFF0C;&#x6BCF;&#x4E2A;&#x5B57;&#x7B26;&#x96C6;&#x5305;&#x542B;&#x7684;&#x5B57;&#x7B26;&#x4E2A;&#x6570;&#x4E0D;&#x540C;&#xFF0C;&#x5E38;&#x89C1;&#x5B57;&#x7B26;&#x96C6;&#x6709;&#xFF1A; ASCII &#x5B57;&#x7B26;&#x96C6;&#x3001;ISO 8859 &#x5B57;&#x7B26;&#x96C6;&#x3001;GB2312 &#x5B57;&#x7B26;&#x96C6;&#x3001;BIG5 &#x5B57;&#x7B26;&#x96C6;&#x3001;GB18030 &#x5B57;&#x7B26;&#x96C6;&#x3001;Unicode &#x5B57;&#x7B26;&#x96C6;&#x7B49;&#x3002; &#x5B57;&#x7B26;&#x7F16;&#x7801;&#x5C31;&#x662F;&#x4EE5;&#x4E8C;&#x8FDB;&#x5236;&#x7684;&#x6570;&#x5B57;&#x6765;&#x5BF9;&#x5E94;&#x5B57;&#x7B26;&#x96C6;&#x7684;&#x5B57;&#x7B26;&#x3002;</p>
<p> &#x5E38;&#x89C1;&#x7684;&#x7F16;&#x7801;&#x5B57;&#x7B26;&#x96C6;&#xFF08;&#x7B80;&#x79F0;&#x5B57;&#x7B26;&#x96C6;&#xFF09;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A; </p>
<p><strong>Unicode</strong>&#xFF1A;&#x4E5F;&#x53EB;&#x7EDF;&#x4E00;&#x5B57;&#x7B26;&#x96C6;&#xFF0C;&#x5B83;&#x5305;&#x542B;&#x4E86;&#x51E0;&#x4E4E;&#x4E16;&#x754C;&#x4E0A;&#x6240;&#x6709;&#x7684;&#x5DF2;&#x7ECF;&#x53D1;&#x73B0;&#x4E14;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x7684;&#x5B57;&#x7B26; &#xFF08;&#x5982;&#x4E2D;&#x6587;&#x3001;&#x65E5;&#x6587;&#x3001;&#x82F1;&#x6587;&#x3001;&#x5FB7;&#x6587;&#x7B49;&#xFF09;&#x3002;</p>
<p> <strong>ASCII</strong>&#xFF1A;ASCII &#x65E2;&#x662F;&#x7F16;&#x7801;&#x5B57;&#x7B26;&#x96C6;&#xFF0C;&#x53C8;&#x662F;&#x5B57;&#x7B26;&#x7F16;&#x7801;&#x3002;&#x65E9;&#x671F;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x7CFB;&#x7EDF;&#x53EA;&#x80FD;&#x5904;&#x7406;&#x82F1;&#x6587;&#xFF0C;&#x6240;&#x4EE5; ASCII &#x4E5F; &#x5C31;&#x6210;&#x4E3A;&#x4E86;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x7F3A;&#x7701;&#x5B57;&#x7B26;&#x96C6;&#xFF0C;&#x5305;&#x542B;&#x4E86;&#x82F1;&#x6587;&#x6240;&#x9700;&#x8981;&#x7684;&#x6240;&#x6709;&#x5B57;&#x7B26;&#x3002; </p>
<p><strong>GB2312</strong>&#xFF1A;&#x4E2D;&#x6587;&#x5B57;&#x7B26;&#x96C6;&#xFF0C;&#x5305;&#x542B; ASCII &#x5B57;&#x7B26;&#x96C6;&#x3002;ASCII &#x90E8;&#x5206;&#x7528;&#x5355;&#x5B57;&#x8282;&#x8868;&#x793A;&#xFF0C;&#x5269;&#x4F59;&#x90E8;&#x5206;&#x7528;&#x53CC;&#x5B57;&#x8282;&#x8868;&#x793A;&#x3002;</p>
<p><strong>GBK</strong>&#xFF1A;GB2312 &#x7684;&#x6269;&#x5C55;&#xFF0C;&#x4F46;&#x5B8C;&#x6574;&#x5305;&#x542B;&#x4E86; GB2312 &#x7684;&#x6240;&#x6709;&#x5185;&#x5BB9;&#x3002; </p>
<p><strong>GB18030</strong>&#xFF1A;GBK &#x5B57;&#x7B26;&#x96C6;&#x7684;&#x8D85;&#x96C6;&#xFF0C;&#x5E38;&#x53EB;&#x5927;&#x6C49;&#x5B57;&#x5B57;&#x7B26;&#x96C6;&#xFF0C;&#x4E5F;&#x53EB; CJK&#xFF08;Chinese&#xFF0C;Japanese&#xFF0C; Korea&#xFF09;&#x5B57;&#x7B26;&#x96C6;&#xFF0C;&#x5305;&#x542B;&#x4E86;&#x4E2D;&#x3001;&#x65E5;&#x3001;&#x97E9;&#x4E09;&#x56FD;&#x8BED;&#x3002; </p>
<p>&#x6CE8;&#x610F;&#xFF1A;Unicode &#x5B57;&#x7B26;&#x96C6;&#x6709;&#x591A;&#x79CD;&#x7F16;&#x7801;&#x65B9;&#x5F0F;&#xFF0C;&#x5982; UTF-8&#x3001;UTF-16 &#x7B49;&#xFF1B;ASCII &#x53EA;&#x6709;&#x4E00;&#x79CD;&#xFF1B;&#x5927;&#x591A; &#x6570;MBCS&#xFF08;&#x5305;&#x62EC; GB2312&#xFF09;&#x4E5F;&#x53EA;&#x6709;&#x4E00;&#x79CD;&#x3002;</p>
<h2 id="&#x5199;&#x4E00;&#x4E2A;&#x90AE;&#x7BB1;&#x5730;&#x5740;&#x7684;&#x6B63;&#x5219;&#x8868;&#x8FBE;&#x5F0F;&#xFF1F;">&#x5199;&#x4E00;&#x4E2A;&#x90AE;&#x7BB1;&#x5730;&#x5740;&#x7684;&#x6B63;&#x5219;&#x8868;&#x8FBE;&#x5F0F;&#xFF1F;</h2>
<p>[A-Za-z0-9<em>-]+@[a-zA-Z0-9</em>-]+(.[a-zA-Z0-9_-]+)+$</p>
<h2 id="&#x7F16;&#x5199;&#x8FC7;&#x54EA;&#x4E9B;&#x722C;&#x866B;&#x4E2D;&#x95F4;&#x4EF6;&#xFF1F;">&#x7F16;&#x5199;&#x8FC7;&#x54EA;&#x4E9B;&#x722C;&#x866B;&#x4E2D;&#x95F4;&#x4EF6;&#xFF1F;</h2>
<p>user-agent&#x3001;&#x4EE3;&#x7406;&#x6C60;&#x7B49;&#x3002;</p>
<h2 id="&#x6781;&#x9A8C;&#x6ED1;&#x52A8;&#x9A8C;&#x8BC1;&#x7801;&#x5982;&#x4F55;&#x7834;&#x89E3;&#xFF1F;">&#x201C;&#x6781;&#x9A8C;&#x201D;&#x6ED1;&#x52A8;&#x9A8C;&#x8BC1;&#x7801;&#x5982;&#x4F55;&#x7834;&#x89E3;&#xFF1F;</h2>
<p>1.selenium &#x63A7;&#x5236;&#x9F20;&#x6807;&#x5B9E;&#x73B0;&#xFF0C;&#x901F;&#x5EA6;&#x592A;&#x673A;&#x68B0;&#x5316;&#xFF0C;&#x6210;&#x529F;&#x7387;&#x6BD4;&#x8F83;&#x4F4E; </p>
<p>2.&#x8BA1;&#x7B97;&#x7F3A;&#x53E3;&#x7684;&#x504F;&#x79FB;&#x91CF;&#xFF08;&#x63A8;&#x8350;&#x535A;&#x5BA2;&#xFF1A;<a href="http://blog.csdn.net/paololiu/article/details/52514504?%3E&gt;" target="_blank">http://blog.csdn.net/paololiu/article/details/52514504?%3E&gt;</a> </p>
<p>3.&#x201C;&#x6781;&#x9A8C;&#x201D;&#x6ED1;&#x52A8;&#x9A8C;&#x8BC1;&#x7801;&#x9700;&#x8981;&#x5177;&#x4F53;&#x7F51;&#x7AD9;&#x5177;&#x4F53;&#x5206;&#x6790;&#xFF0C;&#x4E00;&#x822C;&#x7275;&#x626F;&#x7B97;&#x6CD5;&#x4E43;&#x81F3;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x76F8;&#x5173;&#x77E5;&#x8BC6;&#x3002;</p>
<h2 id="&#x722C;&#x7684;&#x90A3;&#x4E9B;&#x5185;&#x5BB9;&#x6570;&#x636E;&#x91CF;&#x6709;&#x591A;&#x5927;&#xFF0C;&#x591A;&#x4E45;&#x722C;&#x4E00;&#x6B21;&#xFF0C;&#x722C;&#x4E0B;&#x6765;&#x7684;&#x6570;&#x636E;&#x662F;&#x600E;&#x4E48;&#x5B58;&#x50A8;&#xFF1F;">&#x722C;&#x7684;&#x90A3;&#x4E9B;&#x5185;&#x5BB9;&#x6570;&#x636E;&#x91CF;&#x6709;&#x591A;&#x5927;&#xFF0C;&#x591A;&#x4E45;&#x722C;&#x4E00;&#x6B21;&#xFF0C;&#x722C;&#x4E0B;&#x6765;&#x7684;&#x6570;&#x636E;&#x662F;&#x600E;&#x4E48;&#x5B58;&#x50A8;&#xFF1F;</h2>
<p>&#x4EAC;&#x4E1C;&#x6574;&#x7AD9;&#x7684;&#x6570;&#x636E;&#x5927;&#x7EA6;&#x5728; 1 &#x4EBF;&#x5DE6;&#x53F3;&#xFF0C;&#x722C;&#x4E0B;&#x6765;&#x7684;&#x6570;&#x636E;&#x5B58;&#x5165;&#x6570;&#x636E;&#x5E93;&#xFF0C;mysql &#x6570;&#x636E;&#x5E93;&#x4E2D;&#x5982;&#x679C;&#x6709;&#x91CD;&#x590D;&#x7684; url &#x5EFA; &#x8BAE;&#x53BB;&#x91CD;&#x5B58;&#x5165;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x5F15;&#x7528;&#x5916;&#x952E;&#x3002;&#x8BC4;&#x5206;&#xFF0C;&#x8BC4;&#x8BBA;&#x5982;&#x679C;&#x505A;&#x589E;&#x91CF;&#xFF0C;Redis &#x4E2D; url &#x53BB;&#x91CD;&#xFF0C;&#x8BC4;&#x5206;&#x548C;&#x8BC4;&#x8BBA;&#x5EFA;&#x8BAE;&#x5EFA;&#x7ACB;&#x4E00;&#x5F20;&#x65B0;&#x8868;&#x7528; id &#x505A;&#x5173;&#x8054;&#x3002; &#x591A;&#x4E45;&#x722C;&#x4E00;&#x6B21;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x8981;&#x6839;&#x636E;&#x516C;&#x53F8;&#x7684;&#x8981;&#x6C42;&#x53BB;&#x5904;&#x7406;&#xFF0C;&#x4E0D;&#x4E00;&#x5B9A;&#x662F;&#x6BCF;&#x5929;&#x90FD;&#x722C;&#x3002;</p>
<p>Mongo &#x5EFA;&#x7ACB;&#x552F;&#x4E00;&#x7D22;&#x5F15;&#x952E;&#xFF08;id&#xFF09;&#x53EF;&#x4EE5;&#x505A;&#x6570;&#x636E;&#x91CD;&#x590D; &#x524D;&#x63D0;&#x662F;&#x6570;&#x636E;&#x91CF;&#x4E0D;&#x5927; 2 &#x53F0;&#x7535;&#x8111;&#x51E0;&#x767E;&#x4E07;&#x7684;&#x60C5;&#x51B5; &#x6570; &#x636E;&#x5E93;&#x9700;&#x8981;&#x505A;&#x5206;&#x7247; &#xFF08;&#x6570;&#x636E;&#x5E93;&#x8981;&#x8BBE;&#x8BA1;&#x5408;&#x7406;&#xFF09;&#x3002; &#x4F8B;&#xFF1A;&#x79DF;&#x623F;&#x7684;&#x7F51;&#x7AD9;&#x6570;&#x636E;&#x91CF;&#x6BCF;&#x5929;&#x5927;&#x6982;&#x662F;&#x51E0;&#x5341;&#x4E07;&#x6761; &#xFF0C;&#x6BCF;&#x5468;&#x56FA;&#x5B9A;&#x722C;&#x53D6;&#x3002;</p>
<h2 id="cookie-&#x8FC7;&#x671F;&#x7684;&#x5904;&#x7406;&#x95EE;&#x9898;&#xFF1F;">cookie &#x8FC7;&#x671F;&#x7684;&#x5904;&#x7406;&#x95EE;&#x9898;&#xFF1F;</h2>
<p>&#x56E0;&#x4E3A; cookie &#x5B58;&#x5728;&#x8FC7;&#x671F;&#x7684;&#x73B0;&#x8C61;&#xFF0C;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x5904;&#x7406;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x505A;&#x4E00;&#x4E2A;&#x5F02;&#x5E38;&#x7C7B;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x5F02;&#x5E38;&#x7684;&#x8BDD; cookie &#x629B;&#x51FA;&#x5F02;&#x5E38;&#x7C7B;&#x5728;&#x6267;&#x884C;&#x7A0B;&#x5E8F;</p>
<h2 id="&#x52A8;&#x6001;&#x52A0;&#x8F7D;&#x53C8;&#x5BF9;&#x53CA;&#x65F6;&#x6027;&#x8981;&#x6C42;&#x5F88;&#x9AD8;&#x600E;&#x4E48;&#x5904;&#x7406;&#xFF1F;">&#x52A8;&#x6001;&#x52A0;&#x8F7D;&#x53C8;&#x5BF9;&#x53CA;&#x65F6;&#x6027;&#x8981;&#x6C42;&#x5F88;&#x9AD8;&#x600E;&#x4E48;&#x5904;&#x7406;&#xFF1F;</h2>
<p>&#x5206;&#x6790;&#x51FA;&#x6570;&#x636E;&#x63A5;&#x53E3; API&#xFF08;&#x5229;&#x7528; chrome &#x6216;&#x8005;&#x6293;&#x5305;&#x5DE5;&#x5177;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x5229;&#x7528; requests &#x7B49; http &#x5E93;&#x5B9E;&#x73B0;&#x722C;&#x866B;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x9700;&#x8981;&#x6267;&#x884C; js &#x4EE3;&#x7801;&#xFF0C;&#x53EF;&#x501F;&#x52A9; js2py&#x3001;pyexecjs &#x7B49;&#x5DE5;&#x5177;&#x5B9E;&#x73B0;&#x3002; Selenium+Phantomjs &#x5C3D;&#x91CF;&#x4E0D;&#x4F7F;&#x7528; sleep &#x800C;&#x4F7F;&#x7528; WebDriverWait</p>
<h2 id="https-&#x6709;&#x4EC0;&#x4E48;&#x4F18;&#x70B9;&#x548C;&#x7F3A;&#x70B9;">HTTPS &#x6709;&#x4EC0;&#x4E48;&#x4F18;&#x70B9;&#x548C;&#x7F3A;&#x70B9;</h2>
<p>&#x4F18;&#x70B9;&#xFF1A; </p>
<p>1&#x3001;&#x4F7F;&#x7528; HTTPS &#x534F;&#x8BAE;&#x53EF;&#x8BA4;&#x8BC1;&#x7528;&#x6237;&#x548C;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x786E;&#x4FDD;&#x6570;&#x636E;&#x53D1;&#x9001;&#x5230;&#x6B63;&#x786E;&#x7684;&#x5BA2;&#x6237;&#x673A;&#x548C;&#x670D;&#x52A1;&#x5668;&#xFF1B; 2&#x3001;HTTPS &#x534F;&#x8BAE;&#x662F;&#x7531; SSL+HTTP &#x534F;&#x8BAE;&#x6784;&#x5EFA;&#x7684;&#x53EF;&#x8FDB;&#x884C;&#x52A0;&#x5BC6;&#x4F20;&#x8F93;&#x3001;&#x8EAB;&#x4EFD;&#x8BA4;&#x8BC1;&#x7684;&#x7F51;&#x7EDC;&#x534F;&#x8BAE;&#xFF0C;&#x8981;&#x6BD4; http &#x534F;&#x8BAE;&#x5B89;&#x5168;&#xFF0C;&#x53EF;&#x9632;&#x6B62;&#x6570;&#x636E;&#x5728;&#x4F20;&#x8F93;&#x8FC7;&#x7A0B;&#x4E2D;&#x4E0D;&#x88AB;&#x7A83;&#x53D6;&#x3001;&#x6539;&#x53D8;&#xFF0C;&#x786E;&#x4FDD;&#x6570;&#x636E;&#x7684;&#x5B8C;&#x6574;&#x6027;&#x3002; 3&#x3001;HTTPS &#x662F;&#x73B0;&#x884C;&#x67B6;&#x6784;&#x4E0B;&#x6700;&#x5B89;&#x5168;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x867D;&#x7136;&#x4E0D;&#x662F;&#x7EDD;&#x5BF9;&#x5B89;&#x5168;&#xFF0C;&#x4F46;&#x5B83;&#x5927;&#x5E45;&#x589E;&#x52A0;&#x4E86;&#x4E2D;&#x95F4;&#x4EBA;&#x653B;&#x51FB; &#x7684;&#x6210;&#x672C; </p>
<p>&#x7F3A;&#x70B9;&#xFF1A; </p>
<p>1.HTTPS &#x534F;&#x8BAE;&#x7684;&#x52A0;&#x5BC6;&#x8303;&#x56F4;&#x4E5F;&#x6BD4;&#x8F83;&#x6709;&#x9650;&#xFF0C;&#x5728;&#x9ED1;&#x5BA2;&#x653B;&#x51FB;&#x3001;&#x62D2;&#x7EDD;&#x670D;&#x52A1;&#x653B;&#x51FB;&#x3001;&#x670D;&#x52A1;&#x5668;&#x52AB;&#x6301;&#x7B49;&#x65B9;&#x9762;&#x51E0;&#x4E4E;&#x8D77;</p>
<p>&#x4E0D;&#x5230;&#x4EC0;&#x4E48;&#x4F5C;&#x7528; </p>
<p>2.HTTPS &#x534F;&#x8BAE;&#x8FD8;&#x4F1A;&#x5F71;&#x54CD;&#x7F13;&#x5B58;&#xFF0C;&#x589E;&#x52A0;&#x6570;&#x636E;&#x5F00;&#x9500;&#x548C;&#x529F;&#x8017;&#xFF0C;&#x751A;&#x81F3;&#x5DF2;&#x6709;&#x5B89;&#x5168;&#x63AA;&#x65BD;&#x4E5F;&#x4F1A;&#x53D7;&#x5230;&#x5F71;&#x54CD;&#x4E5F;&#x4F1A;&#x56E0;&#x6B64; &#x800C;&#x53D7;&#x5230;&#x5F71;&#x54CD;&#x3002; </p>
<p>3.SSL &#x8BC1;&#x4E66;&#x9700;&#x8981;&#x94B1;&#x3002;&#x529F;&#x80FD;&#x8D8A;&#x5F3A;&#x5927;&#x7684;&#x8BC1;&#x4E66;&#x8D39;&#x7528;&#x8D8A;&#x9AD8;&#x3002;&#x4E2A;&#x4EBA;&#x7F51;&#x7AD9;&#x3001;&#x5C0F;&#x7F51;&#x7AD9;&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#x4E00;&#x822C;&#x4E0D;&#x4F1A;&#x7528;&#x3002; 4.HTTPS &#x8FDE;&#x63A5;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x8D44;&#x6E90;&#x5360;&#x7528;&#x9AD8;&#x5F88;&#x591A;&#xFF0C;&#x63E1;&#x624B;&#x9636;&#x6BB5;&#x6BD4;&#x8F83;&#x8D39;&#x65F6;&#x5BF9;&#x7F51;&#x7AD9;&#x7684;&#x76F8;&#x5E94;&#x901F;&#x5EA6;&#x6709;&#x8D1F;&#x9762;&#x5F71;&#x54CD;&#x3002; 5.HTTPS &#x8FDE;&#x63A5;&#x7F13;&#x5B58;&#x4E0D;&#x5982; HTTP &#x9AD8;&#x6548;&#x3002;</p>
<h2 id="https-&#x662F;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x5B89;&#x5168;&#x4F20;&#x8F93;&#x6570;&#x636E;&#x7684;&#x3002;">HTTPS &#x662F;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x5B89;&#x5168;&#x4F20;&#x8F93;&#x6570;&#x636E;&#x7684;&#x3002;</h2>
<p>HTTPS &#x5176;&#x5B9E;&#x5C31;&#x662F;&#x5728; HTTP &#x8DDF; TCP &#x4E2D;&#x95F4;&#x52A0;&#x591A;&#x4E86;&#x4E00;&#x5C42;&#x52A0;&#x5BC6;&#x5C42; TLS/SSL&#x3002;SSL &#x662F;&#x4E2A;&#x52A0;&#x5BC6;&#x5957;&#x4EF6;&#xFF0C;&#x8D1F;&#x8D23;&#x5BF9; HTTP &#x7684;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x52A0;&#x5BC6;&#x3002;TLS &#x662F; SSL &#x7684;&#x5347;&#x7EA7;&#x7248;&#x3002;&#x73B0;&#x5728;&#x63D0;&#x5230; HTTPS&#xFF0C;&#x52A0;&#x5BC6;&#x5957;&#x4EF6;&#x57FA;&#x672C;&#x6307;&#x7684;&#x662F; TLS&#x3002;&#x539F;&#x5148;&#x662F;&#x5E94;&#x7528;&#x5C42;&#x5C06; &#x6570;&#x636E;&#x76F4;&#x63A5;&#x7ED9;&#x5230; TCP &#x8FDB;&#x884C;&#x4F20;&#x8F93;&#xFF0C;&#x73B0;&#x5728;&#x6539;&#x6210;&#x5E94;&#x7528;&#x5C42;&#x5C06;&#x6570;&#x636E;&#x7ED9;&#x5230; TLS/SSL&#xFF0C;&#x5C06;&#x6570;&#x636E;&#x52A0;&#x5BC6;&#x540E;&#xFF0C;&#x518D;&#x7ED9;&#x5230; TCP &#x8FDB;&#x884C; &#x4F20;&#x8F93;&#x3002;</p>
<h2 id="ttl&#xFF0C;msl&#xFF0C;rtt&#xFF1F;">TTL&#xFF0C;MSL&#xFF0C;RTT&#xFF1F;</h2>
<p>MSL&#xFF1A;&#x62A5;&#x6587;&#x6700;&#x5927;&#x751F;&#x5B58;&#x65F6;&#x95F4;&#x201D;&#xFF0C;&#x4ED6;&#x662F;&#x4EFB;&#x4F55;&#x62A5;&#x6587;&#x5728;&#x7F51;&#x7EDC;&#x4E0A;&#x5B58;&#x5728;&#x7684;&#x6700;&#x957F;&#x65F6;&#x95F4;&#xFF0C;&#x8D85;&#x8FC7;&#x8FD9;&#x4E2A;&#x65F6;&#x95F4;&#x62A5;&#x6587;&#x5C06;&#x88AB;&#x4E22;&#x5F03;&#x3002;</p>
<p>TTL&#xFF1A;TTL &#x662F; time to live &#x7684;&#x7F29;&#x5199;&#xFF0C;&#x4E2D;&#x6587;&#x53EF;&#x4EE5;&#x8BD1;&#x4E3A;&#x201C;&#x751F;&#x5B58;&#x65F6;&#x95F4;&#x201D;&#xFF0C;&#x8FD9;&#x4E2A;&#x751F;&#x5B58;&#x65F6;&#x95F4;&#x662F;&#x7531;&#x6E90;&#x4E3B;&#x673A;&#x8BBE;&#x7F6E;&#x521D;&#x59CB;&#x503C;&#x4F46;&#x4E0D;&#x662F;&#x5B58;&#x7684;&#x5177;&#x4F53;&#x65F6;&#x95F4;&#xFF0C;&#x800C;&#x662F;&#x5B58;&#x50A8;&#x4E86;&#x4E00;&#x4E2A; ip &#x6570;&#x636E;&#x62A5;&#x53EF;&#x4EE5;&#x7ECF;&#x8FC7;&#x7684;&#x6700;&#x5927;&#x8DEF;&#x7531;&#x6570;&#xFF0C;&#x6BCF;&#x7ECF;&#x8FC7;&#x4E00;&#x4E2A;&#x5904;&#x7406;&#x4ED6;&#x7684;&#x8DEF;&#x7531;&#x5668;&#x6B64;&#x503C;&#x5C31;&#x51CF; 1&#xFF0C;&#x5F53;&#x6B64;&#x503C;&#x4E3A; 0 &#x5219;&#x6570;&#x636E;&#x62A5;&#x5C06;&#x88AB;&#x4E22;&#x5F03;&#xFF0C;&#x540C;&#x65F6;&#x53D1;&#x9001; ICMP &#x62A5;&#x6587;&#x901A;&#x77E5;&#x6E90;&#x4E3B;&#x673A;&#x3002;RFC 793 &#x4E2D;&#x89C4;&#x5B9A; MSL &#x4E3A; 2 &#x5206;&#x949F;&#xFF0C;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#x4E2D;&#x5E38;&#x7528;&#x7684;&#x662F; 30 &#x79D2;&#xFF0C;1 &#x5206;&#x949F;&#x548C; 2 &#x5206;&#x949F;&#x7B49;&#x3002;TTL &#x4E0E; MSL &#x662F;&#x6709;&#x5173;&#x7CFB;&#x7684;&#x4F46;&#x4E0D;&#x662F;&#x7B80;&#x5355;&#x7684;&#x76F8;&#x7B49; &#x7684;&#x5173;&#x7CFB;&#xFF0C;MSL &#x8981;&#x5927;&#x4E8E;&#x7B49;&#x4E8E; TTL&#x3002; RTT&#xFF1A;</p>
<p> RTT &#x662F;&#x5BA2;&#x6237;&#x5230;&#x670D;&#x52A1;&#x5668;&#x5F80;&#x8FD4;&#x6240;&#x82B1;&#x65F6;&#x95F4;&#xFF08;round-trip time&#xFF0C;&#x7B80;&#x79F0; RTT&#xFF09;&#xFF0C;TCP &#x542B;&#x6709;&#x52A8;&#x6001;&#x4F30;&#x7B97; RTT &#x7684;&#x7B97;&#x6CD5;&#x3002;TCP &#x8FD8;&#x6301;&#x7EED;&#x4F30;&#x7B97;&#x4E00;&#x4E2A;&#x7ED9;&#x5B9A;&#x8FDE;&#x63A5;&#x7684; RTT&#xFF0C;&#x8FD9;&#x662F;&#x56E0;&#x4E3A; RTT &#x53D7;&#x7F51;&#x7EDC;&#x4F20;&#x8F93;&#x62E5;&#x585E;&#x7A0B;&#x5E8F;&#x7684;&#x53D8;&#x5316;&#x800C;&#x53D8;&#x5316;&#x3002;</p>
<h2 id="&#x8C08;&#x4E00;&#x8C08;&#x4F60;&#x5BF9;-selenium-&#x548C;-phantomjs-&#x4E86;&#x89E3;">&#x8C08;&#x4E00;&#x8C08;&#x4F60;&#x5BF9; Selenium &#x548C; PhantomJS &#x4E86;&#x89E3;</h2>
<p>Selenium &#x662F;&#x4E00;&#x4E2A; Web &#x7684;&#x81EA;&#x52A8;&#x5316;&#x6D4B;&#x8BD5;&#x5DE5;&#x5177;&#xFF0C;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x6211;&#x4EEC;&#x7684;&#x6307;&#x4EE4;&#xFF0C;&#x8BA9;&#x6D4F;&#x89C8;&#x5668;&#x81EA;&#x52A8;&#x52A0;&#x8F7D;&#x9875;&#x9762;&#xFF0C;&#x83B7;&#x53D6;&#x9700;&#x8981;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x751A;&#x81F3;&#x9875;&#x9762;&#x622A;&#x5C4F;&#xFF0C;&#x6216;&#x8005;&#x5224;&#x65AD;&#x7F51;&#x7AD9;&#x4E0A;&#x67D0;&#x4E9B;&#x52A8;&#x4F5C;&#x662F;&#x5426;&#x53D1;&#x751F;&#x3002;Selenium &#x81EA;&#x5DF1;&#x4E0D;&#x5E26;&#x6D4F;&#x89C8;&#x5668;&#xFF0C;&#x4E0D;&#x652F;&#x6301;&#x6D4F; &#x89C8;&#x5668;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x5B83;&#x9700;&#x8981;&#x4E0E;&#x7B2C;&#x4E09;&#x65B9;&#x6D4F;&#x89C8;&#x5668;&#x7ED3;&#x5408;&#x5728;&#x4E00;&#x8D77;&#x624D;&#x80FD;&#x4F7F;&#x7528;&#x3002;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x6709;&#x65F6;&#x5019;&#x9700;&#x8981;&#x8BA9;&#x5B83;&#x5185;&#x5D4C;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x8FD0;&#x884C;&#xFF0C; &#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7528;&#x4E00;&#x4E2A;&#x53EB; PhantomJS &#x7684;&#x5DE5;&#x5177;&#x4EE3;&#x66FF;&#x771F;&#x5B9E;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x3002;Selenium &#x5E93;&#x91CC;&#x6709;&#x4E2A;&#x53EB; WebDriver &#x7684; API&#x3002;WebDriver &#x6709;&#x70B9;&#x513F;&#x50CF;&#x53EF;&#x4EE5;&#x52A0;&#x8F7D;&#x7F51;&#x7AD9;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4E5F;&#x53EF;&#x4EE5;&#x50CF; BeautifulSoup &#x6216;&#x8005;&#x5176;&#x4ED6;Selector &#x5BF9;&#x8C61;&#x4E00;&#x6837;&#x7528;&#x6765;&#x67E5;&#x627E;&#x9875;&#x9762;&#x5143;&#x7D20;&#xFF0C;&#x4E0E;&#x9875;&#x9762;&#x4E0A;&#x7684;&#x5143;&#x7D20;&#x8FDB;&#x884C;&#x4EA4;&#x4E92; (&#x53D1;&#x9001;&#x6587;&#x672C;&#x3001;&#x70B9;&#x51FB;&#x7B49;)&#xFF0C;&#x4EE5;&#x53CA;&#x6267;&#x884C;&#x5176;&#x4ED6;&#x52A8;&#x4F5C;&#x6765;&#x8FD0;&#x884C;&#x7F51;&#x7EDC;&#x722C;&#x866B;&#x3002;</p>
<p>PhantomJS &#x662F;&#x4E00;&#x4E2A;&#x57FA;&#x4E8E; Webkit &#x7684;&#x201C;&#x65E0;&#x754C;&#x9762;&#x201D;(headless)&#x6D4F;&#x89C8;&#x5668;&#xFF0C;&#x5B83;&#x4F1A;&#x628A;&#x7F51;&#x7AD9;&#x52A0;&#x8F7D;&#x5230;&#x5185;&#x5B58;&#x5E76;&#x6267;&#x884C;&#x9875; &#x9762;&#x4E0A;&#x7684; JavaScript&#xFF0C;&#x56E0;&#x4E3A;&#x4E0D;&#x4F1A;&#x5C55;&#x793A;&#x56FE;&#x5F62;&#x754C;&#x9762;&#xFF0C;&#x6240;&#x4EE5;&#x8FD0;&#x884C;&#x8D77;&#x6765;&#x6BD4;&#x5B8C;&#x6574;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x8981;&#x9AD8;&#x6548;&#x3002;&#x76F8;&#x6BD4;&#x4F20;&#x7EDF;&#x7684; Chrome &#x6216; Firefox &#x6D4F;&#x89C8;&#x5668;&#x7B49;&#xFF0C;&#x8D44;&#x6E90;&#x6D88;&#x8017;&#x4F1A;&#x66F4;&#x5C11;&#x3002; &#x5982;&#x679C;&#x6211;&#x4EEC;&#x628A; Selenium &#x548C; PhantomJS &#x7ED3;&#x5408;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x8FD0;&#x884C;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x5F3A;&#x5927;&#x7684;&#x7F51;&#x7EDC;&#x722C;&#x866B;&#x4E86;&#xFF0C;&#x8FD9; &#x4E2A;&#x722C;&#x866B;&#x53EF;&#x4EE5;&#x5904;&#x7406; JavaScript&#x3001;Cookie&#x3001;headers&#xFF0C;&#x4EE5;&#x53CA;&#x4EFB;&#x4F55;&#x6211;&#x4EEC;&#x771F;&#x5B9E;&#x7528;&#x6237;&#x9700;&#x8981;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x3002; &#x4E3B;&#x7A0B;&#x5E8F;&#x9000;&#x51FA;&#x540E;&#xFF0C;selenium &#x4E0D;&#x4FDD;&#x8BC1; phantomJS &#x4E5F;&#x6210;&#x529F;&#x9000;&#x51FA;&#xFF0C;&#x6700;&#x597D;&#x624B;&#x52A8;&#x5173;&#x95ED; phantomJS &#x8FDB;&#x7A0B;&#x3002;&#xFF08;&#x6709; &#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x591A;&#x4E2A; phantomJS &#x8FDB;&#x7A0B;&#x8FD0;&#x884C;&#xFF0C;&#x5360;&#x7528;&#x5185;&#x5B58;&#xFF09;&#x3002; WebDriverWait &#x867D;&#x7136;&#x53EF;&#x80FD;&#x4F1A;&#x51CF;&#x5C11;&#x5EF6;&#x65F6;&#xFF0C;&#x4F46;&#x662F;&#x76EE;&#x524D;&#x5B58;&#x5728; bug&#xFF08;&#x5404;&#x79CD;&#x62A5;&#x9519;&#xFF09;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x53EF;&#x4EE5;&#x91C7;&#x7528;sleep&#x3002; phantomJS &#x722C;&#x6570;&#x636E;&#x6BD4;&#x8F83;&#x6162;&#xFF0C;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x591A;&#x7EBF;&#x7A0B;&#x3002;&#x5982;&#x679C;&#x8FD0;&#x884C;&#x7684;&#x65F6;&#x5019;&#x53D1;&#x73B0;&#x6709;&#x7684;&#x53EF;&#x4EE5;&#x8FD0;&#x884C;&#xFF0C;&#x6709;&#x7684;&#x4E0D;&#x80FD;&#xFF0C;&#x53EF; &#x4EE5;&#x5C1D;&#x8BD5;&#x5C06; phantomJS &#x6539;&#x6210; Chrome&#x3002;</p>
<h2 id="&#x4EE3;&#x7406;-ip-&#x91CC;&#x7684;&#x900F;&#x660E;&#x533F;&#x540D;&#x9AD8;&#x533F;&#x5206;&#x522B;&#x662F;&#x6307;&#xFF1F;">&#x4EE3;&#x7406; IP &#x91CC;&#x7684;&#x201C;&#x900F;&#x660E;&#x201D;&#x201C;&#x533F;&#x540D;&#x201D;&#x201C;&#x9AD8;&#x533F;&#x201D;&#x5206;&#x522B;&#x662F;&#x6307;&#xFF1F;</h2>
<p>&#x900F;&#x660E;&#x4EE3;&#x7406;&#x7684;&#x610F;&#x601D;&#x662F;&#x5BA2;&#x6237;&#x7AEF;&#x6839;&#x672C;&#x4E0D;&#x9700;&#x8981;&#x77E5;&#x9053;&#x6709;&#x4EE3;&#x7406;&#x670D;&#x52A1;&#x5668;&#x7684;&#x5B58;&#x5728;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4F20;&#x9001;&#x7684;&#x4ECD;&#x7136;&#x662F;&#x771F;&#x5B9E;&#x7684; IP&#x3002;&#x4F60; &#x8981;&#x60F3;&#x9690;&#x85CF;&#x7684;&#x8BDD;&#xFF0C;&#x4E0D;&#x8981;&#x7528;&#x8FD9;&#x4E2A;&#x3002;</p>
<p>&#x666E;&#x901A;&#x533F;&#x540D;&#x4EE3;&#x7406;&#x80FD;&#x9690;&#x85CF;&#x5BA2;&#x6237;&#x673A;&#x7684;&#x771F;&#x5B9E; IP&#xFF0C;&#x4F46;&#x4F1A;&#x6539;&#x53D8;&#x6211;&#x4EEC;&#x7684;&#x8BF7;&#x6C42;&#x4FE1;&#x606F;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x6709;&#x53EF;&#x80FD;&#x4F1A;&#x8BA4;&#x4E3A;&#x6211;&#x4EEC;&#x4F7F;&#x7528; &#x4E86;&#x4EE3;&#x7406;&#x3002;&#x4E0D;&#x8FC7;&#x4F7F;&#x7528;&#x6B64;&#x79CD;&#x4EE3;&#x7406;&#x65F6;&#xFF0C;&#x867D;&#x7136;&#x88AB;&#x8BBF;&#x95EE;&#x7684;&#x7F51;&#x7AD9;&#x4E0D;&#x80FD;&#x77E5;&#x9053;&#x4F60;&#x7684; ip &#x5730;&#x5740;&#xFF0C;&#x4F46;&#x4ECD;&#x7136;&#x53EF;&#x4EE5;&#x77E5;&#x9053;&#x4F60;&#x5728;&#x4F7F;&#x7528;&#x4EE3;&#x7406;&#xFF0C;&#x5F53;&#x7136;&#x67D0;&#x4E9B;&#x80FD;&#x591F;&#x4FA6;&#x6D4B; ip &#x7684;&#x7F51;&#x9875;&#x4ECD;&#x7136;&#x53EF;&#x4EE5;&#x67E5;&#x5230;&#x4F60;&#x7684; ip&#x3002;</p>
<p>&#x9AD8;&#x533F;&#x540D;&#x4EE3;&#x7406;&#x4E0D;&#x6539;&#x53D8;&#x5BA2;&#x6237;&#x673A;&#x7684;&#x8BF7;&#x6C42;&#xFF0C;&#x8FD9;&#x6837;&#x5728;&#x670D;&#x52A1;&#x5668;&#x770B;&#x6765;&#x5C31;&#x50CF;&#x6709;&#x4E2A;&#x771F;&#x6B63;&#x7684;&#x5BA2;&#x6237;&#x6D4F;&#x89C8;&#x5668;&#x5728;&#x8BBF;&#x95EE;&#x5B83;&#xFF0C;&#x8FD9;&#x65F6;&#x5BA2; &#x6237;&#x7684;&#x771F;&#x5B9E; IP &#x662F;&#x9690;&#x85CF;&#x7684;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x4E0D;&#x4F1A;&#x8BA4;&#x4E3A;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x4E86;&#x4EE3;&#x7406;&#x3002; </p>
<p>&#x8BBE;&#x7F6E;&#x4EE3;&#x7406;&#x6709;&#x4EE5;&#x4E0B;&#x4E24;&#x4E2A;&#x597D;&#x5904;&#xFF1A; </p>
<p>1&#xFF0C;&#x8BA9;&#x670D;&#x52A1;&#x5668;&#x4EE5;&#x4E3A;&#x4E0D;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#x5728;&#x8BF7;&#x6C42; 2&#xFF0C;&#x9632;&#x6B62;&#x6211;&#x4EEC;&#x7684;&#x771F;&#x5B9E;&#x5730;&#x5740;&#x88AB;&#x6CC4;&#x9732;&#xFF0C;&#x9632;&#x6B62;&#x88AB;&#x8FFD;&#x7A76;</p>
<h2 id="requests-&#x8FD4;&#x56DE;&#x7684;-content-&#x548C;-text-&#x7684;&#x533A;&#x522B;">requests &#x8FD4;&#x56DE;&#x7684; content &#x548C; text &#x7684;&#x533A;&#x522B;</h2>
<p>a)response.text &#x8FD4;&#x56DE;&#x7684;&#x662F; Unicode &#x578B;&#x6570;&#x636E;&#xFF1B; a)response.content &#x8FD4;&#x56DE;&#x7684;&#x662F; bytes &#x7C7B;&#x578B;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x4E8C;&#x8FDB;&#x5236;&#x6570;&#x636E;&#xFF1B; b)&#x83B7;&#x53D6;&#x6587;&#x672C;&#x4F7F;&#x7528;&#xFF0C;response.text&#xFF1B; b)&#x83B7;&#x53D6;&#x56FE;&#x7247;,&#x6587;&#x4EF6;&#xFF0C;&#x4F7F;&#x7528; response.content&#xFF1B; c)response.text &#x7C7B;&#x578B;&#xFF1A;str &#x89E3;&#x7801;&#x7C7B;&#x578B;&#xFF1A; &#x6839;&#x636E; HTTP &#x5934;&#x90E8;&#x5BF9;&#x54CD;&#x5E94;&#x7684;&#x7F16;&#x7801;&#x4F5C;&#x51FA;&#x6709;&#x6839;&#x636E;&#x7684;&#x63A8;&#x6D4B;&#xFF0C;&#x63A8;&#x6D4B;&#x7684;&#x6587;&#x672C;&#x7F16;&#x7801; &#x5982;&#x4F55;&#x4FEE;&#x6539;&#x7F16;&#x7801;&#x65B9;&#x5F0F;&#xFF1A;response.encoding=&#x201D;gbk&#x201D; c)response.content &#x7C7B;&#x578B;&#xFF1A;bytes &#x89E3;&#x7801;&#x7C7B;&#x578B;&#xFF1A; &#x6CA1;&#x6709;&#x6307;&#x5B9A; &#x5982;&#x4F55;&#x4FEE;&#x6539;&#x7F16;&#x7801;&#x65B9;&#x5F0F;&#xFF1A;response.content.decode(&#x201C;utf8&#x201D;)</p>
<h2 id="robots-&#x534F;&#x8BAE;">robots &#x534F;&#x8BAE;</h2>
<p>Robots &#x534F;&#x8BAE;&#xFF1A;&#x7F51;&#x7AD9;&#x901A;&#x8FC7; Robots &#x534F;&#x8BAE;&#x544A;&#x8BC9;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x54EA;&#x4E9B;&#x9875;&#x9762;&#x53EF;&#x4EE5;&#x6293;&#x53D6;&#xFF0C;&#x54EA;&#x4E9B;&#x9875;&#x9762;&#x4E0D;&#x80FD;&#x6293;&#x53D6;&#x3002;</p>
<p>&#x4E3A;&#x4EC0;&#x4E48; requests &#x8BF7;&#x6C42;&#x9700;&#x8981;&#x5E26;&#x4E0A; header&#xFF1F;</p>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x7684;&#x722C;&#x866B;&#x8BF7;&#x6C42;&#x770B;&#x8D77;&#x6765;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x6B63;&#x5E38;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x8BF7;&#x6C42; &#x539F;&#x56E0;&#x662F;&#xFF1A;&#x6A21;&#x62DF;&#x6D4F;&#x89C8;&#x5668;&#xFF0C;&#x6B3A;&#x9A97;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x83B7;&#x53D6;&#x548C;&#x6D4F;&#x89C8;&#x5668;&#x4E00;&#x81F4;&#x7684;&#x5185;&#x5BB9; header &#x7684;&#x5F62;&#x5F0F;&#xFF1A;&#x5B57;&#x5178; headers = {&quot;User-Agent&quot;: &quot;Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/54.0.2840.99 Safari/537.36&quot;} &#x7528;&#x6CD5;&#xFF1A; requests.get(url,headers=headers)</p>
<h2 id="dumpsloads-&#x4E0E;-dumpload-&#x7684;&#x533A;&#x522B;&#xFF1F;">dumps,loads &#x4E0E; dump,load &#x7684;&#x533A;&#x522B;&#xFF1F;</h2>
<p>json.dumps()&#x5C06; pyhton &#x7684; dict &#x6570;&#x636E;&#x7C7B;&#x578B;&#x7F16;&#x7801;&#x4E3A; json &#x5B57;&#x7B26;&#x4E32;&#xFF1B; json.loads()&#x5C06; json &#x5B57;&#x7B26;&#x4E32;&#x89E3;&#x7801;&#x4E3A; dict &#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF1B; json.dump(x,y) x &#x662F; json &#x5BF9;&#x8C61;, y &#x662F;&#x6587;&#x4EF6;&#x5BF9;&#x8C61;&#xFF0C;&#x6700;&#x7EC8;&#x662F;&#x5C06; json &#x5BF9;&#x8C61;&#x5199;&#x5165;&#x5230;&#x6587;&#x4EF6;&#x4E2D;&#xFF1B; json.load(y) &#x4ECE;&#x6587;&#x4EF6;&#x5BF9;&#x8C61; y &#x4E2D;&#x8BFB;&#x53D6; json &#x5BF9;&#x8C61;&#x3002;</p>
<h2 id="requests-&#x4F7F;&#x7528;&#x5C0F;&#x6280;&#x5DE7;">requests &#x4F7F;&#x7528;&#x5C0F;&#x6280;&#x5DE7;</h2>
<p>1&#x3001;reqeusts.util.dict_from_cookiejar &#x628A; cookie &#x5BF9;&#x8C61;&#x8F6C;&#x5316;&#x4E3A;&#x5B57;&#x5178; 1.1. requests.get(url,cookies={}) </p>
<p>2&#x3001;&#x8BBE;&#x7F6E;&#x8BF7;&#x6C42;&#x4E0D;&#x7528; SSL &#x8BC1;&#x4E66;&#x9A8C;&#x8BC1; response =requests.get(&quot;<a href="https://www.12306.cn/mormhweb" target="_blank">https://www.12306.cn/mormhweb</a>/ &quot;, verify=False) </p>
<p>3&#x3001;&#x8BBE;&#x7F6E;&#x8D85;&#x65F6; response =requests.get(url,timeout=10) </p>
<p>4&#x3001;&#x914D;&#x5408;&#x72B6;&#x6001;&#x7801;&#x5224;&#x65AD;&#x662F;&#x5426;&#x8BF7;&#x6C42;&#x6210;&#x529F; assert response.status_code== 200</p>
<h2 id="&#x5E73;&#x5E38;&#x600E;&#x4E48;&#x4F7F;&#x7528;&#x4EE3;&#x7406;&#x7684;-&#xFF1F;">&#x5E73;&#x5E38;&#x600E;&#x4E48;&#x4F7F;&#x7528;&#x4EE3;&#x7406;&#x7684; &#xFF1F;</h2>
<ol>
<li>&#x81EA;&#x5DF1;&#x7EF4;&#x62A4;&#x4EE3;&#x7406;&#x6C60;</li>
</ol>
<ol>
<li>&#x4ED8;&#x8D39;&#x8D2D;&#x4E70;&#xFF08;&#x76EE;&#x524D;&#x5E02;&#x573A;&#x4E0A;&#x6709;&#x5F88;&#x591A; ip &#x4EE3;&#x7406;&#x5546;&#xFF0C;&#x53EF;&#x81EA;&#x884C;&#x767E;&#x5EA6;&#x4E86;&#x89E3;&#xFF0C;&#x5EFA;&#x8BAE;&#x770B;&#x770B;&#x4ED6;&#x4EEC;&#x7684;&#x63A5;&#x53E3;&#x6587;&#x6863;&#xFF08;API&amp;SDK&#xFF09;&#xFF09;</li>
</ol>
<h2 id="ip-&#x5B58;&#x653E;&#x5728;&#x54EA;&#x91CC;&#xFF1F;&#x600E;&#x4E48;&#x7EF4;&#x62A4;-ip&#xFF1F;&#x5BF9;&#x4E8E;&#x5C01;&#x4E86;&#x591A;&#x4E2A;-ip-&#x7684;&#xFF0C;&#x600E;&#x4E48;&#x5224;&#x5B9A;-ip-&#x6CA1;&#x88AB;&#x5C01;&#xFF1F;">IP &#x5B58;&#x653E;&#x5728;&#x54EA;&#x91CC;&#xFF1F;&#x600E;&#x4E48;&#x7EF4;&#x62A4; IP&#xFF1F;&#x5BF9;&#x4E8E;&#x5C01;&#x4E86;&#x591A;&#x4E2A; ip &#x7684;&#xFF0C;&#x600E;&#x4E48;&#x5224;&#x5B9A; IP &#x6CA1;&#x88AB;&#x5C01;&#xFF1F;</h2>
<p>&#x5B58;&#x653E;&#x5728;&#x6570;&#x636E;&#x5E93;(redis&#x3001;mysql &#x7B49;)&#x3002; &#x7EF4;&#x62A4;&#x591A;&#x4E2A;&#x4EE3;&#x7406;&#x7F51;&#x7AD9;&#xFF1A; &#x4E00;&#x822C;&#x4EE3;&#x7406;&#x7684;&#x5B58;&#x6D3B;&#x65F6;&#x95F4;&#x5F80;&#x5F80;&#x5728;&#x5341;&#x51E0;&#x5206;&#x949F;&#x5DE6;&#x53F3;&#xFF0C;&#x5B9A;&#x65F6;&#x4EFB;&#x52A1;&#xFF0C;&#x52A0;&#x4E0A;&#x4EE3;&#x7406; IP &#x53BB;&#x8BBF;&#x95EE;&#x7F51;&#x9875;&#xFF0C;&#x9A8C;&#x8BC1;&#x5176;&#x662F;&#x5426;&#x53EF;&#x7528;&#xFF0C; &#x5982;&#x679C;&#x8FD4;&#x56DE;&#x72B6;&#x6001;&#x4E3A; 200&#xFF0C;&#x8868;&#x793A;&#x8FD9;&#x4E2A;&#x4EE3;&#x7406;&#x662F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x7684;&#x3002;</p>
<h2 id="&#x600E;&#x4E48;&#x83B7;&#x53D6;&#x52A0;&#x5BC6;&#x7684;&#x6570;&#x636E;&#xFF1F;">&#x600E;&#x4E48;&#x83B7;&#x53D6;&#x52A0;&#x5BC6;&#x7684;&#x6570;&#x636E;&#xFF1F;</h2>
<ol>
<li>Web &#x7AEF;&#x52A0;&#x5BC6;&#x53EF;&#x5C1D;&#x8BD5;&#x79FB;&#x52A8;&#x7AEF;&#xFF08;app&#xFF09;</li>
</ol>
<ol>
<li>&#x89E3;&#x6790;&#x52A0;&#x5BC6;&#xFF0C;&#x770B;&#x80FD;&#x5426;&#x7834;&#x89E3;</li>
</ol>
<ol>
<li>&#x53CD;&#x722C;&#x624B;&#x6BB5;&#x5C42;&#x51FA;&#x4E0D;&#x7A77;&#xFF0C;js &#x52A0;&#x5BC6;&#x8F83;&#x591A;&#xFF0C;&#x53EA;&#x80FD;&#x5177;&#x4F53;&#x95EE;&#x9898;&#x5177;&#x4F53;&#x5206;&#x6790;</li>
</ol>
<p>&#x5206;&#x6790;&#x524D;&#x7AEF; js &#x6587;&#x4EF6;&#xFF0C;&#x627E;&#x5230;&#x52A0;&#x5BC6;&#x89E3;&#x5BC6;&#x6570;&#x636E;&#x7684; js &#x4EE3;&#x7801;&#xFF0C;&#x7528; Python &#x4EE3;&#x7801;&#x5B9E;&#x73B0;&#x6216;&#x8005;&#x5229;&#x7528; js2py &#x6216; pyexecjs &#x7B49;&#x6267;&#x884C; js &#x4EE3;&#x7801;</p>
<h2 id="&#x5047;&#x5982;&#x6BCF;&#x5929;&#x722C;&#x53D6;&#x91CF;&#x5728;-5&#x3001;6-&#x4E07;&#x6761;&#x6570;&#x636E;&#xFF0C;&#x4E00;&#x822C;&#x5F00;&#x51E0;&#x4E2A;&#x7EBF;&#x7A0B;&#xFF0C;&#x6BCF;&#x4E2A;&#x7EBF;&#x7A0B;-ip-&#x9700;&#x8981;&#x52A0;&#x9501;&#x9650;&#x5B9A;&#x5417;&#xFF1F;">&#x5047;&#x5982;&#x6BCF;&#x5929;&#x722C;&#x53D6;&#x91CF;&#x5728; 5&#x3001;6 &#x4E07;&#x6761;&#x6570;&#x636E;&#xFF0C;&#x4E00;&#x822C;&#x5F00;&#x51E0;&#x4E2A;&#x7EBF;&#x7A0B;&#xFF0C;&#x6BCF;&#x4E2A;&#x7EBF;&#x7A0B; ip &#x9700;&#x8981;&#x52A0;&#x9501;&#x9650;&#x5B9A;&#x5417;&#xFF1F;</h2>
<ol>
<li>5&#x3001;6 &#x4E07;&#x6761;&#x6570;&#x636E;&#x76F8;&#x5BF9;&#x6765;&#x8BF4;&#x6570;&#x636E;&#x91CF;&#x6BD4;&#x8F83;&#x5C0F;&#xFF0C;&#x7EBF;&#x7A0B;&#x6570;&#x91CF;&#x4E0D;&#x505A;&#x5F3A;&#x5236;&#x8981;&#x6C42;(&#x505A;&#x9664;&#x6CD5;&#x5F97;&#x4E00;&#x4E2A;&#x5408;&#x7406;&#x503C;&#x5373;&#x53EF;&#xFF09;</li>
</ol>
<ol>
<li>&#x591A;&#x7EBF;&#x7A0B;&#x4F7F;&#x7528;&#x4EE3;&#x7406;&#xFF0C;&#x5E94;&#x4FDD;&#x8BC1;&#x4E0D;&#x5728;&#x540C;&#x65F6;&#x4E00;&#x523B;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x4EE3;&#x7406; IP</li>
</ol>
<ol>
<li>&#x4E00;&#x822C;&#x8BF7;&#x6C42;&#x5E76;&#x53D1;&#x91CF;&#x4E3B;&#x8981;&#x8003;&#x8651;&#x7F51;&#x7AD9;&#x7684;&#x53CD;&#x722C;&#x7A0B;&#x5EA6;&#x6765;&#x5B9A;&#x3002;</li>
</ol>
<h2 id="&#x600E;&#x4E48;&#x76D1;&#x63A7;&#x722C;&#x866B;&#x7684;&#x72B6;&#x6001;">&#x600E;&#x4E48;&#x76D1;&#x63A7;&#x722C;&#x866B;&#x7684;&#x72B6;&#x6001;</h2>
<ol>
<li>&#x4F7F;&#x7528; python &#x7684; STMP &#x5305;&#x5C06;&#x722C;&#x866B;&#x7684;&#x72B6;&#x6001;&#x4FE1;&#x5FC3;&#x53D1;&#x9001;&#x5230;&#x6307;&#x5B9A;&#x7684;&#x90AE;&#x7BB1;</li>
</ol>
<ol>
<li>Scrapyd&#x3001;pyspider</li>
</ol>
<ol>
<li>&#x5F15;&#x5165;&#x65E5;&#x5FD7;</li>
</ol>
<p>&#x96C6;&#x6210;&#x65E5;&#x5FD7;&#x5904;&#x7406;&#x5E73;&#x53F0;&#x6765;&#x8FDB;&#x884C;&#x76D1;&#x63A7;&#xFF0C;&#x5982; elk</p>
<h2 id="&#x63CF;&#x8FF0;&#x4E0B;-scrapy-&#x6846;&#x67B6;&#x8FD0;&#x884C;&#x7684;&#x673A;&#x5236;&#xFF1F;">&#x63CF;&#x8FF0;&#x4E0B; scrapy &#x6846;&#x67B6;&#x8FD0;&#x884C;&#x7684;&#x673A;&#x5236;&#xFF1F;</h2>
<p>&#x4ECE; start_urls &#x91CC;&#x83B7;&#x53D6;&#x7B2C;&#x4E00;&#x6279; url &#x5E76;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#xFF0C;&#x8BF7;&#x6C42;&#x7531;&#x5F15;&#x64CE;&#x4EA4;&#x7ED9;&#x8C03;&#x5EA6;&#x5668;&#x5165;&#x8BF7;&#x6C42;&#x961F;&#x5217;&#xFF0C;&#x83B7;&#x53D6;&#x5B8C;&#x6BD5;&#x540E;&#xFF0C;&#x8C03;&#x5EA6;&#x5668;&#x5C06;&#x8BF7;&#x6C42;&#x961F;&#x5217;&#x91CC;&#x7684;&#x8BF7;&#x6C42;&#x4EA4;&#x7ED9;&#x4E0B;&#x8F7D;&#x5668;&#x53BB;&#x83B7;&#x53D6;&#x8BF7;&#x6C42;&#x5BF9;&#x5E94;&#x7684;&#x54CD;&#x5E94;&#x8D44;&#x6E90;&#xFF0C;&#x5E76;&#x5C06;&#x54CD;&#x5E94;&#x4EA4;&#x7ED9;&#x81EA;&#x5DF1;&#x7F16;&#x5199;&#x7684;&#x89E3;&#x6790;&#x65B9;&#x6CD5;&#x505A;&#x63D0;&#x53D6;&#x5904;&#x7406;&#xFF1A;</p>
<ol>
<li>&#x5982;&#x679C;&#x63D0;&#x53D6;&#x51FA;&#x9700;&#x8981;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5219;&#x4EA4;&#x7ED9;&#x7BA1;&#x9053;&#x6587;&#x4EF6;&#x5904;&#x7406;&#xFF1B;</li>
</ol>
<ol>
<li>&#x5982;&#x679C;&#x63D0;&#x53D6;&#x51FA; url&#xFF0C;&#x5219;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#x4E4B;&#x524D;&#x7684;&#x6B65;&#x9AA4;&#xFF08;&#x53D1;&#x9001; url &#x8BF7;&#x6C42;&#xFF0C;&#x5E76;&#x7531;&#x5F15;&#x64CE;&#x5C06;&#x8BF7;&#x6C42;&#x4EA4;&#x7ED9;&#x8C03;&#x5EA6;&#x5668;&#x5165;&#x961F;&#x5217;...)&#xFF0C;&#x76F4;&#x5230;&#x8BF7;&#x6C42;&#x961F;&#x5217;&#x91CC;&#x6CA1;&#x6709;&#x8BF7;&#x6C42;&#xFF0C;&#x7A0B;&#x5E8F;&#x7ED3;&#x675F;&#x3002;</li>
</ol>
<h2 id="&#x8C08;&#x8C08;&#x4F60;&#x5BF9;-scrapy-&#x7684;&#x7406;&#x89E3;&#xFF1F;">&#x8C08;&#x8C08;&#x4F60;&#x5BF9; Scrapy &#x7684;&#x7406;&#x89E3;&#xFF1F;</h2>
<p>scrapy &#x662F;&#x4E00;&#x4E2A;&#x4E3A;&#x4E86;&#x722C;&#x53D6;&#x7F51;&#x7AD9;&#x6570;&#x636E;&#xFF0C;&#x63D0;&#x53D6;&#x7ED3;&#x6784;&#x6027;&#x6570;&#x636E;&#x800C;&#x7F16;&#x5199;&#x7684;&#x5E94;&#x7528;&#x6846;&#x67B6;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x5B9E;&#x73B0;&#x5C11;&#x91CF;&#x4EE3;&#x7801;&#xFF0C;&#x5C31;&#x80FD;&#x591F;&#x5FEB;&#x901F;&#x7684;&#x6293;&#x53D6;&#x5230;&#x6570;&#x636E;&#x5185;&#x5BB9;&#x3002;Scrapy &#x4F7F;&#x7528;&#x4E86; Twisted &#x5F02;&#x6B65;&#x7F51;&#x7EDC;&#x6846;&#x67B6;&#x6765;&#x5904;&#x7406;&#x7F51;&#x7EDC;&#x901A;&#x8BAF;&#xFF0C;&#x53EF;&#x4EE5;&#x52A0;&#x5FEB;&#x6211;&#x4EEC; &#x7684;&#x4E0B;&#x8F7D;&#x901F;&#x5EA6;&#xFF0C;&#x4E0D;&#x7528;&#x81EA;&#x5DF1;&#x53BB;&#x5B9E;&#x73B0;&#x5F02;&#x6B65;&#x6846;&#x67B6;&#xFF0C;&#x5E76;&#x4E14;&#x5305;&#x542B;&#x4E86;&#x5404;&#x79CD;&#x4E2D;&#x95F4;&#x4EF6;&#x63A5;&#x53E3;&#xFF0C;&#x53EF;&#x4EE5;&#x7075;&#x6D3B;&#x7684;&#x5B8C;&#x6210;&#x5404;&#x79CD;&#x9700;&#x6C42;&#x3002; scrapy &#x6846;&#x67B6;&#x7684;&#x5DE5;&#x4F5C;&#x6D41;&#x7A0B;&#xFF1A; 1.&#x9996;&#x5148; Spiders&#xFF08;&#x722C;&#x866B;&#xFF09;&#x5C06;&#x9700;&#x8981;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#x7684; url(requests)&#x7ECF;ScrapyEngine&#xFF08;&#x5F15;&#x64CE;&#xFF09;&#x4EA4;&#x7ED9; Scheduler &#xFF08;&#x8C03;&#x5EA6;&#x5668;&#xFF09;&#x3002; 2.Scheduler&#xFF08;&#x6392;&#x5E8F;&#xFF0C;&#x5165;&#x961F;&#xFF09;&#x5904;&#x7406;&#x540E;&#xFF0C;&#x7ECF;ScrapyEngine&#xFF0C;DownloaderMiddlewares(&#x53EF;&#x9009;&#xFF0C;&#x4E3B;&#x8981; &#x6709; User_Agent&#xFF0C; Proxy &#x4EE3;&#x7406;)&#x4EA4;&#x7ED9;Downloader&#x3002; 3.Downloader &#x5411;&#x4E92;&#x8054;&#x7F51;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#xFF0C;&#x5E76;&#x63A5;&#x6536;&#x4E0B;&#x8F7D;&#x54CD;&#x5E94;&#xFF08;response&#xFF09;&#x3002;&#x5C06;&#x54CD;&#x5E94;</p>
<p>&#xFF08;response&#xFF09;&#x7ECF; ScrapyEngine&#xFF0C;SpiderMiddlewares(&#x53EF;&#x9009;)&#x4EA4;&#x7ED9; Spiders&#x3002; 4.Spiders &#x5904;&#x7406;response&#xFF0C;&#x63D0;&#x53D6;&#x6570;&#x636E;&#x5E76;&#x5C06;&#x6570;&#x636E;&#x7ECF; ScrapyEngine &#x4EA4;&#x7ED9; ItemPipeline &#x4FDD;&#x5B58;&#xFF08;&#x53EF;&#x4EE5;&#x662F;&#x672C; &#x5730;&#xFF0C;&#x53EF;&#x4EE5;&#x662F;&#x6570;&#x636E;&#x5E93;&#xFF09;&#x3002;&#x63D0;&#x53D6; url &#x91CD;&#x65B0;&#x7ECF; ScrapyEngine &#x4EA4;&#x7ED9; Scheduler &#x8FDB;&#x884C;&#x4E0B;&#x4E00;&#x4E2A;&#x5FAA;&#x73AF;&#x3002;&#x76F4;&#x5230;&#x65E0; Url &#x8BF7;&#x6C42;&#x7A0B;&#x5E8F;&#x505C;&#x6B62;&#x7ED3;&#x675F;&#x3002;</p>
<h2 id="&#x600E;&#x4E48;&#x5224;&#x65AD;&#x7F51;&#x7AD9;&#x662F;&#x5426;&#x66F4;&#x65B0;&#xFF1F;">&#x600E;&#x4E48;&#x5224;&#x65AD;&#x7F51;&#x7AD9;&#x662F;&#x5426;&#x66F4;&#x65B0;&#xFF1F;</h2>
<p>&#x9759;&#x6001;&#x9875;&#x9762;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x4F7F;&#x7528; http &#x7684; head &#x65B9;&#x6CD5;&#x67E5;&#x770B;&#x7F51;&#x7AD9;&#x7684;&#x6700;&#x540E;&#x66F4;&#x65B0;&#x65F6;&#x95F4; &#x5982;&#x679C;&#x524D;&#x8005;&#x884C;&#x4E0D;&#x901A;&#xFF0C;&#x5219;&#x9700;&#x8981;&#x5BF9;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x6807;&#x8BC6;&#xFF0C;&#x5982;&#x5229;&#x7528;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#x751F;&#x6210;&#x6307;&#x7EB9;&#xFF0C;&#x7136;&#x540E;&#x5B9A;&#x671F;&#x53D1;&#x8D77;&#x8BF7;&#x6C42;&#x83B7;&#x53D6;&#x6570;&#x636E;&#xFF0C;&#x6BD4; &#x5BF9;&#x6307;&#x7EB9;&#x662F;&#x5426;&#x4E00;&#x81F4;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x81F4;&#xFF0C;&#x8BF4;&#x660E;&#x7F51;&#x7AD9;&#x6CA1;&#x6709;&#x66F4;&#x65B0;&#xFF1B;&#x53CD;&#x4E4B;&#x8BF4;&#x660E;&#x66F4;&#x65B0;</p>
<h2 id="&#x589E;&#x91CF;&#x722C;&#x53D6;">&#x589E;&#x91CF;&#x722C;&#x53D6;</h2>
<p>&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x6301;&#x4E45;&#x5316;&#x7684;&#x8BF7;&#x6C42;&#x961F;&#x5217; &#x589E;&#x91CF;&#x722C;&#x53D6;&#x5373;&#x4FDD;&#x5B58;&#x4E0A;&#x4E00;&#x6B21;&#x72B6;&#x6001;&#xFF0C;&#x672C;&#x6B21;&#x6293;&#x53D6;&#x65F6;&#x4E0E;&#x4E0A;&#x6B21;&#x6BD4;&#x5BF9;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x5728;&#x4E0A;&#x6B21;&#x7684;&#x72B6;&#x6001;&#x4E2D;&#xFF0C;&#x4FBF;&#x89C6; &#x4E3A;&#x589E;&#x91CF;&#xFF0C;&#x4FDD;&#x5B58;&#x4E0B;&#x6765;&#x3002;&#x5BF9;&#x4E8E; scrapy &#x6765;&#x8BF4;&#xFF0C;&#x4E0A;&#x4E00;&#x6B21;&#x7684;&#x72B6;&#x6001;&#x662F;&#x6293;&#x53D6;&#x7684;&#x7279;&#x5F81;&#x6570;&#x636E;&#x548C;&#x4E0A;&#x6B21;&#x722C;&#x53D6;&#x7684;request &#x961F;&#x5217;&#xFF08;url &#x5217;&#x8868;&#xFF09;&#xFF0C;request &#x961F;&#x5217;&#x53EF;&#x4EE5;&#x901A;&#x8FC7; request &#x961F;&#x5217;&#x53EF;&#x4EE5;&#x901A;&#x8FC7; scrapy.core.scheduler&#x7684; pending_requests &#x6210;&#x5458;&#x5F97;&#x5230;&#xFF0C;&#x5728;&#x722C;&#x866B;&#x542F;&#x52A8;&#x65F6;&#x5BFC;&#x5165;&#x4E0A;&#x6B21;&#x722C;&#x53D6;&#x7684;&#x7279;&#x5F81;&#x6570; &#x636E;&#xFF0C;&#x5E76;&#x4E14;&#x7528;&#x4E0A;&#x6B21; request &#x961F;&#x5217;&#x7684;&#x6570;&#x636E;&#x4F5C;&#x4E3A; start url &#x8FDB;&#x884C;&#x722C;&#x53D6;&#xFF0C;&#x4E0D;&#x5728;&#x4E0A;&#x4E00;&#x6B21;&#x72B6;&#x6001;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x4FBF;&#x4FDD; &#x5B58;&#x3002; &#x9009;&#x7528; BloomFilter &#x539F;&#x56E0;&#xFF1A;&#x5BF9;&#x722C;&#x866B;&#x722C;&#x53D6;&#x6570;&#x636E;&#x7684;&#x4FDD;&#x5B58;&#x6709;&#x591A;&#x79CD;&#x5F62;&#x5F0F;&#xFF0C;&#x53EF;&#x4EE5;&#x662F;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x53EF;&#x4EE5;&#x662F;&#x78C1; &#x76D8;&#x6587;&#x4EF6;&#x7B49;&#xFF0C;&#x4E0D;&#x7BA1;&#x662F;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x8FD8;&#x662F;&#x78C1;&#x76D8;&#x6587;&#x4EF6;&#xFF0C;&#x8FDB;&#x884C;&#x626B;&#x63CF;&#x548C;&#x5B58;&#x50A8;&#x90FD;&#x6709;&#x5F88;&#x5927;&#x7684;&#x65F6;&#x95F4;&#x548C;&#x7A7A;&#x95F4;&#x4E0A;&#x7684;&#x5F00; &#x9500;&#xFF0C;&#x4E3A;&#x4E86;&#x4ECE;&#x65F6;&#x95F4;&#x548C;&#x7A7A;&#x95F4;&#x4E0A;&#x63D0;&#x5347;&#x6027;&#x80FD;&#xFF0C;&#x6545;&#x9009;&#x7528; BloomFilter &#x4F5C;&#x4E3A;&#x4E0A;&#x4E00;&#x6B21;&#x722C;&#x53D6;&#x6570;&#x636E;&#x7684;&#x4FDD;&#x5B58;&#x3002;&#x4FDD;&#x5B58; &#x7684;&#x7279;&#x5F81;&#x6570;&#x636E;&#x53EF;&#x4EE5;&#x662F;&#x6570;&#x636E;&#x7684;&#x67D0;&#x51E0;&#x9879;&#xFF0C;&#x5373;&#x76D1;&#x63A7;&#x8FD9;&#x51E0;&#x9879;&#x6570;&#x636E;&#xFF0C;&#x4E00;&#x65E6;&#x8FD9;&#x51E0;&#x9879;&#x6570;&#x636E;&#x6709;&#x53D8;&#x5316;&#xFF0C;&#x4FBF;&#x89C6;&#x4E3A;&#x589E; &#x91CF;&#x6301;&#x4E45;&#x5316;&#x4E0B;&#x6765;&#xFF0C;&#x6839;&#x636E;&#x589E;&#x91CF;&#x7684;&#x89C4;&#x5219;&#x53EF;&#x4EE5;&#x5BF9;&#x4FDD;&#x5B58;&#x7684;&#x72B6;&#x6001;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x7EA6;&#x675F;&#x3002;&#x6BD4;&#x5982;&#xFF1A;&#x53EF;&#x4EE5;&#x9009;&#x7F51;&#x9875;&#x66F4;&#x65B0; &#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x7D22;&#x5F15;&#x6B21;&#x6570;&#x6216;&#x662F;&#x7F51;&#x9875;&#x7684;&#x5B9E;&#x9645;&#x5185;&#x5BB9;&#xFF0C;cookie &#x7684;&#x66F4;&#x65B0;&#x7B49;&#x3002;</p>
<h2 id="&#x722C;&#x53D6;&#x4E0B;&#x6765;&#x7684;&#x6570;&#x636E;&#x5982;&#x4F55;&#x53BB;&#x91CD;&#xFF0C;&#x8BF4;&#x4E00;&#x4E0B;&#x5177;&#x4F53;&#x7684;&#x7B97;&#x6CD5;&#x4F9D;&#x636E;">&#x722C;&#x53D6;&#x4E0B;&#x6765;&#x7684;&#x6570;&#x636E;&#x5982;&#x4F55;&#x53BB;&#x91CD;&#xFF0C;&#x8BF4;&#x4E00;&#x4E0B;&#x5177;&#x4F53;&#x7684;&#x7B97;&#x6CD5;&#x4F9D;&#x636E;</h2>
<p>1.&#x901A;&#x8FC7; MD5 &#x751F;&#x6210;&#x7535;&#x5B50;&#x6307;&#x7EB9;&#x6765;&#x5224;&#x65AD;&#x9875;&#x9762;&#x662F;&#x5426;&#x6539;&#x53D8; 2.nutch &#x53BB;&#x91CD;&#x3002;nutch &#x4E2D; digest &#x662F;&#x5BF9;&#x91C7;&#x96C6;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x7F51;&#x9875;&#x5185;&#x5BB9;&#x7684; 32 &#x4F4D;&#x54C8;&#x5E0C;&#x503C;&#xFF0C;&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x7F51;&#x9875;&#x5185;&#x5BB9;&#x5B8C; &#x5168;&#x4E00;&#x6837;&#xFF0C;&#x5B83;&#x4EEC;&#x7684; digest &#x503C;&#x80AF;&#x5B9A;&#x4F1A;&#x4E00;&#x6837;&#x3002;</p>
<p>&#x6570;&#x636E;&#x91CF;&#x4E0D;&#x5927;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x653E;&#x5728;&#x5185;&#x5B58;&#x91CC;&#x9762;&#x8FDB;&#x884C;&#x53BB;&#x91CD;&#xFF0C;python &#x53EF;&#x4EE5;&#x4F7F;&#x7528; set()&#x8FDB;&#x884C;&#x53BB;&#x91CD;&#x3002;&#x5F53;&#x53BB;&#x91CD;&#x6570;&#x636E; &#x9700;&#x8981;&#x6301;&#x4E45;&#x5316;&#x65F6;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; redis &#x7684; set &#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;</p>
<p>&#x5F53;&#x6570;&#x636E;&#x91CF;&#x518D;&#x5927;&#x4E00;&#x70B9;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#x5148;&#x5C06;&#x957F;&#x5B57;&#x7B26;&#x4E32;&#x538B;&#x7F29;&#x6210; 16/32/40 &#x4E2A;&#x5B57;&#x7B26;&#xFF0C;&#x518D;&#x4F7F;&#x7528; &#x4E0A;&#x9762;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;&#x53BB;&#x91CD;&#x3002; &#x5F53;&#x6570;&#x636E;&#x91CF;&#x8FBE;&#x5230;&#x4EBF;&#xFF08;&#x751A;&#x81F3;&#x5341;&#x4EBF;&#x3001;&#x767E;&#x4EBF;&#xFF09;&#x6570;&#x91CF;&#x7EA7;&#x65F6;&#xFF0C;&#x5185;&#x5B58;&#x6709;&#x9650;&#xFF0C;&#x5FC5;&#x987B;&#x7528;&#x201C;&#x4F4D;&#x201D;&#x6765;&#x53BB;&#x91CD;&#xFF0C;&#x624D;&#x80FD;&#x591F;&#x6EE1;&#x8DB3;&#x9700; &#x6C42;&#x3002;Bloomfilter &#x5C31;&#x662F;&#x5C06;&#x53BB;&#x91CD;&#x5BF9;&#x8C61;&#x6620;&#x5C04;&#x5230;&#x51E0;&#x4E2A;&#x5185;&#x5B58;&#x201C;&#x4F4D;&#x201D;&#xFF0C;&#x901A;&#x8FC7;&#x51E0;&#x4E2A;&#x4F4D;&#x7684; 0/1 &#x503C;&#x6765;&#x5224;&#x65AD;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x662F; &#x5426;&#x5DF2;&#x7ECF;&#x5B58;&#x5728;&#x3002; &#x7136;&#x800C; Bloomfilter &#x8FD0;&#x884C;&#x5728;&#x4E00;&#x53F0;&#x673A;&#x5668;&#x7684;&#x5185;&#x5B58;&#x4E0A;&#xFF0C;&#x4E0D;&#x65B9;&#x4FBF;&#x6301;&#x4E45;&#x5316;&#xFF08;&#x673A;&#x5668; down &#x6389;&#x5C31;&#x4EC0;&#x4E48;&#x90FD;&#x6CA1;&#x5566;&#xFF09;&#xFF0C;&#x4E5F;&#x4E0D; &#x65B9;&#x4FBF;&#x5206;&#x5E03;&#x5F0F;&#x722C;&#x866B;&#x7684;&#x7EDF;&#x4E00;&#x53BB;&#x91CD;&#x3002;&#x5982;&#x679C;&#x53EF;&#x4EE5;&#x5728; Redis &#x4E0A;&#x7533;&#x8BF7;&#x5185;&#x5B58;&#x8FDB;&#x884C; Bloomfilter&#xFF0C;&#x4EE5;&#x4E0A;&#x4E24;&#x4E2A;&#x95EE;&#x9898;&#x5C31;&#x90FD;&#x80FD;&#x89E3; &#x51B3;&#x4E86;&#x3002; simhash &#x6700;&#x725B;&#x903C;&#x7684;&#x4E00;&#x70B9;&#x5C31;&#x662F;&#x5C06;&#x4E00;&#x4E2A;&#x6587;&#x6863;&#xFF0C;&#x6700;&#x540E;&#x8F6C;&#x6362;&#x6210;&#x4E00;&#x4E2A; 64 &#x4F4D;&#x7684;&#x5B57;&#x8282;&#xFF0C;&#x6682;&#x4E14;&#x79F0;&#x4E4B;&#x4E3A;&#x7279;&#x5F81;&#x5B57;&#xFF0C;&#x7136;&#x540E; &#x5224;&#x65AD;&#x91CD;&#x590D;&#x53EA;&#x9700;&#x8981;&#x5224;&#x65AD;&#x4ED6;&#x4EEC;&#x7684;&#x7279;&#x5F81;&#x5B57;&#x7684;&#x8DDD;&#x79BB;&#x662F;&#x4E0D;&#x662F;</p>
<h2 id="scrapy-&#x7684;&#x4F18;&#x7F3A;&#x70B9;">Scrapy &#x7684;&#x4F18;&#x7F3A;&#x70B9;?</h2>
<p><strong>&#x4F18;&#x70B9;&#xFF1A;</strong> </p>
<p>1&#xFF09;scrapy &#x662F;&#x5F02;&#x6B65;&#x7684; </p>
<p>2&#xFF09;&#x91C7;&#x53D6;&#x53EF;&#x8BFB;&#x6027;&#x66F4;&#x5F3A;&#x7684; xpath &#x4EE3;&#x66FF;&#x6B63;&#x5219; </p>
<p>3&#xFF09;&#x5F3A;&#x5927;&#x7684;&#x7EDF;&#x8BA1;&#x548C; log &#x7CFB;&#x7EDF; </p>
<p>4&#xFF09;&#x540C;&#x65F6;&#x5728;&#x4E0D;&#x540C;&#x7684; url &#x4E0A;&#x722C;&#x884C;</p>
<p> 5&#xFF09;&#x652F;&#x6301; shell &#x65B9;&#x5F0F;&#xFF0C;&#x65B9;&#x4FBF;&#x72EC;&#x7ACB;&#x8C03;&#x8BD5; </p>
<p>5&#xFF09;&#x5199; middleware,&#x65B9;&#x4FBF;&#x5199;&#x4E00;&#x4E9B;&#x7EDF;&#x4E00;&#x7684;&#x8FC7;&#x6EE4;&#x5668; </p>
<p>6&#xFF09;&#x901A;&#x8FC7;&#x7BA1;&#x9053;&#x7684;&#x65B9;&#x5F0F;&#x5B58;&#x5165;&#x6570;&#x636E;&#x5E93; </p>
<p><strong>&#x7F3A;&#x70B9;&#xFF1A;</strong> </p>
<p>1&#xFF09;&#x57FA;&#x4E8E; python &#x7684;&#x722C;&#x866B;&#x6846;&#x67B6;&#xFF0C;&#x6269;&#x5C55;&#x6027;&#x6BD4;&#x8F83;&#x5DEE;</p>
<p> 2&#xFF09;&#x57FA;&#x4E8E; twisted &#x6846;&#x67B6;&#xFF0C;&#x8FD0;&#x884C;&#x4E2D;&#x7684; exception &#x662F;&#x4E0D;&#x4F1A;&#x5E72;&#x6389; reactor&#xFF08;&#x53CD;&#x5E94;&#x5668;&#xFF09;&#xFF0C;&#x5E76;&#x4E14;&#x5F02;&#x6B65;&#x6846;&#x67B6;&#x51FA;&#x9519;&#x540E; &#x662F;&#x4E0D;&#x4F1A;&#x505C;&#x6389;&#x5176;&#x4ED6;&#x4EFB;&#x52A1;&#x7684;&#xFF0C;&#x6570;&#x636E;&#x51FA;&#x9519;&#x540E;&#x96BE;&#x4EE5;&#x5BDF;&#x89C9;&#x3002;</p>
<h2 id="&#x600E;&#x4E48;&#x8BBE;&#x7F6E;&#x6DF1;&#x5EA6;&#x722C;&#x53D6;">&#x600E;&#x4E48;&#x8BBE;&#x7F6E;&#x6DF1;&#x5EA6;&#x722C;&#x53D6;?</h2>
<p>&#x901A;&#x8FC7;&#x5728; settings.py &#x4E2D;&#x8BBE;&#x7F6E; depth_limit &#x7684;&#x503C;&#x53EF;&#x4EE5;&#x9650;&#x5236;&#x722C;&#x53D6;&#x6DF1;&#x5EA6;&#xFF0C;&#x8FD9;&#x4E2A;&#x6DF1;&#x5EA6;&#x662F;&#x4E0E; start_urls &#x4E2D; &#x5B9A;&#x4E49;url &#x7684;&#x76F8;&#x5BF9;&#x503C;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x76F8;&#x5BF9; url &#x7684;&#x6DF1;&#x5EA6;&#x3002;&#x82E5;&#x5B9A;&#x4E49; url &#x4E3A;<a href="http://www.domz.com/game/,depth_limit=1" target="_blank">http://www.domz.com/game/,depth_limit=1 </a>&#x90A3;&#x4E48;&#x9650;&#x5236;&#x722C;&#x53D6;&#x7684;&#x53EA;&#x80FD;&#x662F;&#x6B64; url &#x4E0B;&#x4E00;&#x7EA7;&#x7684;&#x7F51;&#x9875;&#x3002;&#x6DF1; &#x5EA6;&#x5927;&#x4E8E;&#x8BBE;&#x7F6E;&#x503C;&#x7684;&#x5C06;&#x88AB;&#x5FFD;&#x89C6;&#x3002;</p>
<h2 id="scrapy-&#x548C;-scrapy-redis-&#x6709;&#x4EC0;&#x4E48;&#x533A;&#x522B;&#xFF1F;&#x4E3A;&#x4EC0;&#x4E48;&#x9009;&#x62E9;-redis-&#x6570;&#x636E;&#x5E93;&#xFF1F;">scrapy &#x548C; scrapy-redis &#x6709;&#x4EC0;&#x4E48;&#x533A;&#x522B;&#xFF1F;&#x4E3A;&#x4EC0;&#x4E48;&#x9009;&#x62E9; redis &#x6570;&#x636E;&#x5E93;&#xFF1F;</h2>
<p>scrapy &#x662F;&#x4E00;&#x4E2A; Python &#x722C;&#x866B;&#x6846;&#x67B6;&#xFF0C;&#x722C;&#x53D6;&#x6548;&#x7387;&#x6781;&#x9AD8;&#xFF0C;&#x5177;&#x6709;&#x9AD8;&#x5EA6;&#x5B9A;&#x5236;&#x6027;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x652F;&#x6301;&#x5206;&#x5E03;&#x5F0F;&#x3002;&#x800C; scrapy-redis &#x4E00;&#x5957;&#x57FA;&#x4E8E; redis &#x6570;&#x636E;&#x5E93;&#x3001;&#x8FD0;&#x884C;&#x5728; scrapy &#x6846;&#x67B6;&#x4E4B;&#x4E0A;&#x7684;&#x7EC4;&#x4EF6;&#xFF0C;&#x53EF;&#x4EE5;&#x8BA9; scrapy &#x652F;&#x6301;&#x5206;&#x5E03;&#x5F0F;&#x7B56;&#x7565;&#xFF0C; Slaver &#x7AEF;&#x5171;&#x4EAB; Master &#x7AEF; redis &#x6570;&#x636E;&#x5E93;&#x91CC;&#x7684; item &#x961F;&#x5217;&#x3001;&#x8BF7;&#x6C42;&#x961F;&#x5217;&#x548C;&#x8BF7;&#x6C42;&#x6307;&#x7EB9;&#x96C6;&#x5408;&#x3002; &#x4E3A;&#x4EC0;&#x4E48;&#x9009;&#x62E9; redis &#x6570;&#x636E;&#x5E93;&#xFF0C;&#x56E0;&#x4E3A; redis &#x652F;&#x6301;&#x4E3B;&#x4ECE;&#x540C;&#x6B65;&#xFF0C;&#x800C;&#x4E14;&#x6570;&#x636E;&#x90FD;&#x662F;&#x7F13;&#x5B58;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x57FA;&#x4E8E; redis &#x7684;&#x5206;&#x5E03;&#x5F0F;&#x722C;&#x866B;&#xFF0C;&#x5BF9;&#x8BF7;&#x6C42;&#x548C;&#x6570;&#x636E;&#x7684;&#x9AD8;&#x9891;&#x8BFB;&#x53D6;&#x6548;&#x7387;&#x975E;&#x5E38;&#x9AD8;</p>
<h2 id="&#x5206;&#x5E03;&#x5F0F;&#x722C;&#x866B;&#x4E3B;&#x8981;&#x89E3;&#x51B3;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#xFF1F;">&#x5206;&#x5E03;&#x5F0F;&#x722C;&#x866B;&#x4E3B;&#x8981;&#x89E3;&#x51B3;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#xFF1F;</h2>
<p>1.ip 2.&#x5E26;&#x5BBD; 3.cpu 4.io</p>
<h2 id="&#x4EC0;&#x4E48;&#x662F;&#x5206;&#x5E03;&#x5F0F;&#x5B58;&#x50A8;&#xFF1F;">&#x4EC0;&#x4E48;&#x662F;&#x5206;&#x5E03;&#x5F0F;&#x5B58;&#x50A8;&#xFF1F;</h2>
<p>&#x4F20;&#x7EDF;&#x5B9A;&#x4E49;&#xFF1A;&#x5206;&#x5E03;&#x5F0F;&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#x662F;&#x5927;&#x91CF; PC &#x670D;&#x52A1;&#x5668;&#x901A;&#x8FC7; Internet &#x4E92;&#x8054;&#xFF0C;&#x5BF9;&#x5916;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x6574;&#x4F53;&#x7684;&#x670D;&#x52A1;&#x3002;</p>
<p>&#x5206;&#x5E03;&#x5F0F;&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#x5177;&#x6709;&#x4EE5;&#x4E0B;&#x7684;&#x51E0;&#x4E2A;&#x7279;&#x6027;&#xFF1A;</p>
<p>&#x53EF;&#x6269;&#x5C55;&#xFF1A; </p>
<p>&#x5206;&#x5E03;&#x5F0F;&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x6269;&#x5C55;&#x5230;&#x51E0;&#x767E;&#x53F0;&#x751A;&#x81F3;&#x51E0;&#x5343;&#x53F0;&#x8FD9;&#x6837;&#x7684;&#x4E00;&#x4E2A;&#x96C6;&#x7FA4;&#x89C4;&#x6A21;&#xFF0C;&#x7CFB;&#x7EDF;&#x7684; &#x6574;&#x4F53;&#x6027;&#x80FD;&#x7EBF;&#x6027;&#x589E;&#x957F;&#x3002; </p>
<p>&#x4F4E;&#x6210;&#x672C; &#xFF1A; </p>
<p>&#x5206;&#x5E03;&#x5F0F;&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#x7684;&#x81EA;&#x52A8;&#x5BB9;&#x9519;&#x3001;&#x81EA;&#x52A8;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x5141;&#x8BB8;&#x5206;&#x5E03;&#x5F0F;&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#x53EF; &#x4EE5;&#x6784;&#x5EFA;&#x5728;&#x4F4E;&#x6210;&#x672C;&#x7684;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x7EBF;&#x6027;&#x7684;&#x6269;&#x5C55;&#x80FD;&#x529B;&#x4E5F;&#x4F7F;&#x5F97;&#x589E;&#x52A0;&#x3001;&#x51CF;&#x5C11;&#x670D;&#x52A1;&#x5668;&#x7684;&#x6210;&#x672C;&#x4F4E;&#xFF0C; &#x5B9E;&#x73B0;&#x5206;&#x5E03;&#x5F0F;&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#x7684;&#x81EA;&#x52A8;&#x8FD0;&#x7EF4;&#x3002; </p>
<p>&#x9AD8;&#x6027;&#x80FD; &#xFF1A; </p>
<p>&#x65E0;&#x8BBA;&#x662F;&#x9488;&#x5BF9;&#x5355;&#x53F0;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x8FD8;&#x662F;&#x9488;&#x5BF9;&#x6574;&#x4E2A;&#x5206;&#x5E03;&#x5F0F;&#x7684;&#x5B58;&#x50A8;&#x96C6;&#x7FA4;&#xFF0C;&#x90FD;&#x8981;&#x6C42;&#x5206;&#x5E03;&#x5F0F;&#x5B58; &#x50A8;&#x7CFB;&#x7EDF;&#x5177;&#x5907;&#x9AD8;&#x6027;&#x80FD;&#x3002; </p>
<p>&#x6613;&#x7528; &#xFF1A; </p>
<p>&#x5206;&#x5E03;&#x5F0F;&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#x9700;&#x8981;&#x5BF9;&#x5916;&#x63D0;&#x4F9B;&#x65B9;&#x4FBF;&#x6613;&#x7528;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x53E6;&#x5916;&#xFF0C;&#x4E5F;&#x9700;&#x8981;&#x5177;&#x5907;&#x5B8C;&#x5584;&#x7684;&#x76D1; &#x63A7;&#x3001;&#x8FD0;&#x7EF4;&#x5DE5;&#x5177;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x65B9;&#x4FBF;&#x7684;&#x4E0E;&#x5176;&#x4ED6;&#x7684;&#x7CFB;&#x7EDF;&#x8FDB;&#x884C;&#x96C6;&#x6210;&#x3002; &#x5E03;&#x5F0F;&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#x7684;&#x6311;&#x6218;&#x4E3B;&#x8981;&#x5728;&#x4E8E;&#x6570;&#x636E;&#x548C;&#x72B6;&#x6001;&#x4FE1;&#x606F;&#x7684;&#x6301;&#x4E45;&#x5316;&#xFF0C;&#x8981;&#x6C42;&#x5728;&#x81EA;&#x52A8;&#x8FC1;&#x79FB;&#x3001;&#x81EA;&#x52A8;&#x5BB9; &#x9519;&#x548C;&#x5E76;&#x53D1;&#x8BFB;&#x5199;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x4FDD;&#x8BC1;&#x6570;&#x636E;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x3002; </p>
<p>&#x5BB9;&#x9519;&#xFF1A; </p>
<p>&#x53EF;&#x4EE5;&#x5FEB;&#x901F;&#x68C0;&#x6D4B;&#x5230;&#x670D;&#x52A1;&#x5668;&#x6545;&#x969C;&#xFF0C;&#x5E76;&#x81EA;&#x52A8;&#x7684;&#x5C06;&#x5728;&#x6545;&#x969C;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x7684;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x8FC1;&#x79FB;&#x3002; &#x8D1F;&#x8F7D;&#x5747;&#x8861;&#xFF1A;&#x65B0;&#x589E;&#x7684;&#x670D;&#x52A1;&#x5668;&#x5728;&#x96C6;&#x7FA4;&#x4E2D;&#x4FDD;&#x969C;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#xFF1F;&#x6570;&#x636E;&#x8FC1;&#x79FB;&#x8FC7;&#x7A0B;&#x4E2D;&#x4FDD;&#x969C;&#x4E0D;&#x5F71;&#x54CD;&#x73B0;&#x6709;&#x7684;&#x670D;&#x52A1;&#x3002; </p>
<p>&#x4E8B;&#x52A1;&#x4E0E;&#x5E76;&#x53D1;&#x63A7;&#x5236;&#xFF1A;&#x5B9E;&#x73B0;&#x5206;&#x5E03;&#x5F0F;&#x4E8B;&#x52A1;&#x3002; </p>
<p>&#x6613;&#x7528;&#x6027;&#xFF1A;&#x8BBE;&#x8BA1;&#x5BF9;&#x5916;&#x63A5;&#x53E3;&#xFF0C;&#x4F7F;&#x5F97;&#x8BBE;&#x8BA1;&#x7684;&#x7CFB;&#x7EDF;&#x6613;&#x4E8E;&#x4F7F;&#x7528;&#x3002; </p>
<h2 id="&#x4F60;&#x6240;&#x77E5;&#x9053;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x722C;&#x866B;&#x65B9;&#x6848;&#x6709;&#x54EA;&#x4E9B;&#xFF1F;">&#x4F60;&#x6240;&#x77E5;&#x9053;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x722C;&#x866B;&#x65B9;&#x6848;&#x6709;&#x54EA;&#x4E9B;&#xFF1F;</h2>
<h3 id="&#x4E09;&#x79CD;&#x5206;&#x5E03;&#x5F0F;&#x722C;&#x866B;&#x7B56;&#x7565;&#xFF1A;">&#x4E09;&#x79CD;&#x5206;&#x5E03;&#x5F0F;&#x722C;&#x866B;&#x7B56;&#x7565;&#xFF1A;</h3>
<p>1.Slaver &#x7AEF;&#x4ECE; Master &#x7AEF;&#x62FF;&#x4EFB;&#x52A1;&#xFF08;Request/url/ID&#xFF09;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x6293;&#x53D6;&#xFF0C;&#x5728;&#x6293;&#x53D6;&#x6570;&#x636E;&#x7684;&#x540C;&#x65F6;&#x4E5F; &#x751F;&#x6210;&#x65B0;&#x4EFB;&#x52A1;&#xFF0C;&#x5E76;&#x5C06;&#x4EFB;&#x52A1;&#x629B;&#x7ED9; Master&#x3002;Master &#x7AEF;&#x53EA;&#x6709;&#x4E00;&#x4E2A; Redis &#x6570;&#x636E;&#x5E93;&#xFF0C;&#x8D1F;&#x8D23;&#x5BF9; Slaver &#x63D0;&#x4EA4; &#x7684;&#x4EFB;&#x52A1;&#x8FDB;&#x884C;&#x53BB;&#x91CD;&#x3001;&#x52A0;&#x5165;&#x5F85;&#x722C;&#x961F;&#x5217;&#x3002; </p>
<p>&#x4F18;&#x70B9;&#xFF1A; scrapy-redis &#x9ED8;&#x8BA4;&#x4F7F;&#x7528;&#x7684;&#x5C31;&#x662F;&#x8FD9;&#x79CD;&#x7B56;&#x7565;&#xFF0C;&#x6211;&#x4EEC;&#x5B9E;&#x73B0;&#x8D77;&#x6765;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x56E0;&#x4E3A;&#x4EFB;&#x52A1;&#x8C03;&#x5EA6; &#x7B49;&#x5DE5;&#x4F5C; scrapy-redis &#x90FD;&#x5DF2;&#x7ECF;&#x5E2E;&#x6211;&#x4EEC;&#x505A;&#x597D;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x7EE7;&#x627F; RedisSpider&#x3001;&#x6307;&#x5B9A; redis_key &#x5C31; &#x884C;&#x4E86;&#x3002; &#x7F3A;&#x70B9;&#xFF1A; scrapy-redis &#x8C03;&#x5EA6;&#x7684;&#x4EFB;&#x52A1;&#x662F; Request &#x5BF9;&#x8C61;&#xFF0C;&#x91CC;&#x9762;&#x4FE1;&#x606F;&#x91CF;&#x6BD4;&#x8F83;&#x5927;&#xFF08;&#x4E0D;&#x4EC5;&#x5305;&#x542B; url&#xFF0C;&#x8FD8;&#x6709; callback &#x51FD;&#x6570;&#x3001;headers &#x7B49;&#x4FE1;&#x606F;&#xFF09;&#xFF0C;&#x5BFC;&#x81F4;&#x7684;&#x7ED3;&#x679C;&#x5C31;&#x662F;&#x4F1A;&#x964D;&#x4F4E;&#x722C;&#x866B;&#x901F;&#x5EA6;&#x3001;&#x800C;&#x4E14;&#x4F1A;&#x5360;&#x7528; Redis &#x5927;&#x91CF;&#x7684;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x3002;&#x5F53;&#x7136;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x91CD;&#x5199;&#x65B9;&#x6CD5;&#x5B9E;&#x73B0;&#x8C03;&#x5EA6; url &#x6216;&#x8005;&#x7528;&#x6237; ID&#x3002;</p>
<p>2.Master &#x7AEF;&#x8DD1;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x53BB;&#x751F;&#x6210;&#x4EFB;&#x52A1;&#xFF08;Request/url/ID&#xFF09;&#x3002;Master &#x7AEF;&#x8D1F;&#x8D23;&#x7684;&#x662F;&#x751F;&#x4EA7;&#x4EFB;&#x52A1;&#xFF0C; &#x5E76;&#x628A;&#x4EFB;&#x52A1;&#x53BB;&#x91CD;&#x3001;&#x52A0;&#x5165;&#x5230;&#x5F85;&#x722C;&#x961F;&#x5217;&#x3002;Slaver &#x53EA;&#x7BA1;&#x4ECE; Master &#x7AEF;&#x62FF;&#x4EFB;&#x52A1;&#x53BB;&#x722C;&#x3002; </p>
<p>&#x4F18;&#x70B9;&#xFF1A; &#x5C06;&#x751F;&#x6210;&#x4EFB;&#x52A1;&#x548C;&#x6293;&#x53D6;&#x6570;&#x636E;&#x5206;&#x5F00;&#xFF0C;&#x5206;&#x5DE5;&#x660E;&#x786E;&#xFF0C;&#x51CF;&#x5C11;&#x4E86; Master &#x548C; Slaver &#x4E4B;&#x95F4;&#x7684;&#x6570;&#x636E; &#x4EA4;&#x6D41;&#xFF1B;Master &#x7AEF;&#x751F;&#x6210;&#x4EFB;&#x52A1;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x597D;&#x5904;&#x5C31;&#x662F;&#xFF1A;&#x53EF;&#x4EE5;&#x5F88;&#x65B9;&#x4FBF;&#x5730;&#x91CD;&#x5199;&#x5224;&#x91CD;&#x7B56;&#x7565;&#xFF08;&#x5F53;&#x6570;&#x636E;&#x91CF;&#x5927;&#x65F6; &#x4F18;&#x5316;&#x5224;&#x91CD;&#x7684;&#x6027;&#x80FD;&#x548C;&#x901F;&#x5EA6;&#x8FD8;&#x662F;&#x5F88;&#x91CD;&#x8981;&#x7684;&#xFF09;&#x3002; </p>
<p>&#x7F3A;&#x70B9;&#xFF1A; &#x50CF; QQ &#x6216;&#x8005;&#x65B0;&#x6D6A;&#x5FAE;&#x535A;&#x8FD9;&#x79CD;&#x7F51;&#x7AD9;&#xFF0C;&#x53D1;&#x9001;&#x4E00;&#x4E2A;&#x8BF7;&#x6C42;&#xFF0C;&#x8FD4;&#x56DE;&#x7684;&#x5185;&#x5BB9;&#x91CC;&#x9762;&#x53EF;&#x80FD;&#x5305;&#x542B;&#x51E0;&#x5341; &#x4E2A;&#x5F85;&#x722C;&#x7684;&#x7528;&#x6237; ID&#xFF0C;&#x5373;&#x51E0;&#x5341;&#x4E2A;&#x65B0;&#x722C;&#x866B;&#x4EFB;&#x52A1;&#x3002;&#x4F46;&#x6709;&#x4E9B;&#x7F51;&#x7AD9;&#x4E00;&#x4E2A;&#x8BF7;&#x6C42;&#x53EA;&#x80FD;&#x5F97;&#x5230;&#x4E00;&#x4E24;&#x4E2A;&#x65B0;&#x4EFB;&#x52A1;&#xFF0C;&#x5E76; &#x4E14;&#x8FD4;&#x56DE;&#x7684;&#x5185;&#x5BB9;&#x91CC;&#x4E5F;&#x5305;&#x542B;&#x722C;&#x866B;&#x8981;&#x6293;&#x53D6;&#x7684;&#x76EE;&#x6807;&#x4FE1;&#x606F;&#xFF0C;&#x5982;&#x679C;&#x5C06;&#x751F;&#x6210;&#x4EFB;&#x52A1;&#x548C;&#x6293;&#x53D6;&#x4EFB;&#x52A1;&#x5206;&#x5F00;&#x53CD;&#x800C;&#x4F1A;&#x964D;&#x4F4E;&#x722C;&#x866B;&#x6293;&#x53D6;&#x6548;&#x7387;&#x3002;&#x6BD5;&#x7ADF;&#x5E26;&#x5BBD;&#x4E5F;&#x662F;&#x722C;&#x866B;&#x7684;&#x4E00;&#x4E2A;&#x74F6;&#x9888;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x79C9;&#x7740;&#x53D1;&#x9001;&#x5C3D;&#x91CF;&#x5C11;&#x7684;&#x8BF7;&#x6C42;&#x4E3A;&#x539F; &#x5219;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x662F;&#x4E3A;&#x4E86;&#x51CF;&#x8F7B;&#x7F51;&#x7AD9;&#x670D;&#x52A1;&#x5668;&#x7684;&#x538B;&#x529B;&#xFF0C;&#x8981;&#x505A;&#x4E00;&#x53EA;&#x6709;&#x9053;&#x5FB7;&#x7684; Crawler&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x89C6;&#x60C5;&#x51B5;&#x800C; &#x5B9A;&#x3002;</p>
<p>3.Master &#x4E2D;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x96C6;&#x5408;&#xFF0C;&#x5B83;&#x53EA;&#x6709;&#x67E5;&#x8BE2;&#x7684;&#x4F5C;&#x7528;&#x3002;Slaver &#x5728;&#x9047;&#x5230;&#x65B0;&#x4EFB;&#x52A1;&#x65F6;&#x8BE2;&#x95EE; Master &#x6B64; &#x4EFB;&#x52A1;&#x662F;&#x5426;&#x5DF2;&#x722C;&#xFF0C;&#x5982;&#x679C;&#x672A;&#x722C;&#x5219;&#x52A0;&#x5165; Slaver &#x81EA;&#x5DF1;&#x7684;&#x5F85;&#x722C;&#x961F;&#x5217;&#x4E2D;&#xFF0C;Master &#x628A;&#x6B64;&#x4EFB;&#x52A1;&#x8BB0;&#x4E3A;&#x5DF2;&#x722C;&#x3002;&#x5B83; &#x548C;&#x7B56;&#x7565;&#x4E00;&#x6BD4;&#x8F83;&#x50CF;&#xFF0C;&#x4F46;&#x660E;&#x663E;&#x6BD4;&#x7B56;&#x7565;&#x4E00;&#x7B80;&#x5355;&#x3002;&#x7B56;&#x7565;&#x4E00;&#x7684;&#x7B80;&#x5355;&#x662F;&#x56E0;&#x4E3A;&#x6709; scrapy-redis &#x5B9E;&#x73B0;&#x4E86; scheduler &#x4E2D;&#x95F4;&#x4EF6;&#xFF0C;&#x5B83;&#x5E76;&#x4E0D;&#x9002;&#x7528;&#x4E8E;&#x975E; scrapy &#x6846;&#x67B6;&#x7684;&#x722C;&#x866B;&#x3002;</p>
<p> &#x4F18;&#x70B9;&#xFF1A; &#x5B9E;&#x73B0;&#x7B80;&#x5355;&#xFF0C;&#x975E; scrapy &#x6846;&#x67B6;&#x7684;&#x722C;&#x866B;&#x4E5F;&#x9002;&#x7528;&#x3002;Master &#x7AEF;&#x538B;&#x529B;&#x6BD4;&#x8F83;&#x5C0F;&#xFF0C;Master &#x4E0E; Slaver &#x7684;&#x6570;&#x636E;&#x4EA4;&#x6D41;&#x4E5F;&#x4E0D;&#x5927;&#x3002; </p>
<p>&#x7F3A;&#x70B9;&#xFF1A;&#x201C;&#x5065;&#x58EE;&#x6027;&#x201D;&#x4E0D;&#x591F;&#xFF0C;&#x9700;&#x8981;&#x53E6;&#x5916;&#x5B9A;&#x65F6;&#x4FDD;&#x5B58;&#x5F85;&#x722C;&#x961F;&#x5217;&#x4EE5;&#x5B9E;&#x73B0;&#x201C;&#x65AD;&#x70B9;&#x7EED;&#x722C;&#x201D;&#x529F;&#x80FD;&#x3002;&#x5404; Slaver &#x7684;&#x5F85;&#x722C;&#x4EFB;&#x52A1;&#x4E0D;&#x901A;&#x7528;&#x3002; </p>
<p>&#x5982;&#x679C;&#x628A; Slaver &#x6BD4;&#x4F5C;&#x5DE5;&#x4EBA;&#xFF0C;&#x628A; Master &#x6BD4;&#x4F5C;&#x5DE5;&#x5934;&#x3002;</p>
<p>&#x7B56;&#x7565;&#x4E00;&#x5C31;&#x662F;&#x5DE5;&#x4EBA;&#x9047;&#x5230;&#x65B0;&#x4EFB;&#x52A1;&#x90FD;&#x4E0A;&#x62A5;&#x7ED9;&#x5DE5;&#x5934;&#xFF0C;&#x9700;&#x8981; &#x5E72;&#x6D3B;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x53BB;&#x5DE5;&#x5934;&#x90A3;&#x91CC;&#x9886;&#x4EFB;&#x52A1;&#xFF1B;</p>
<p>&#x7B56;&#x7565;&#x4E8C;&#x5C31;&#x662F;&#x5DE5;&#x5934;&#x53BB;&#x627E;&#x65B0;&#x4EFB;&#x52A1;&#xFF0C;&#x5DE5;&#x4EBA;&#x53EA;&#x7BA1;&#x4ECE;&#x5DE5;&#x5934;&#x90A3;&#x91CC;&#x9886;&#x4EFB;&#x52A1;&#x5E72;&#x6D3B;&#xFF1B;</p>
<p>&#x7B56;&#x7565; &#x4E09;&#x5C31;&#x662F;&#x5DE5;&#x4EBA;&#x9047;&#x5230;&#x65B0;&#x4EFB;&#x52A1;&#x65F6;&#x8BE2;&#x95EE;&#x5DE5;&#x5934;&#x6B64;&#x4EFB;&#x52A1;&#x662F;&#x5426;&#x6709;&#x4EBA;&#x505A;&#x4E86;&#xFF0C;&#x6CA1;&#x6709;&#x7684;&#x8BDD;&#x5DE5;&#x4EBA;&#x5C31;&#x5C06;&#x6B64;&#x4EFB;&#x52A1;&#x52A0;&#x5230;&#x81EA;&#x5DF1;&#x7684;&#x201C;&#x884C;&#x7A0B;&#x8868;&#x201D;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="数据结构与算法.html" class="navigation navigation-prev " aria-label="Previous page: 数据结构与算法">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="网络协议.html" class="navigation navigation-next " aria-label="Next page: 网络协议">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"爬虫","level":"1.2.5","depth":2,"next":{"title":"网络协议","level":"1.2.6","depth":2,"path":"part1/网络协议.md","ref":"part1/网络协议.md","articles":[]},"previous":{"title":"数据结构与算法","level":"1.2.4","depth":2,"path":"part1/数据结构与算法.md","ref":"part1/数据结构与算法.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"part1/爬虫.md","mtime":"2020-09-17T02:44:01.921Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-09-17T03:27:10.161Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

