
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>系统编程 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="vue.html" />
    
    
    <link rel="prev" href="网络协议.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="./">
            
                <a href="./">
            
                    
                    开发
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="python高级.html">
            
                <a href="python高级.html">
            
                    
                    python高级
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="数据库.html">
            
                <a href="数据库.html">
            
                    
                    数据库
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="数据类型.html">
            
                <a href="数据类型.html">
            
                    
                    数据类型
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="数据结构与算法.html">
            
                <a href="数据结构与算法.html">
            
                    
                    数据结构与算法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.5" data-path="爬虫.html">
            
                <a href="爬虫.html">
            
                    
                    爬虫
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.6" data-path="网络协议.html">
            
                <a href="网络协议.html">
            
                    
                    网络协议
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2.7" data-path="系统编程.html">
            
                <a href="系统编程.html">
            
                    
                    系统编程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.8" data-path="vue.html">
            
                <a href="vue.html">
            
                    
                    vue
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.9" data-path="线程、进程、协程.html">
            
                <a href="线程、进程、协程.html">
            
                    
                    线程、进程、协程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.10" data-path="linux.html">
            
                <a href="linux.html">
            
                    
                    linux
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.11" data-path="web.html">
            
                <a href="web.html">
            
                    
                    web
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../part2/">
            
                <a href="../part2/">
            
                    
                    网络安全
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../part2/渗透测试.html">
            
                <a href="../part2/渗透测试.html">
            
                    
                    渗透测试
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../part2/等级保护.html">
            
                <a href="../part2/等级保护.html">
            
                    
                    等级保护
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="../part2/风险评估.html">
            
                <a href="../part2/风险评估.html">
            
                    
                    风险评估
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="../part2/应急响应.html">
            
                <a href="../part2/应急响应.html">
            
                    
                    应急响应
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.5" data-path="../part2/安全巡检.html">
            
                <a href="../part2/安全巡检.html">
            
                    
                    安全巡检
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >系统编程</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7CFB;&#x7EDF;&#x7F16;&#x7A0B;">&#x7CFB;&#x7EDF;&#x7F16;&#x7A0B;</h1>
<h2 id="&#x8FDB;&#x7A0B;&#xFF1A;">&#x8FDB;&#x7A0B;&#xFF1A;</h2>
<p>&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x5728;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E0A;&#x7684;&#x4E00;&#x4E2A;&#x5B9E;&#x4F8B;&#xFF0C;&#x5C31;&#x79F0;&#x4E4B;&#x4E3A;&#x8FDB;&#x7A0B;&#x3002;&#x8FDB;&#x7A0B;&#x9700;&#x8981;&#x76F8;&#x5E94;&#x7684;&#x7CFB;&#x7EDF;&#x8D44;&#x6E90;&#xFF1A;&#x5185;&#x5B58;&#x3001;&#x65F6;&#x95F4;&#x7247;&#x3001;pid&#x3002;</p>
<h2 id="&#x8C08;&#x8C08;&#x4F60;&#x5BF9;&#x591A;&#x8FDB;&#x7A0B;&#xFF0C;&#x591A;&#x7EBF;&#x7A0B;&#xFF0C;&#x4EE5;&#x53CA;&#x534F;&#x7A0B;&#x7684;&#x7406;&#x89E3;&#xFF0C;&#x9879;&#x76EE;&#x662F;&#x5426;&#x7528;&#xFF1F;">&#x8C08;&#x8C08;&#x4F60;&#x5BF9;&#x591A;&#x8FDB;&#x7A0B;&#xFF0C;&#x591A;&#x7EBF;&#x7A0B;&#xFF0C;&#x4EE5;&#x53CA;&#x534F;&#x7A0B;&#x7684;&#x7406;&#x89E3;&#xFF0C;&#x9879;&#x76EE;&#x662F;&#x5426;&#x7528;&#xFF1F;</h2>
<p>&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x88AB;&#x95EE;&#x7684;&#x6982;&#x7387;&#x76F8;&#x5F53;&#x4E4B;&#x5927;&#xFF0C;&#x5176;&#x5B9E;&#x591A;&#x7EBF;&#x7A0B;&#xFF0C;&#x591A;&#x8FDB;&#x7A0B;&#xFF0C;&#x5728;&#x5B9E;&#x9645;&#x5F00;&#x53D1;&#x4E2D;&#x7528;&#x5230;&#x7684;&#x5F88;&#x5C11;&#xFF0C;&#x9664;&#x975E;&#x662F;&#x90A3;&#x4E9B;&#x5BF9;&#x9879; &#x76EE;&#x6027;&#x80FD;&#x8981;&#x6C42;&#x7279;&#x522B;&#x9AD8;&#x7684;&#xFF0C;&#x6709;&#x7684;&#x5F00;&#x53D1;&#x5DE5;&#x4F5C;&#x51E0;&#x5E74;&#x4E86;&#xFF0C;&#x4E5F;&#x786E;&#x5B9E;&#x6CA1;&#x7528;&#x8FC7;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x8FD9;&#x4E48;&#x56DE;&#x7B54;&#xFF0C;&#x7ED9;&#x4ED6;&#x626F;&#x626F;&#x4EC0;&#x4E48;&#x662F;&#x8FDB;&#x7A0B;&#xFF0C;&#x7EBF;&#x7A0B;&#xFF08;cpython &#x4E2D;&#x662F;&#x4F2A;&#x591A;&#x7EBF;&#x7A0B;&#xFF09;&#x7684;&#x6982;&#x5FF5;&#x5C31;&#x884C;&#xFF0C;&#x5B9E;&#x5728;&#x4E0D;&#x884C;&#x4F60;&#x5C31;&#x8BF4;&#x4F60;&#x4E4B;&#x524D;&#x5199;&#x8FC7;&#x4E0B;&#x8F7D;&#x6587;&#x4EF6;&#x65F6;&#xFF0C;&#x7528;&#x8FC7;&#x591A;&#x7EBF;&#x7A0B;&#x6280;&#x672F;&#xFF0C; &#x6216;&#x8005;&#x4E1A;&#x4F59;&#x65F6;&#x95F4;&#x7528;&#x8FC7;&#x591A;&#x7EBF;&#x7A0B;&#x5199;&#x722C;&#x866B;&#xFF0C;&#x63D0;&#x5347;&#x6548;&#x7387;&#x3002; &#x8FDB;&#x7A0B;&#xFF1A;&#x4E00;&#x4E2A;&#x8FD0;&#x884C;&#x7684;&#x7A0B;&#x5E8F;&#xFF08;&#x4EE3;&#x7801;&#xFF09;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#xFF0C;&#x6CA1;&#x6709;&#x8FD0;&#x884C;&#x7684;&#x4EE3;&#x7801;&#x53EB;&#x7A0B;&#x5E8F;&#xFF0C;&#x8FDB;&#x7A0B;&#x662F;&#x7CFB;&#x7EDF;&#x8D44;&#x6E90;&#x5206;&#x914D;&#x7684;&#x6700; &#x5C0F;&#x5355;&#x4F4D;&#xFF0C;&#x8FDB;&#x7A0B;&#x62E5;&#x6709;&#x81EA;&#x5DF1;&#x72EC;&#x7ACB;&#x7684;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#xFF0C;&#x6240;&#x4EE5;&#x8FDB;&#x7A0B;&#x95F4;&#x6570;&#x636E;&#x4E0D;&#x5171;&#x4EAB;&#xFF0C;&#x5F00;&#x9500;&#x5927;&#x3002; &#x7EBF;&#x7A0B;&#xFF1A; &#x8C03;&#x5EA6;&#x6267;&#x884C;&#x7684;&#x6700;&#x5C0F;&#x5355;&#x4F4D;&#xFF0C;&#x4E5F;&#x53EB;&#x6267;&#x884C;&#x8DEF;&#x5F84;&#xFF0C;&#x4E0D;&#x80FD;&#x72EC;&#x7ACB;&#x5B58;&#x5728;&#xFF0C;&#x4F9D;&#x8D56;&#x8FDB;&#x7A0B;&#x5B58;&#x5728;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x81F3;&#x5C11;&#x6709;&#x4E00;&#x4E2A; &#x7EBF;&#x7A0B;&#xFF0C;&#x53EB;&#x4E3B;&#x7EBF;&#x7A0B;&#xFF0C;&#x800C;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x5171;&#x4EAB;&#x5185;&#x5B58;(&#x6570;&#x636E;&#x5171;&#x4EAB;&#xFF0C;&#x5171;&#x4EAB;&#x5168;&#x5C40;&#x53D8;&#x91CF;)&#xFF0C;&#x4ECE;&#x800C;&#x6781;&#x5927;&#x5730;&#x63D0;&#x9AD8;&#x4E86;&#x7A0B;&#x5E8F;&#x7684;&#x8FD0;&#x884C;&#x6548;&#x7387;&#x3002; &#x534F;&#x7A0B;&#xFF1A;&#x662F;&#x4E00;&#x79CD;&#x7528;&#x6237;&#x6001;&#x7684;&#x8F7B;&#x91CF;&#x7EA7;&#x7EBF;&#x7A0B;&#xFF0C;&#x534F;&#x7A0B;&#x7684;&#x8C03;&#x5EA6;&#x5B8C;&#x5168;&#x7531;&#x7528;&#x6237;&#x63A7;&#x5236;&#x3002;&#x534F;&#x7A0B;&#x62E5;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x5BC4;&#x5B58;&#x5668;&#x4E0A;&#x4E0B;&#x6587;&#x548C; &#x6808;&#x3002; &#x534F;&#x7A0B;&#x8C03;&#x5EA6;&#x5207;&#x6362;&#x65F6;&#xFF0C;&#x5C06;&#x5BC4;&#x5B58;&#x5668;&#x4E0A;&#x4E0B;&#x6587;&#x548C;&#x6808;&#x4FDD;&#x5B58;&#x5230;&#x5176;&#x4ED6;&#x5730;&#x65B9;&#xFF0C;&#x5728;&#x5207;&#x56DE;&#x6765;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6062;&#x590D;&#x5148;&#x524D;&#x4FDD;&#x5B58;&#x7684;&#x5BC4;&#x5B58; &#x5668;&#x4E0A;&#x4E0B;&#x6587;&#x548C;&#x6808;&#xFF0C;&#x76F4;&#x63A5;&#x64CD;&#x4F5C;&#x6808;&#x5219;&#x57FA;&#x672C;&#x6CA1;&#x6709;&#x5185;&#x6838;&#x5207;&#x6362;&#x7684;&#x5F00;&#x9500;&#xFF0C;&#x53EF;&#x4EE5;&#x4E0D;&#x52A0;&#x9501;&#x7684;&#x8BBF;&#x95EE;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#xFF0C;&#x6240;&#x4EE5;&#x4E0A;&#x4E0B;&#x6587;&#x7684;&#x5207; &#x6362;&#x975E;&#x5E38;&#x5FEB;&#x3002;</p>
<h2 id="&#x4EC0;&#x4E48;&#x662F;&#x591A;&#x7EBF;&#x7A0B;&#x7ADE;&#x4E89;&#xFF1F;">&#x4EC0;&#x4E48;&#x662F;&#x591A;&#x7EBF;&#x7A0B;&#x7ADE;&#x4E89;&#xFF1F;</h2>
<p>&#x7EBF;&#x7A0B;&#x662F;&#x975E;&#x72EC;&#x7ACB;&#x7684;&#xFF0C;&#x540C;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x91CC;&#x7EBF;&#x7A0B;&#x662F;&#x6570;&#x636E;&#x5171;&#x4EAB;&#x7684;&#xFF0C;&#x5F53;&#x5404;&#x4E2A;&#x7EBF;&#x7A0B;&#x8BBF;&#x95EE;&#x6570;&#x636E;&#x8D44;&#x6E90;&#x65F6;&#x4F1A;&#x51FA;&#x73B0;&#x7ADE;&#x4E89;&#x72B6;&#x6001;&#x5373;&#xFF1A;&#x6570;&#x636E;&#x51E0;&#x4E4E;&#x540C;&#x6B65;&#x4F1A;&#x88AB;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x5360;&#x7528;&#xFF0C;&#x9020;&#x6210;&#x6570;&#x636E;&#x6DF7;&#x4E71; &#xFF0C;&#x5373;&#x6240;&#x8C13;&#x7684;&#x7EBF;&#x7A0B;&#x4E0D;&#x5B89;&#x5168; </p>
<p>&#x90A3;&#x4E48;&#x600E;&#x4E48;&#x89E3;&#x51B3;&#x591A;&#x7EBF;&#x7A0B;&#x7ADE;&#x4E89;&#x95EE;&#x9898;&#xFF1F;-- &#x9501;&#x3002; </p>
<p>&#x9501;&#x7684;&#x597D;&#x5904;&#xFF1A; &#x786E;&#x4FDD;&#x4E86;&#x67D0;&#x6BB5;&#x5173;&#x952E;&#x4EE3;&#x7801;(&#x5171;&#x4EAB;&#x6570;&#x636E;&#x8D44;&#x6E90;)&#x53EA;&#x80FD;&#x7531;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x4ECE;&#x5934;&#x5230;&#x5C3E;&#x5B8C;&#x6574;&#x5730;&#x6267;&#x884C;&#x80FD;&#x89E3;&#x51B3;&#x591A;&#x7EBF;&#x7A0B;&#x8D44;&#x6E90;&#x7ADE;&#x4E89;&#x4E0B; &#x7684;&#x539F;&#x5B50;&#x64CD;&#x4F5C;&#x95EE;&#x9898;&#x3002; </p>
<p>&#x9501;&#x7684;&#x574F;&#x5904;&#xFF1A; &#x963B;&#x6B62;&#x4E86;&#x591A;&#x7EBF;&#x7A0B;&#x5E76;&#x53D1;&#x6267;&#x884C;&#xFF0C;&#x5305;&#x542B;&#x9501;&#x7684;&#x67D0;&#x6BB5;&#x4EE3;&#x7801;&#x5B9E;&#x9645;&#x4E0A;&#x53EA;&#x80FD;&#x4EE5;&#x5355;&#x7EBF;&#x7A0B;&#x6A21;&#x5F0F;&#x6267;&#x884C;&#xFF0C;&#x6548;&#x7387;&#x5C31;&#x5927;&#x5927;&#x5730;&#x4E0B;&#x964D;&#x4E86; </p>
<p>&#x9501;&#x7684;&#x81F4;&#x547D;&#x95EE;&#x9898;&#xFF1A;&#x6B7B;&#x9501;&#x3002;</p>
<h2 id="&#x89E3;&#x91CA;&#x4E00;&#x4E0B;&#x4EC0;&#x4E48;&#x662F;&#x9501;&#xFF0C;&#x6709;&#x54EA;&#x51E0;&#x79CD;&#x9501;">&#x89E3;&#x91CA;&#x4E00;&#x4E0B;&#x4EC0;&#x4E48;&#x662F;&#x9501;&#xFF0C;&#x6709;&#x54EA;&#x51E0;&#x79CD;&#x9501;?</h2>
<p>&#x9501;(Lock)&#x662F; Python &#x63D0;&#x4F9B;&#x7684;&#x5BF9;&#x7EBF;&#x7A0B;&#x63A7;&#x5236;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x6709;&#x4E92;&#x65A5;&#x9501;&#x3001;&#x53EF;&#x91CD;&#x5165;&#x9501;&#x3002;</p>
<h2 id="&#x4EC0;&#x4E48;&#x662F;&#x6B7B;&#x9501;&#x5462;&#xFF1F;">&#x4EC0;&#x4E48;&#x662F;&#x6B7B;&#x9501;&#x5462;&#xFF1F;</h2>
<p>&#x82E5;&#x5E72;&#x5B50;&#x7EBF;&#x7A0B;&#x5728;&#x7CFB;&#x7EDF;&#x8D44;&#x6E90;&#x7ADE;&#x4E89;&#x65F6;&#xFF0C;&#x90FD;&#x5728;&#x7B49;&#x5F85;&#x5BF9;&#x65B9;&#x5BF9;&#x67D0;&#x90E8;&#x5206;&#x8D44;&#x6E90;&#x89E3;&#x9664;&#x5360;&#x7528;&#x72B6;&#x6001;&#xFF0C;&#x7ED3;&#x679C;&#x662F;&#x8C01;&#x4E5F;&#x4E0D;&#x613F;&#x5148;&#x89E3;&#x9501;&#xFF0C;&#x4E92;&#x76F8;&#x5E72;&#x7B49;&#x7740;&#xFF0C;&#x7A0B;&#x5E8F;&#x65E0;&#x6CD5;&#x6267;&#x884C;&#x4E0B;&#x53BB;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x6B7B;&#x9501;&#x3002; </p>
<p>GIL &#x9501;&#xFF08;&#x6709;&#x65F6;&#x5019;&#xFF0C;&#x9762;&#x8BD5;&#x5B98;&#x4E0D;&#x95EE;&#xFF0C;&#x4F60;&#x81EA;&#x5DF1;&#x8981;&#x4E3B;&#x52A8;&#x8BF4;&#xFF0C;&#x589E;&#x52A0; b &#x683C;&#xFF0C;&#x5C3D;&#x91CF;&#x522B;&#x4E00;&#x95EE;&#x4E00;&#x7B54;&#x7684;&#x5C2C;&#x804A;&#xFF0C;&#x4E0D;&#x7136;&#x6700;&#x540E;&#x7B49; &#x5230;&#x7684;&#x4E00;&#x53E5;&#x8BDD;&#x5C31;&#x662F;&#xFF1A;&#x4F60;&#x8FD8;&#x6709;&#x4EC0;&#x4E48;&#x60F3;&#x95EE;&#x7684;&#x4E48;&#xFF1F;&#xFF09; </p>
<p>GIL &#x9501; &#x5168;&#x5C40;&#x89E3;&#x91CA;&#x5668;&#x9501;&#xFF08;&#x53EA;&#x5728; cpython &#x91CC;&#x624D;&#x6709;&#xFF09; &#x4F5C;&#x7528;&#xFF1A;&#x9650;&#x5236;&#x591A;&#x7EBF;&#x7A0B;&#x540C;&#x65F6;&#x6267;&#x884C;&#xFF0C;&#x4FDD;&#x8BC1;&#x540C;&#x4E00;&#x65F6;&#x95F4;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x6267;&#x884C;&#xFF0C;&#x6240;&#x4EE5; cpython &#x91CC;&#x7684;&#x591A;&#x7EBF;&#x7A0B;&#x5176;&#x5B9E;&#x662F;&#x4F2A; &#x591A;&#x7EBF;&#x7A0B;!</p>
<p>&#x6240;&#x4EE5; Python &#x91CC;&#x5E38;&#x5E38;&#x4F7F;&#x7528;&#x534F;&#x7A0B;&#x6280;&#x672F;&#x6765;&#x4EE3;&#x66FF;&#x591A;&#x7EBF;&#x7A0B;&#xFF0C;&#x534F;&#x7A0B;&#x662F;&#x4E00;&#x79CD;&#x66F4;&#x8F7B;&#x91CF;&#x7EA7;&#x7684;&#x7EBF;&#x7A0B;&#xFF0C; &#x8FDB;&#x7A0B;&#x548C;&#x7EBF;&#x7A0B;&#x7684;&#x5207;&#x6362;&#x65F6;&#x7531;&#x7CFB;&#x7EDF;&#x51B3;&#x5B9A;&#xFF0C;&#x800C;&#x534F;&#x7A0B;&#x7531;&#x6211;&#x4EEC;&#x7A0B;&#x5E8F;&#x5458;&#x81EA;&#x5DF1;&#x51B3;&#x5B9A;&#xFF0C;&#x800C;&#x6A21;&#x5757; gevent &#x4E0B;&#x5207;&#x6362;&#x662F;&#x9047;&#x5230;&#x4E86; &#x8017;&#x65F6;&#x64CD;&#x4F5C;&#x624D;&#x4F1A;&#x5207;&#x6362;&#x3002; &#x4E09;&#x8005;&#x7684;&#x5173;&#x7CFB;&#xFF1A;&#x8FDB;&#x7A0B;&#x91CC;&#x6709;&#x7EBF;&#x7A0B;&#xFF0C;&#x7EBF;&#x7A0B;&#x91CC;&#x6709;&#x534F;&#x7A0B;&#x3002;</p>
<h2 id="&#x4EC0;&#x4E48;&#x662F;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#xFF0C;&#x4EC0;&#x4E48;&#x662F;&#x4E92;&#x65A5;&#x9501;&#xFF1F;">&#x4EC0;&#x4E48;&#x662F;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#xFF0C;&#x4EC0;&#x4E48;&#x662F;&#x4E92;&#x65A5;&#x9501;&#xFF1F;</h2>
<p>&#x6BCF;&#x4E2A;&#x5BF9;&#x8C61;&#x90FD;&#x5BF9;&#x5E94;&#x4E8E;&#x4E00;&#x4E2A;&#x53EF;&#x79F0;&#x4E3A;&quot; &#x4E92;&#x65A5;&#x9501;&quot; &#x7684;&#x6807;&#x8BB0;&#xFF0C;&#x8FD9;&#x4E2A;&#x6807;&#x8BB0;&#x7528;&#x6765;&#x4FDD;&#x8BC1;&#x5728;&#x4EFB;&#x4E00;&#x65F6;&#x523B;&#xFF0C;&#x53EA;&#x80FD;&#x6709;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B; &#x8BBF;&#x95EE;&#x8BE5;&#x5BF9;&#x8C61;&#x3002; &#x540C;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x4E2D;&#x7684;&#x591A;&#x7EBF;&#x7A0B;&#x4E4B;&#x95F4;&#x662F;&#x5171;&#x4EAB;&#x7CFB;&#x7EDF;&#x8D44;&#x6E90;&#x7684;&#xFF0C;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x540C;&#x65F6;&#x5BF9;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#xFF0C;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x64CD;&#x4F5C; &#x5C1A;&#x672A;&#x7ED3;&#x675F;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x5DF2;&#x7ECF;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#xFF0C;&#x5BFC;&#x81F4;&#x6700;&#x7EC8;&#x7ED3;&#x679C;&#x51FA;&#x73B0;&#x9519;&#x8BEF;&#xFF0C;&#x6B64;&#x65F6;&#x9700;&#x8981;&#x5BF9;&#x88AB;&#x64CD;&#x4F5C;&#x5BF9;&#x8C61;&#x6DFB;&#x52A0;&#x4E92;&#x65A5;&#x9501;&#xFF0C; &#x4FDD;&#x8BC1;&#x6BCF;&#x4E2A;&#x7EBF;&#x7A0B;&#x5BF9;&#x8BE5;&#x5BF9;&#x8C61;&#x7684;&#x64CD;&#x4F5C;&#x90FD;&#x5F97;&#x5230;&#x6B63;&#x786E;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<h2 id="&#x8BF4;&#x8BF4;&#x4E0B;&#x9762;&#x51E0;&#x4E2A;&#x6982;&#x5FF5;&#xFF1A;&#x540C;&#x6B65;&#xFF0C;&#x5F02;&#x6B65;&#xFF0C;&#x963B;&#x585E;&#xFF0C;&#x975E;&#x963B;&#x585E;">&#x8BF4;&#x8BF4;&#x4E0B;&#x9762;&#x51E0;&#x4E2A;&#x6982;&#x5FF5;&#xFF1A;&#x540C;&#x6B65;&#xFF0C;&#x5F02;&#x6B65;&#xFF0C;&#x963B;&#x585E;&#xFF0C;&#x975E;&#x963B;&#x585E;?</h2>
<p>&#x540C;&#x6B65;&#xFF1A;&#x591A;&#x4E2A;&#x4EFB;&#x52A1;&#x4E4B;&#x95F4;&#x6709;&#x5148;&#x540E;&#x987A;&#x5E8F;&#x6267;&#x884C;&#xFF0C;&#x4E00;&#x4E2A;&#x6267;&#x884C;&#x5B8C;&#x4E0B;&#x4E2A;&#x624D;&#x80FD;&#x6267;&#x884C;&#x3002; </p>
<p>&#x5F02;&#x6B65;&#xFF1A;&#x591A;&#x4E2A;&#x4EFB;&#x52A1;&#x4E4B;&#x95F4;&#x6CA1;&#x6709;&#x5148;&#x540E;&#x987A;&#x5E8F;&#xFF0C;&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x6267;&#x884C;&#x6709;&#x65F6;&#x5019;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x53EF;&#x80FD;&#x8981;&#x5728;&#x5FC5;&#x8981;&#x7684;&#x65F6;&#x5019;&#x83B7;&#x53D6;&#x53E6;&#x4E00;&#x4E2A; &#x540C;&#x65F6;&#x6267;&#x884C;&#x7684;&#x4EFB;&#x52A1;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x8FD9;&#x4E2A;&#x5C31;&#x53EB;&#x56DE;&#x8C03;&#xFF01; </p>
<p>&#x963B;&#x585E;&#xFF1A;&#x5982;&#x679C;&#x5361;&#x4F4F;&#x4E86;&#x8C03;&#x7528;&#x8005;&#xFF0C;&#x8C03;&#x7528;&#x8005;&#x4E0D;&#x80FD;&#x7EE7;&#x7EED;&#x5F80;&#x4E0B;&#x6267;&#x884C;&#xFF0C;&#x5C31;&#x662F;&#x8BF4;&#x8C03;&#x7528;&#x8005;&#x963B;&#x585E;&#x4E86;&#x3002; </p>
<p>&#x975E;&#x963B;&#x585E;&#xFF1A;&#x5982;&#x679C;&#x4E0D;&#x4F1A;&#x5361;&#x4F4F;&#xFF0C;&#x53EF;&#x4EE5;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#xFF0C;&#x5C31;&#x662F;&#x8BF4;&#x975E;&#x963B;&#x585E;&#x7684;&#x3002; </p>
<p>&#x540C;&#x6B65;&#x5F02;&#x6B65;&#x76F8;&#x5BF9;&#x4E8E;&#x591A;&#x4EFB;&#x52A1;&#x800C;&#x8A00;&#xFF0C;&#x963B;&#x585E;&#x975E;&#x963B;&#x585E;&#x76F8;&#x5BF9;&#x4E8E;&#x4EE3;&#x7801;&#x6267;&#x884C;&#x800C;&#x8A00;&#x3002;</p>
<h2 id="&#x4EC0;&#x4E48;&#x662F;&#x50F5;&#x5C38;&#x8FDB;&#x7A0B;&#x548C;&#x5B64;&#x513F;&#x8FDB;&#x7A0B;&#xFF1F;&#x600E;&#x4E48;&#x907F;&#x514D;&#x50F5;&#x5C38;&#x8FDB;&#x7A0B;">&#x4EC0;&#x4E48;&#x662F;&#x50F5;&#x5C38;&#x8FDB;&#x7A0B;&#x548C;&#x5B64;&#x513F;&#x8FDB;&#x7A0B;&#xFF1F;&#x600E;&#x4E48;&#x907F;&#x514D;&#x50F5;&#x5C38;&#x8FDB;&#x7A0B;?</h2>
<p>&#x5B64;&#x513F;&#x8FDB;&#x7A0B;&#xFF1A;&#x7236;&#x8FDB;&#x7A0B;&#x9000;&#x51FA;&#xFF0C;&#x5B50;&#x8FDB;&#x7A0B;&#x8FD8;&#x5728;&#x8FD0;&#x884C;&#x7684;&#x8FD9;&#x4E9B;&#x5B50;&#x8FDB;&#x7A0B;&#x90FD;&#x662F;&#x5B64;&#x513F;&#x8FDB;&#x7A0B;&#xFF0C;&#x5B64;&#x513F;&#x8FDB;&#x7A0B;&#x5C06;&#x88AB; init &#x8FDB;&#x7A0B;(&#x8FDB; &#x7A0B;&#x53F7;&#x4E3A; 1)&#x6240;&#x6536;&#x517B;&#xFF0C;&#x5E76;&#x7531; init &#x8FDB;&#x7A0B;&#x5BF9;&#x5B83;&#x4EEC;&#x5B8C;&#x6210;&#x72B6;&#x6001;&#x6536;&#x96C6;&#x5DE5;&#x4F5C;&#x3002;</p>
<p> &#x50F5;&#x5C38;&#x8FDB;&#x7A0B;&#xFF1A;&#x8FDB;&#x7A0B;&#x4F7F;&#x7528; fork &#x521B;&#x5EFA;&#x5B50;&#x8FDB;&#x7A0B;&#xFF0C;&#x5982;&#x679C;&#x5B50;&#x8FDB;&#x7A0B;&#x9000;&#x51FA;&#xFF0C;&#x800C;&#x7236;&#x8FDB;&#x7A0B;&#x5E76;&#x6CA1;&#x6709;&#x8C03;&#x7528; wait &#x6216; waitpid &#x83B7; &#x53D6;&#x5B50;&#x8FDB;&#x7A0B;&#x7684;&#x72B6;&#x6001;&#x4FE1;&#x606F;&#xFF0C;&#x90A3;&#x4E48;&#x5B50;&#x8FDB;&#x7A0B;&#x7684;&#x8FDB;&#x7A0B;&#x63CF;&#x8FF0;&#x7B26;&#x4ECD;&#x7136;&#x4FDD;&#x5B58;&#x5728;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x8FD9;&#x4E9B;&#x8FDB;&#x7A0B;&#x662F;&#x50F5;&#x5C38;&#x8FDB;&#x7A0B;&#x3002;</p>
<p> &#x907F;&#x514D;&#x50F5;&#x5C38;&#x8FDB;&#x7A0B;&#x7684;&#x65B9;&#x6CD5;&#xFF1A;</p>
<p> 1.fork &#x4E24;&#x6B21;&#x7528;&#x5B59;&#x5B50;&#x8FDB;&#x7A0B;&#x53BB;&#x5B8C;&#x6210;&#x5B50;&#x8FDB;&#x7A0B;&#x7684;&#x4EFB;&#x52A1;&#xFF1B;</p>
<p> 2.&#x7528; wait()&#x51FD;&#x6570;&#x4F7F;&#x7236;&#x8FDB;&#x7A0B;&#x963B;&#x585E;&#xFF1B;</p>
<p> 3.&#x4F7F;&#x7528;&#x4FE1;&#x53F7;&#x91CF;&#xFF0C;&#x5728; signal handler &#x4E2D;&#x8C03;&#x7528;waitpid&#xFF0C;&#x8FD9;&#x6837;&#x7236;&#x8FDB;&#x7A0B;&#x4E0D;&#x7528;&#x963B;&#x585E;</p>
<h2 id="python-&#x4E2D;&#x7684;&#x8FDB;&#x7A0B;&#x4E0E;&#x7EBF;&#x7A0B;&#x7684;&#x4F7F;&#x7528;&#x573A;&#x666F;">Python &#x4E2D;&#x7684;&#x8FDB;&#x7A0B;&#x4E0E;&#x7EBF;&#x7A0B;&#x7684;&#x4F7F;&#x7528;&#x573A;&#x666F;?</h2>
<p>&#x591A;&#x8FDB;&#x7A0B;&#x9002;&#x5408;&#x5728; CPU &#x5BC6;&#x96C6;&#x578B;&#x64CD;&#x4F5C;(cpu &#x64CD;&#x4F5C;&#x6307;&#x4EE4;&#x6BD4;&#x8F83;&#x591A;&#xFF0C;&#x5982;&#x4F4D;&#x6570;&#x591A;&#x7684;&#x6D6E;&#x70B9;&#x8FD0;&#x7B97;)&#x3002; &#x591A;&#x7EBF;&#x7A0B;&#x9002;&#x5408;&#x5728; IO &#x5BC6;&#x96C6;&#x578B;&#x64CD;&#x4F5C;(&#x8BFB;&#x5199;&#x6570;&#x636E;&#x64CD;&#x4F5C;&#x8F83;&#x591A;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x722C;&#x866B;)&#x3002;</p>
<h2 id="&#x7EBF;&#x7A0B;&#x662F;&#x5E76;&#x53D1;&#x8FD8;&#x662F;&#x5E76;&#x884C;&#xFF0C;&#x8FDB;&#x7A0B;&#x662F;&#x5E76;&#x53D1;&#x8FD8;&#x662F;&#x5E76;&#x884C;&#xFF1F;">&#x7EBF;&#x7A0B;&#x662F;&#x5E76;&#x53D1;&#x8FD8;&#x662F;&#x5E76;&#x884C;&#xFF0C;&#x8FDB;&#x7A0B;&#x662F;&#x5E76;&#x53D1;&#x8FD8;&#x662F;&#x5E76;&#x884C;&#xFF1F;</h2>
<p>&#x7EBF;&#x7A0B;&#x662F;&#x5E76;&#x53D1;&#xFF0C;&#x8FDB;&#x7A0B;&#x662F;&#x5E76;&#x884C;&#xFF1B; &#x8FDB;&#x7A0B;&#x4E4B;&#x95F4;&#x76F8;&#x4E92;&#x72EC;&#x7ACB;&#xFF0C;&#x662F;&#x7CFB;&#x7EDF;&#x5206;&#x914D;&#x8D44;&#x6E90;&#x7684;&#x6700;&#x5C0F;&#x5355;&#x4F4D;&#xFF0C;&#x540C;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x7EBF;&#x7A0B;&#x5171;&#x4EAB;&#x8D44;&#x6E90;&#x3002;</p>
<h2 id="&#x5E76;&#x884C;&#xFF08;parallel&#xFF09;&#x548C;&#x5E76;&#x53D1;&#xFF08;concurrency&#xFF09;&#xFF1F;">&#x5E76;&#x884C;&#xFF08;parallel&#xFF09;&#x548C;&#x5E76;&#x53D1;&#xFF08;concurrency&#xFF09;&#xFF1F;</h2>
<p>&#x5E76;&#x884C;&#xFF1A;&#x540C;&#x4E00;&#x65F6;&#x523B;&#x591A;&#x4E2A;&#x4EFB;&#x52A1;&#x540C;&#x65F6;&#x5728;&#x8FD0;&#x884C;&#x3002; &#x5E76;&#x53D1;&#xFF1A;&#x5728;&#x540C;&#x4E00;&#x65F6;&#x95F4;&#x95F4;&#x9694;&#x5185;&#x591A;&#x4E2A;&#x4EFB;&#x52A1;&#x90FD;&#x5728;&#x8FD0;&#x884C;&#xFF0C;&#x4F46;&#x662F;&#x5E76;&#x4E0D;&#x4F1A;&#x5728;&#x540C;&#x4E00;&#x65F6;&#x523B;&#x540C;&#x65F6;&#x8FD0;&#x884C;&#xFF0C;&#x5B58;&#x5728;&#x4EA4;&#x66FF;&#x6267;&#x884C;&#x7684;&#x60C5; &#x51B5;&#x3002;</p>
<p>&#x5B9E;&#x73B0;&#x5E76;&#x884C;&#x7684;&#x5E93;&#x6709;&#xFF1A;multiprocessing &#x5B9E;&#x73B0;&#x5E76;&#x53D1;&#x7684;&#x5E93;&#x6709;&#xFF1A;threading &#x7A0B;&#x5E8F;&#x9700;&#x8981;&#x6267;&#x884C;&#x8F83;&#x591A;&#x7684;&#x8BFB;&#x5199;&#x3001;&#x8BF7;&#x6C42;&#x548C;&#x56DE;&#x590D;&#x4EFB;&#x52A1;&#x7684;&#x9700;&#x8981;&#x5927;&#x91CF;&#x7684; IO &#x64CD;&#x4F5C;&#xFF0C;IO &#x5BC6;&#x96C6;&#x578B;&#x64CD;&#x4F5C;&#x4F7F;&#x7528;&#x5E76;&#x53D1;&#x66F4;&#x597D;&#x3002; CPU &#x8FD0;&#x7B97;&#x91CF;&#x5927;&#x7684;&#x7A0B;&#x5E8F;&#x7A0B;&#x5E8F;&#xFF0C;&#x4F7F;&#x7528;&#x5E76;&#x884C;&#x4F1A;&#x66F4;&#x597D;&#x3002;</p>
<h2 id="io-&#x5BC6;&#x96C6;&#x578B;&#x548C;-cpu-&#x5BC6;&#x96C6;&#x578B;&#x533A;&#x522B;&#xFF1F;">IO &#x5BC6;&#x96C6;&#x578B;&#x548C; CPU &#x5BC6;&#x96C6;&#x578B;&#x533A;&#x522B;&#xFF1F;</h2>
<p>IO &#x5BC6;&#x96C6;&#x578B;&#xFF1A;&#x7CFB;&#x7EDF;&#x8FD0;&#x4F5C;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x7684;&#x72B6;&#x51B5;&#x662F; CPU &#x5728;&#x7B49; I/O (&#x786C;&#x76D8;/&#x5185;&#x5B58;)&#x7684;&#x8BFB;/&#x5199;&#x3002;</p>
<p> CPU &#x5BC6;&#x96C6;&#x578B;&#xFF1A;&#x5927;&#x90E8;&#x4EFD;&#x65F6;&#x95F4;&#x7528;&#x6765;&#x505A;&#x8BA1;&#x7B97;&#x3001;&#x903B;&#x8F91;&#x5224;&#x65AD;&#x7B49; CPU &#x52A8;&#x4F5C;&#x7684;&#x7A0B;&#x5E8F;&#x79F0;&#x4E4B; CPU &#x5BC6;&#x96C6;&#x578B;&#x3002;</p>
<h2 id="&#x600E;&#x4E48;&#x5B9E;&#x73B0;&#x5F3A;&#x884C;&#x5173;&#x95ED;&#x5BA2;&#x6237;&#x7AEF;&#x548C;&#x670D;&#x52A1;&#x5668;&#x4E4B;&#x95F4;&#x7684;&#x8FDE;&#x63A5;">&#x600E;&#x4E48;&#x5B9E;&#x73B0;&#x5F3A;&#x884C;&#x5173;&#x95ED;&#x5BA2;&#x6237;&#x7AEF;&#x548C;&#x670D;&#x52A1;&#x5668;&#x4E4B;&#x95F4;&#x7684;&#x8FDE;&#x63A5;?</h2>
<p>&#x5728; socket &#x901A;&#x4FE1;&#x8FC7;&#x7A0B;&#x4E2D;&#x4E0D;&#x65AD;&#x5FAA;&#x73AF;&#x68C0;&#x6D4B;&#x4E00;&#x4E2A;&#x5168;&#x5C40;&#x53D8;&#x91CF;(&#x5F00;&#x5173;&#x6807;&#x8BB0;&#x53D8;&#x91CF;)&#xFF0C;&#x4E00;&#x65E6;&#x6807;&#x8BB0;&#x53D8;&#x91CF;&#x53D8;&#x4E3A;&#x5173;&#x95ED;&#xFF0C;&#x5219; &#x8C03; &#x7528; socket &#x7684; close &#x65B9;&#x6CD5;&#xFF0C;&#x5FAA;&#x73AF;&#x7ED3;&#x675F;&#xFF0C;&#x4ECE;&#x800C;&#x8FBE;&#x5230;&#x5173;&#x95ED;&#x8FDE;&#x63A5;&#x7684;&#x76EE;&#x7684;</p>
<h2 id="&#x7B80;&#x8FF0;-tcp-&#x548C;-udp-&#x7684;&#x533A;&#x522B;&#x4EE5;&#x53CA;&#x4F18;&#x7F3A;&#x70B9;">&#x7B80;&#x8FF0; TCP &#x548C; UDP &#x7684;&#x533A;&#x522B;&#x4EE5;&#x53CA;&#x4F18;&#x7F3A;&#x70B9;?</h2>
<p>UDP &#x662F;&#x9762;&#x5411;&#x65E0;&#x8FDE;&#x63A5;&#x7684;&#x901A;&#x8BAF;&#x534F;&#x8BAE;&#xFF0C;UDP &#x6570;&#x636E;&#x5305;&#x62EC;&#x76EE;&#x7684;&#x7AEF;&#x53E3;&#x53F7;&#x548C;&#x6E90;&#x7AEF;&#x53E3;&#x53F7;&#x4FE1;&#x606F;&#x3002; </p>
<p>&#x4F18;&#x70B9;&#xFF1A;UDP &#x901F;&#x5EA6;&#x5FEB;&#x3001;&#x64CD;&#x4F5C;&#x7B80;&#x5355;&#x3001;&#x8981;&#x6C42;&#x7CFB;&#x7EDF;&#x8D44;&#x6E90;&#x8F83;&#x5C11;&#xFF0C;&#x7531;&#x4E8E;&#x901A;&#x8BAF;&#x4E0D;&#x9700;&#x8981;&#x8FDE;&#x63A5;&#xFF0C;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x5E7F;&#x64AD;&#x53D1;&#x9001; </p>
<p>&#x7F3A;&#x70B9;&#xFF1A;UDP &#x4F20;&#x9001;&#x6570;&#x636E;&#x524D;&#x5E76;&#x4E0D;&#x4E0E;&#x5BF9;&#x65B9;&#x5EFA;&#x7ACB;&#x8FDE;&#x63A5;&#xFF0C;&#x5BF9;&#x63A5;&#x6536;&#x5230;&#x7684;&#x6570;&#x636E;&#x4E5F;&#x4E0D;&#x53D1;&#x9001;&#x786E;&#x8BA4;&#x4FE1;&#x53F7;&#xFF0C;&#x53D1;&#x9001;&#x7AEF;&#x4E0D;&#x77E5;&#x9053;&#x6570; &#x636E;&#x662F;&#x5426;&#x4F1A;&#x6B63;&#x786E;&#x63A5;&#x6536;&#xFF0C;&#x4E5F;&#x4E0D;&#x91CD;&#x590D;&#x53D1;&#x9001;&#xFF0C;&#x4E0D;&#x53EF;&#x9760;&#x3002;</p>
<p>TCP &#x662F;&#x9762;&#x5411;&#x8FDE;&#x63A5;&#x7684;&#x901A;&#x8BAF;&#x534F;&#x8BAE;&#xFF0C;&#x901A;&#x8FC7;&#x4E09;&#x6B21;&#x63E1;&#x624B;&#x5EFA;&#x7ACB;&#x8FDE;&#x63A5;&#xFF0C;&#x901A;&#x8BAF;&#x5B8C;&#x6210;&#x65F6;&#x56DB;&#x6B21;&#x6325;&#x624B; </p>
<p>&#x4F18;&#x70B9;&#xFF1A;TCP &#x5728;&#x6570;&#x636E;&#x4F20;&#x9012;&#x65F6;&#xFF0C;&#x6709;&#x786E;&#x8BA4;&#x3001;&#x7A97;&#x53E3;&#x3001;&#x91CD;&#x4F20;&#x3001;&#x963B;&#x585E;&#x7B49;&#x63A7;&#x5236;&#x673A;&#x5236;&#xFF0C;&#x80FD;&#x4FDD;&#x8BC1;&#x6570;&#x636E;&#x6B63;&#x786E;&#x6027;&#xFF0C;&#x8F83;&#x4E3A;&#x53EF;&#x9760;&#x3002; </p>
<p>&#x7F3A;&#x70B9;&#xFF1A;TCP &#x76F8;&#x5BF9;&#x4E8E; UDP &#x901F;&#x5EA6;&#x6162;&#x4E00;&#x70B9;&#xFF0C;&#x8981;&#x6C42;&#x7CFB;&#x7EDF;&#x8D44;&#x6E90;&#x8F83;&#x591A;&#x3002;</p>
<h2 id="&#x7B80;&#x8FF0;&#x6D4F;&#x89C8;&#x5668;&#x901A;&#x8FC7;-wsgi-&#x8BF7;&#x6C42;&#x52A8;&#x6001;&#x8D44;&#x6E90;&#x7684;&#x8FC7;&#x7A0B;">&#x7B80;&#x8FF0;&#x6D4F;&#x89C8;&#x5668;&#x901A;&#x8FC7; WSGI &#x8BF7;&#x6C42;&#x52A8;&#x6001;&#x8D44;&#x6E90;&#x7684;&#x8FC7;&#x7A0B;?</h2>
<p>1.&#x53D1;&#x9001; http &#x8BF7;&#x6C42;&#x52A8;&#x6001;&#x8D44;&#x6E90;&#x7ED9; web &#x670D;&#x52A1;&#x5668; </p>
<p>2.web &#x670D;&#x52A1;&#x5668;&#x6536;&#x5230;&#x8BF7;&#x6C42;&#x540E;&#x901A;&#x8FC7; WSGI &#x8C03;&#x7528;&#x4E00;&#x4E2A;&#x5C5E;&#x6027;&#x7ED9;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6846;&#x67B6;</p>
<p> 3.&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6846;&#x67B6;&#x901A;&#x8FC7;&#x5F15;&#x7528; WSGI &#x8C03;&#x7528; web &#x670D;&#x52A1;&#x5668;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x8BBE;&#x7F6E;&#x8FD4;&#x56DE;&#x7684;&#x72B6;&#x6001;&#x548C;&#x5934;&#x4FE1;&#x606F;&#x3002;</p>
<p> 4.&#x8C03;&#x7528;&#x540E;&#x8FD4;&#x56DE;&#xFF0C;&#x6B64;&#x65F6; web &#x670D;&#x52A1;&#x5668;&#x4FDD;&#x5B58;&#x4E86;&#x521A;&#x521A;&#x8BBE;&#x7F6E;&#x7684;&#x4FE1;&#x606F; </p>
<p>5.&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6846;&#x67B6;&#x67E5;&#x8BE2;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x751F;&#x6210;&#x52A8;&#x6001;&#x9875;&#x9762;&#x7684; body &#x7684;&#x4FE1;&#x606F; </p>
<p>6.&#x628A;&#x751F;&#x6210;&#x7684; body &#x4FE1;&#x606F;&#x8FD4;&#x56DE;&#x7ED9; web &#x670D;&#x52A1;&#x5668;</p>
<p> 7.web &#x670D;&#x52A1;&#x5668;&#x5427;&#x6570;&#x636E;&#x8FD4;&#x56DE;&#x7ED9;&#x6D4F;&#x89C8;&#x5668;</p>
<h2 id="&#x63CF;&#x8FF0;&#x7528;&#x6D4F;&#x89C8;&#x5668;&#x8BBF;&#x95EE;-wwwbaiducom-&#x7684;&#x8FC7;&#x7A0B;">&#x63CF;&#x8FF0;&#x7528;&#x6D4F;&#x89C8;&#x5668;&#x8BBF;&#x95EE; <a href="http://www.baidu.com/" target="_blank">www.baidu.com </a>&#x7684;&#x8FC7;&#x7A0B;</h2>
<p>&#x5148;&#x8981;&#x89E3;&#x6790;&#x51FA; baidu.com &#x5BF9;&#x5E94;&#x7684; ip &#x5730;&#x5740; &#x8981;&#x5148;&#x4F7F;&#x7528; arp &#x83B7;&#x53D6;&#x9ED8;&#x8BA4;&#x7F51;&#x5173;&#x7684; mac &#x5730;&#x5740; &#x7EC4;&#x7EC7;&#x6570;&#x636E;&#x53D1;&#x9001;&#x7ED9;&#x9ED8;&#x8BA4;&#x7F51;&#x5173;(ip &#x8FD8;&#x662F; dns &#x670D;&#x52A1;&#x5668;&#x7684; ip&#xFF0C;&#x4F46;&#x662F; mac &#x5730;&#x5740;&#x662F;&#x9ED8;&#x8BA4;&#x7F51;&#x5173;&#x7684; mac &#x5730;&#x5740;) &#x9ED8;&#x8BA4;&#x7F51;&#x5173;&#x62E5;&#x6709;&#x8F6C;&#x53D1;&#x6570;&#x636E;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x628A;&#x6570;&#x636E;&#x8F6C;&#x53D1;&#x7ED9;&#x8DEF;&#x7531;&#x5668; &#x8DEF;&#x7531;&#x5668;&#x6839;&#x636E;&#x81EA;&#x5DF1;&#x7684;&#x8DEF;&#x7531;&#x534F;&#x8BAE;&#xFF0C;&#x6765;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x5408;&#x9002;&#x7684;&#x8F83;&#x5FEB;&#x7684;&#x8DEF;&#x5F84;&#x8F6C;&#x53D1;&#x6570;&#x636E;&#x7ED9;&#x76EE;&#x7684;&#x7F51;&#x5173; &#x76EE;&#x7684;&#x7F51;&#x5173;(dns &#x670D;&#x52A1;&#x5668;&#x6240;&#x5728;&#x7684;&#x7F51;&#x5173;)&#xFF0C;&#x628A;&#x6570;&#x636E;&#x8F6C;&#x53D1;&#x7ED9; dns &#x670D;&#x52A1;&#x5668; dns &#x670D;&#x52A1;&#x5668;&#x67E5;&#x8BE2;&#x89E3;&#x6790;&#x51FA; baidu.com &#x5BF9;&#x5E94;&#x7684; ip &#x5730;&#x5740;&#xFF0C;&#x5E76;&#x539F;&#x8DEF;&#x8FD4;&#x56DE;&#x8BF7;&#x6C42;&#x8FD9;&#x4E2A;&#x57DF;&#x540D;&#x7684; client &#x5F97;&#x5230;&#x4E86; baidu.com &#x5BF9;&#x5E94;&#x7684; ip &#x5730;&#x5740;&#x4E4B;&#x540E;&#xFF0C;&#x4F1A;&#x53D1;&#x9001; tcp &#x7684; 3 &#x6B21;&#x63E1;&#x624B;&#xFF0C;&#x8FDB;&#x884C;&#x8FDE;&#x63A5;</p>
<p>&#x4F7F;&#x7528; http &#x534F;&#x8BAE;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#x6570;&#x636E;&#x7ED9; web &#x670D;&#x52A1;&#x5668; web &#x670D;&#x52A1;&#x5668;&#x6536;&#x5230;&#x6570;&#x636E;&#x8BF7;&#x6C42;&#x4E4B;&#x540E;&#xFF0C;&#x901A;&#x8FC7;&#x67E5;&#x8BE2;&#x81EA;&#x5DF1;&#x7684;&#x670D;&#x52A1;&#x5668;&#x5F97;&#x5230;&#x76F8;&#x5E94;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x539F;&#x8DEF;&#x8FD4;&#x56DE;&#x7ED9;&#x6D4F;&#x89C8;&#x5668;&#x3002; &#x6D4F;&#x89C8;&#x5668;&#x63A5;&#x6536;&#x5230;&#x6570;&#x636E;&#x4E4B;&#x540E;&#x901A;&#x8FC7;&#x6D4F;&#x89C8;&#x5668;&#x81EA;&#x5DF1;&#x7684;&#x6E32;&#x67D3;&#x529F;&#x80FD;&#x6765;&#x663E;&#x793A;&#x8FD9;&#x4E2A;&#x7F51;&#x9875;&#x3002; &#x6D4F;&#x89C8;&#x5668;&#x5173;&#x95ED; tcp &#x8FDE;&#x63A5;&#xFF0C;&#x5373; 4 &#x6B21;&#x6325;&#x624B;&#x7ED3;&#x675F;&#xFF0C;&#x5B8C;&#x6210;&#x6574;&#x4E2A;&#x8BBF;&#x95EE;&#x8FC7;&#x7A0B;</p>
<h2 id="post-&#x548C;-get-&#x8BF7;&#x6C42;&#x7684;&#x533A;&#x522B;">Post &#x548C; Get &#x8BF7;&#x6C42;&#x7684;&#x533A;&#x522B;?</h2>
<p>GET &#x8BF7;&#x6C42;&#xFF0C;&#x8BF7;&#x6C42;&#x7684;&#x6570;&#x636E;&#x4F1A;&#x9644;&#x52A0;&#x5728; URL &#x4E4B;&#x540E;&#xFF0C;&#x4EE5;?&#x5206;&#x5272; URL &#x548C;&#x4F20;&#x8F93;&#x6570;&#x636E;&#xFF0C;&#x591A;&#x4E2A;&#x53C2;&#x6570;&#x7528;&amp;&#x8FDE;&#x63A5;&#x3002;URL &#x7684;&#x7F16;&#x7801;&#x683C;&#x5F0F;&#x91C7;&#x7528;&#x7684;&#x662F; ASCII &#x7F16;&#x7801;&#xFF0C;&#x800C;&#x4E0D;&#x662F; uniclde&#xFF0C;&#x5373;&#x662F;&#x8BF4;&#x6240;&#x6709;&#x7684;&#x975E; ASCII &#x5B57;&#x7B26;&#x90FD;&#x8981;&#x7F16;&#x7801;&#x4E4B;&#x540E;&#x518D;&#x4F20;&#x8F93;&#x3002; </p>
<p>POST &#x8BF7;&#x6C42;&#xFF1A;POST &#x8BF7;&#x6C42;&#x4F1A;&#x628A;&#x8BF7;&#x6C42;&#x7684;&#x6570;&#x636E;&#x653E;&#x7F6E;&#x5728; HTTP &#x8BF7;&#x6C42;&#x5305;&#x7684;&#x5305;&#x4F53;&#x4E2D;&#x3002;&#x4E0A;&#x9762;&#x7684; item=bandsaw &#x5C31;&#x662F;&#x5B9E;&#x9645;&#x7684;&#x4F20;&#x8F93;&#x6570;&#x636E;&#x3002; &#x56E0;&#x6B64;&#xFF0C;GET &#x8BF7;&#x6C42;&#x7684;&#x6570;&#x636E;&#x4F1A;&#x66B4;&#x9732;&#x5728;&#x5730;&#x5740;&#x680F;&#x4E2D;&#xFF0C;&#x800C; POST &#x8BF7;&#x6C42;&#x5219;&#x4E0D;&#x4F1A;&#x3002;</p>
<p>&#x4F20;&#x8F93;&#x6570;&#x636E;&#x7684;&#x5927;&#x5C0F;&#xFF1A;</p>
<p>&#x5728; HTTP &#x89C4;&#x8303;&#x4E2D;&#xFF0C;&#x6CA1;&#x6709;&#x5BF9; URL &#x7684;&#x957F;&#x5EA6;&#x548C;&#x4F20;&#x8F93;&#x7684;&#x6570;&#x636E;&#x5927;&#x5C0F;&#x8FDB;&#x884C;&#x9650;&#x5236;&#x3002;&#x4F46;&#x662F;&#x5728;&#x5B9E;&#x9645;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x5BF9; &#x4E8E;GET&#xFF0C;&#x7279;&#x5B9A;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x548C;&#x670D;&#x52A1;&#x5668;&#x5BF9; URL &#x7684;&#x957F;&#x5EA6;&#x6709;&#x9650;&#x5236;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5728;&#x4F7F;&#x7528; GET &#x8BF7;&#x6C42;&#x65F6;&#xFF0C;&#x4F20;&#x8F93;&#x6570;&#x636E;&#x4F1A; &#x53D7;&#x5230;</p>
<p>URL &#x957F;&#x5EA6;&#x7684;&#x9650;&#x5236;&#x3002; &#x5BF9;&#x4E8E; POST&#xFF0C;&#x7531;&#x4E8E;&#x4E0D;&#x662F; URL &#x4F20;&#x503C;&#xFF0C;&#x7406;&#x8BBA;&#x4E0A;&#x662F;&#x4E0D;&#x4F1A;&#x53D7;&#x9650;&#x5236;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x5B9E;&#x9645;&#x4E0A;&#x5404;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x4F1A;&#x89C4;&#x5B9A;&#x5BF9; POST &#x63D0;&#x4EA4;&#x6570;&#x636E;&#x5927;&#x5C0F;&#x8FDB;&#x884C;&#x9650;&#x5236;&#xFF0C;Apache&#x3001;IIS &#x90FD;&#x6709;&#x5404;&#x81EA;&#x7684;&#x914D;&#x7F6E;&#x3002;</p>
<p>&#x5B89;&#x5168;&#x6027;&#xFF1A;</p>
<p>POST &#x7684;&#x5B89;&#x5168;&#x6027;&#x6BD4; GET &#x7684;&#x9AD8;&#x3002;&#x8FD9;&#x91CC;&#x7684;&#x5B89;&#x5168;&#x662F;&#x6307;&#x771F;&#x6B63;&#x7684;&#x5B89;&#x5168;&#xFF0C;&#x800C;&#x4E0D;&#x540C;&#x4E8E;&#x4E0A;&#x9762; GET &#x63D0;&#x5230;&#x7684;&#x5B89;&#x5168;&#x65B9;&#x6CD5; &#x4E2D;&#x7684;&#x5B89;&#x5168;&#xFF0C;&#x4E0A;&#x9762;&#x63D0;&#x5230;&#x7684;&#x5B89;&#x5168;&#x4EC5;&#x4EC5;&#x662F;&#x4E0D;&#x4FEE;&#x6539;&#x670D;&#x52A1;&#x5668;&#x7684;&#x6570;&#x636E;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x5728;&#x8FDB;&#x884C;&#x767B;&#x5F55;&#x64CD;&#x4F5C;&#xFF0C;&#x901A;&#x8FC7; GET &#x8BF7;&#x6C42;&#xFF0C; &#x7528;&#x6237;&#x540D;&#x548C;&#x5BC6;&#x7801;&#x90FD;&#x4F1A;&#x66B4;&#x9732;&#x518D; URL &#x4E0A;&#xFF0C;&#x56E0;&#x4E3A;&#x767B;&#x5F55;&#x9875;&#x9762;&#x6709;&#x53EF;&#x80FD;&#x88AB;&#x6D4F;&#x89C8;&#x5668;&#x7F13;&#x5B58;&#x4EE5;&#x53CA;&#x5176;&#x4ED6;&#x4EBA;&#x67E5;&#x770B;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x5386;&#x53F2;&#x8BB0;&#x5F55;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x6B64;&#x65F6;&#x7684;&#x7528;&#x6237;&#x540D;&#x548C;&#x5BC6;&#x7801;&#x5C31;&#x5F88;&#x5BB9;&#x6613;&#x88AB;&#x4ED6;&#x4EBA;&#x62FF;&#x5230;&#x4E86;&#x3002;&#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;GET &#x8BF7;&#x6C42;&#x63D0;&#x4EA4;&#x7684;&#x6570;&#x636E; &#x8FD8;&#x53EF;&#x80FD;&#x4F1A;&#x9020;&#x6210; Cross-site request frogery &#x653B;&#x51FB;&#x3002;</p>
<p>&#x6548;&#x7387;&#xFF1A;GET &#x6BD4; POST &#x6548;&#x7387;&#x9AD8;&#x3002;</p>
<p>POST &#x8BF7;&#x6C42;&#x7684;&#x8FC7;&#x7A0B;&#xFF1A; </p>
<p>1.&#x6D4F;&#x89C8;&#x5668;&#x8BF7;&#x6C42; tcp &#x8FDE;&#x63A5;&#xFF08;&#x7B2C;&#x4E00;&#x6B21;&#x63E1;&#x624B;&#xFF09; </p>
<p>2.&#x670D;&#x52A1;&#x5668;&#x7B54;&#x5E94;&#x8FDB;&#x884C; tcp &#x8FDE;&#x63A5;&#xFF08;&#x7B2C;&#x4E8C;&#x6B21;&#x63E1;&#x624B;&#xFF09; </p>
<p>3.&#x6D4F;&#x89C8;&#x5668;&#x786E;&#x8BA4;&#xFF0C;&#x5E76;&#x53D1;&#x9001; post &#x8BF7;&#x6C42;&#x5934;&#xFF08;&#x7B2C;&#x4E09;&#x6B21;&#x63E1;&#x624B;&#xFF0C;&#x8FD9;&#x4E2A;&#x62A5;&#x6587;&#x6BD4;&#x8F83;&#x5C0F;&#xFF0C;&#x6240;&#x4EE5; http &#x4F1A;&#x5728;&#x6B64;&#x65F6;&#x8FDB;&#x884C;&#x7B2C;&#x4E00;&#x6B21;&#x6570;&#x636E;&#x53D1;&#x9001;&#xFF09; </p>
<p>4.&#x670D;&#x52A1;&#x5668;&#x8FD4;&#x56DE; 100 continue &#x54CD;&#x5E94;</p>
<p> 5.&#x6D4F;&#x89C8;&#x5668;&#x5F00;&#x59CB;&#x53D1;&#x9001;&#x6570;&#x636E;</p>
<p> 6.&#x670D;&#x52A1;&#x5668;&#x8FD4;&#x56DE; 200 ok &#x54CD;&#x5E94;</p>
<p>GET &#x8BF7;&#x6C42;&#x7684;&#x8FC7;&#x7A0B;&#xFF1A;</p>
<p> 1.&#x6D4F;&#x89C8;&#x5668;&#x8BF7;&#x6C42; tcp &#x8FDE;&#x63A5;&#xFF08;&#x7B2C;&#x4E00;&#x6B21;&#x63E1;&#x624B;&#xFF09; </p>
<p>2.&#x670D;&#x52A1;&#x5668;&#x7B54;&#x5E94;&#x8FDB;&#x884C; tcp &#x8FDE;&#x63A5;&#xFF08;&#x7B2C;&#x4E8C;&#x6B21;&#x63E1;&#x624B;&#xFF09;</p>
<p>3.&#x6D4F;&#x89C8;&#x5668;&#x786E;&#x8BA4;&#xFF0C;&#x5E76;&#x53D1;&#x9001; get &#x8BF7;&#x6C42;&#x5934;&#x548C;&#x6570;&#x636E;&#xFF08;&#x7B2C;&#x4E09;&#x6B21;&#x63E1;&#x624B;&#xFF0C;&#x8FD9;&#x4E2A;&#x62A5;&#x6587;&#x6BD4;&#x8F83;&#x5C0F;&#xFF0C;&#x6240;&#x4EE5; http &#x4F1A;&#x5728;&#x6B64;&#x65F6; &#x8FDB;&#x884C;&#x7B2C;&#x4E00;&#x6B21;&#x6570;&#x636E;&#x53D1;&#x9001;&#xFF09;</p>
<p> 4.&#x670D;&#x52A1;&#x5668;&#x8FD4;&#x56DE; 200 OK &#x54CD;&#x5E94;</p>
<h2 id="cookie-&#x548C;-session-&#x7684;&#x533A;&#x522B;&#xFF1F;">cookie &#x548C; session &#x7684;&#x533A;&#x522B;&#xFF1F;</h2>
<p>1&#x3001;cookie &#x6570;&#x636E;&#x5B58;&#x653E;&#x5728;&#x5BA2;&#x6237;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x4E0A;&#xFF0C;session &#x6570;&#x636E;&#x653E;&#x5728;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x3002;</p>
<p> 2&#x3001;cookie &#x4E0D;&#x662F;&#x5F88;&#x5B89;&#x5168;&#xFF0C;&#x522B;&#x4EBA;&#x53EF;&#x4EE5;&#x5206;&#x6790;&#x5B58;&#x653E;&#x5728;&#x672C;&#x5730;&#x7684; cookie &#x5E76;&#x8FDB;&#x884C; cookie &#x6B3A;&#x9A97;&#x8003;&#x8651;&#x5230;&#x5B89;&#x5168;&#x5E94;&#x5F53;&#x4F7F; &#x7528; session&#x3002; </p>
<p>3&#x3001;session &#x4F1A;&#x5728;&#x4E00;&#x5B9A;&#x65F6;&#x95F4;&#x5185;&#x4FDD;&#x5B58;&#x5728;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x3002;&#x5F53;&#x8BBF;&#x95EE;&#x589E;&#x591A;&#xFF0C;&#x4F1A;&#x6BD4;&#x8F83;&#x5360;&#x7528;&#x670D;&#x52A1;&#x5668;&#x7684;&#x6027;&#x80FD;&#x8003;&#x8651;&#x5230;&#x51CF;&#x8F7B;&#x670D;&#x52A1;&#x5668;&#x6027;&#x80FD;&#x65B9;&#x9762;&#xFF0C;&#x5E94;&#x5F53;&#x4F7F;&#x7528; cookie&#x3002;</p>
<p> 4&#x3001;&#x5355;&#x4E2A; cookie &#x4FDD;&#x5B58;&#x7684;&#x6570;&#x636E;&#x4E0D;&#x80FD;&#x8D85;&#x8FC7; 4K&#xFF0C;&#x5F88;&#x591A;&#x6D4F;&#x89C8;&#x5668;&#x90FD;&#x9650;&#x5236;&#x4E00;&#x4E2A;&#x7AD9;&#x70B9;&#x6700;&#x591A;&#x4FDD;&#x5B58; 20 &#x4E2A; cookie&#x3002; 5&#x3001;&#x5EFA;&#x8BAE;&#xFF1A; &#x5C06;&#x767B;&#x9646;&#x4FE1;&#x606F;&#x7B49;&#x91CD;&#x8981;&#x4FE1;&#x606F;&#x5B58;&#x653E;&#x4E3A; SESSION &#x5176;&#x4ED6;&#x4FE1;&#x606F;&#x5982;&#x679C;&#x9700;&#x8981;&#x4FDD;&#x7559;&#xFF0C;&#x53EF;&#x4EE5;&#x653E;&#x5728; cookie &#x4E2D;</p>
<h2 id="http-&#x534F;&#x8BAE;&#x72B6;&#x6001;&#x7801;&#x6709;&#x4EC0;&#x4E48;&#x7528;&#xFF0C;&#x5217;&#x51FA;&#x4F60;&#x77E5;&#x9053;&#x7684;-http-&#x534F;&#x8BAE;&#x7684;&#x72B6;&#x6001;&#x7801;&#xFF0C;&#x7136;&#x540E;&#x8BB2;&#x51FA;&#x4ED6;&#x4EEC;&#x90FD;&#x8868;&#x793A;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#xFF1F;">HTTP &#x534F;&#x8BAE;&#x72B6;&#x6001;&#x7801;&#x6709;&#x4EC0;&#x4E48;&#x7528;&#xFF0C;&#x5217;&#x51FA;&#x4F60;&#x77E5;&#x9053;&#x7684; HTTP &#x534F;&#x8BAE;&#x7684;&#x72B6;&#x6001;&#x7801;&#xFF0C;&#x7136;&#x540E;&#x8BB2;&#x51FA;&#x4ED6;&#x4EEC;&#x90FD;&#x8868;&#x793A;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#xFF1F;</h2>
<p>&#x901A;&#x8FC7;&#x72B6;&#x6001;&#x7801;&#x544A;&#x8BC9;&#x5BA2;&#x6237;&#x7AEF;&#x670D;&#x52A1;&#x5668;&#x7684;&#x6267;&#x884C;&#x72B6;&#x6001;&#xFF0C;&#x4EE5;&#x5224;&#x65AD;&#x4E0B;&#x4E00;&#x6B65;&#x8BE5;&#x6267;&#x884C;&#x4EC0;&#x4E48;&#x64CD;&#x4F5C;&#x3002; &#x5E38;&#x89C1;&#x7684;&#x72B6;&#x6001;&#x673A;&#x5668;&#x7801;&#x6709;&#xFF1A;</p>
<p>100-199&#xFF1A;&#x8868;&#x793A;&#x670D;&#x52A1;&#x5668;&#x6210;&#x529F;&#x63A5;&#x6536;&#x90E8;&#x5206;&#x8BF7;&#x6C42;&#xFF0C;&#x8981;&#x6C42;&#x5BA2;&#x6237;&#x7AEF;&#x7EE7;&#x7EED;&#x63D0;&#x4EA4;&#x5176;&#x4F59;&#x8BF7;&#x6C42;&#x624D;&#x80FD;&#x5B8C;&#x6210;&#x6574;&#x4E2A;&#x5904;&#x7406;&#x8FC7;&#x7A0B;&#x3002;</p>
<p>200-299&#xFF1A;&#x8868;&#x793A;&#x670D;&#x52A1;&#x5668;&#x6210;&#x529F;&#x63A5;&#x6536;&#x8BF7;&#x6C42;&#x5E76;&#x5DF2;&#x5B8C;&#x6210;&#x5904;&#x7406;&#x8FC7;&#x7A0B;&#xFF0C;&#x5E38;&#x7528; 200&#xFF08;OK &#x8BF7;&#x6C42;&#x6210;&#x529F;&#xFF09;&#x3002;</p>
<p> 300-399&#xFF1A;&#x4E3A;&#x5B8C;&#x6210;&#x8BF7;&#x6C42;&#xFF0C;&#x5BA2;&#x6237;&#x9700;&#x8981;&#x8FDB;&#x4E00;&#x6B65;&#x7EC6;&#x5316;&#x8BF7;&#x6C42;&#x3002;</p>
<p>302&#xFF08;&#x6240;&#x6709;&#x8BF7;&#x6C42;&#x9875;&#x9762;&#x5DF2;&#x7ECF;&#x4E34;&#x65F6;&#x8F6C;&#x79FB;&#x5230;&#x65B0;&#x7684; url&#xFF09;&#x3002;</p>
<p>304&#x3001;307&#xFF08;&#x4F7F;&#x7528;&#x7F13;&#x5B58;&#x8D44;&#x6E90;&#xFF09;&#x3002; </p>
<p>400-499&#xFF1A;&#x5BA2;&#x6237;&#x7AEF;&#x8BF7;&#x6C42;&#x6709;&#x9519;&#x8BEF;&#xFF0C;&#x5E38;&#x7528; 404&#xFF08;&#x670D;&#x52A1;&#x5668;&#x65E0;&#x6CD5;&#x627E;&#x5230;&#x88AB;&#x8BF7;&#x6C42;&#x9875;&#x9762;&#xFF09;&#xFF0C;403&#xFF08;&#x670D;&#x52A1;&#x5668;&#x62D2;&#x7EDD;&#x8BBF;&#x95EE;&#xFF0C; &#x6743;&#x9650;&#x4E0D;&#x591F;&#xFF09;&#x3002; </p>
<p>500-599&#xFF1A;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x51FA;&#x73B0;&#x9519;&#x8BEF;&#xFF0C;&#x5E38;&#x7528; 500&#xFF08;&#x8BF7;&#x6C42;&#x672A;&#x5B8C;&#x6210;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x9047;&#x5230;&#x4E0D;&#x53EF;&#x9884;&#x77E5;&#x7684;&#x60C5;&#x51B5;&#xFF09;&#x3002;</p>
<h2 id="&#x8BF7;&#x7B80;&#x5355;&#x8BF4;&#x4E00;&#x4E0B;&#x4E09;&#x6B21;&#x63E1;&#x624B;&#x548C;&#x56DB;&#x6B21;&#x6325;&#x624B;&#xFF1F;">&#x8BF7;&#x7B80;&#x5355;&#x8BF4;&#x4E00;&#x4E0B;&#x4E09;&#x6B21;&#x63E1;&#x624B;&#x548C;&#x56DB;&#x6B21;&#x6325;&#x624B;&#xFF1F;</h2>
<p>&#x4E09;&#x6B21;&#x63E1;&#x624B;&#x8FC7;&#x7A0B;&#xFF1A;</p>
<p>1 &#x9996;&#x5148;&#x5BA2;&#x6237;&#x7AEF;&#x5411;&#x670D;&#x52A1;&#x7AEF;&#x53D1;&#x9001;&#x4E00;&#x4E2A;&#x5E26;&#x6709; SYN &#x6807;&#x5FD7;&#xFF0C;&#x4EE5;&#x53CA;&#x968F;&#x673A;&#x751F;&#x6210;&#x7684;&#x5E8F;&#x53F7; 100(0 &#x5B57;&#x8282;)&#x7684;&#x62A5;&#x6587; 2 &#x670D;&#x52A1;&#x7AEF;&#x6536;&#x5230;&#x62A5;&#x6587;&#x540E;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x62A5;&#x6587;(SYN200(0 &#x5B57;&#x8282;)&#xFF0C;ACk1001(&#x5B57;&#x8282;+1))&#x7ED9;&#x5BA2;&#x6237;&#x7AEF; 3 &#x5BA2;&#x6237;&#x7AEF;&#x518D;&#x6B21;&#x53D1;&#x9001;&#x5E26;&#x6709; ACk &#x6807;&#x5FD7; 201(&#x5B57;&#x8282;+)&#x5E8F;&#x53F7;&#x7684;&#x62A5;&#x6587;&#x7ED9;&#x670D;&#x52A1;&#x7AEF; &#x81F3;&#x6B64;&#x4E09;&#x6B21;&#x63E1;&#x624B;&#x8FC7;&#x7A0B;&#x7ED3;&#x675F;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x5F00;&#x59CB;&#x5411;&#x670D;&#x52A1;&#x7AEF;&#x53D1;&#x9001;&#x6570;&#x636E;&#x3002;</p>
<p>1 &#x5BA2;&#x6237;&#x7AEF;&#x5411;&#x670D;&#x52A1;&#x7AEF;&#x53D1;&#x8D77;&#x8BF7;&#x6C42;&#xFF1A;&#x6211;&#x60F3;&#x7ED9;&#x4F60;&#x901A;&#x4FE1;&#xFF0C;&#x4F60;&#x51C6;&#x5907;&#x597D;&#x4E86;&#x4E48;&#xFF1F; 2 &#x670D;&#x52A1;&#x7AEF;&#x6536;&#x5230;&#x8BF7;&#x6C42;&#x540E;&#x56DE;&#x5E94;&#x5BA2;&#x6237;&#x7AEF;&#xFF1A;I&apos;ok&#xFF0C;&#x4F60;&#x51C6;&#x5907;&#x597D;&#x4E86;&#x4E48; 3 &#x5BA2;&#x6237;&#x7AEF;&#x793C;&#x8C8C;&#x7684;&#x518D;&#x6B21;&#x56DE;&#x4E00;&#x4E0B;&#x5BA2;&#x6237;&#x7AEF;&#xFF1A;&#x51C6;&#x5907;&#x5C31;&#x7EEA;&#xFF0C;&#x54B1;&#x4EEC;&#x5F00;&#x59CB;&#x901A;&#x4FE1;&#x5427;&#xFF01; &#x6574;&#x4E2A;&#x8FC7;&#x7A0B;&#x8DDF;&#x6253;&#x7535;&#x8BDD;&#x7684;&#x8FC7;&#x7A0B;&#x4E00;&#x6A21;&#x4E00;&#x6837;:1 &#x5582;&#xFF0C;&#x4F60;&#x5728;&#x5417; 2 &#x5728;&#xFF0C;&#x6211;&#x8BF4;&#x7684;&#x4F60;&#x542C;&#x5F97;&#x5230;&#x4E0D; 3 &#x6069;&#xFF0C;&#x542C;&#x5F97;&#x5230;(&#x63A5;&#x4E0B;&#x6765;&#x8BF7; &#x5F00;&#x59CB;&#x4F60;&#x7684;&#x8868;&#x6F14;)&#x8865;&#x5145;&#xFF1A;SYN&#xFF1A;&#x8BF7;&#x6C42;&#x8BE2;&#x95EE;&#xFF0C;ACk&#xFF1A;&#x56DE;&#x590D;&#xFF0C;&#x56DE;&#x5E94;&#x3002;</p>
<p>&#x56DB;&#x6B21;&#x6325;&#x624B;&#x8FC7;&#x7A0B;&#xFF1A;</p>
<p>&#x7531;&#x4E8E; TCP &#x8FDE;&#x63A5;&#x662F;&#x53EF;&#x4EE5;&#x53CC;&#x5411;&#x901A;&#x4FE1;&#x7684;&#xFF08;&#x5168;&#x53CC;&#x5DE5;&#xFF09;&#xFF0C;&#x56E0;&#x6B64;&#x6BCF;&#x4E2A;&#x65B9;&#x5411;&#x90FD;&#x5FC5;&#x987B;&#x5355;&#x72EC;&#x8FDB;&#x884C;&#x5173;&#x95ED;&#xFF08;&#x8FD9;&#x53E5;&#x8BDD;&#x624D;&#x662F; &#x7CBE;&#x8F9F;&#xFF0C;&#x540E;&#x9762;&#x56DB;&#x4E2A;&#x6325;&#x624B;&#x8FC7;&#x7A0B;&#x90FD;&#x662F;&#x5176;&#x5177;&#x4F53;&#x5B9E;&#x73B0;&#x7684;&#x8BED;&#x8A00;&#x63CF;&#x8FF0;&#xFF09; &#x56DB;&#x6B21;&#x6325;&#x624B;&#x8FC7;&#x7A0B;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x548C;&#x670D;&#x52A1;&#x7AEF;&#x90FD;&#x53EF;&#x4EE5;&#x5148;&#x5F00;&#x59CB;&#x65AD;&#x5F00;&#x8FDE;&#x63A5; 1 &#x5BA2;&#x6237;&#x7AEF;&#x53D1;&#x9001;&#x5E26;&#x6709; fin &#x6807;&#x8BC6;&#x7684;&#x62A5;&#x6587;&#x7ED9;&#x670D;&#x52A1;&#x7AEF;&#xFF0C;&#x8BF7;&#x6C42;&#x901A;&#x4FE1;&#x5173;&#x95ED; 2 &#x670D;&#x52A1;&#x7AEF;&#x6536;&#x5230;&#x4FE1;&#x606F;&#x540E;&#xFF0C;&#x56DE;&#x590D; ACK &#x7B54;&#x5E94;&#x5173;&#x95ED;&#x5BA2;&#x6237;&#x7AEF;&#x901A;&#x4FE1;(&#x8FDE;&#x63A5;)&#x8BF7;&#x6C42; 3 &#x670D;&#x52A1;&#x7AEF;&#x53D1;&#x9001;&#x5E26;&#x6709; fin &#x6807;&#x8BC6;&#x7684;&#x62A5;&#x6587;&#x7ED9;&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x4E5F;&#x8BF7;&#x6C42;&#x5173;&#x95ED;&#x901A;&#x4FE1; 4 &#x5BA2;&#x6237;&#x7AEF;&#x56DE;&#x5E94; ack &#x7ED9;&#x670D;&#x52A1;&#x7AEF;&#xFF0C;&#x7B54;&#x5E94;&#x5173;&#x95ED;&#x670D;&#x52A1;&#x7AEF;&#x7684;&#x901A;&#x4FE1;(&#x8FDE;&#x63A5;)&#x8BF7;&#x6C42;</p>
<h2 id="&#x8BF4;&#x4E00;&#x4E0B;&#x4EC0;&#x4E48;&#x662F;-tcp-&#x7684;-2msl&#xFF1F;">&#x8BF4;&#x4E00;&#x4E0B;&#x4EC0;&#x4E48;&#x662F; tcp &#x7684; 2MSL&#xFF1F;</h2>
<p>&#x4E3B;&#x52A8;&#x53D1;&#x9001; fin &#x5173;&#x95ED;&#x7684;&#x4E00;&#x65B9;&#xFF0C;&#x5728; 4 &#x6B21;&#x6325;&#x624B;&#x6700;&#x540E;&#x4E00;&#x6B21;&#x8981;&#x7B49;&#x5F85;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x6211;&#x4EEC;&#x79F0;&#x8FD9;&#x6BB5;&#x65F6;&#x95F4;&#x4E3A; 2MSL</p>
<p>TIME_WAIT &#x72B6;&#x6001;&#x7684;&#x5B58;&#x5728;&#x6709;&#x4E24;&#x4E2A;&#x7406;&#x7531;&#xFF1A; 1.&#x8BA9; 4 &#x6B21;&#x6325;&#x624B;&#x5173;&#x95ED;&#x6D41;&#x7A0B;&#x66F4;&#x52A0;&#x53EF;&#x9760; 2.&#x9632;&#x6B62;&#x4E22;&#x5305;&#x540E;&#x5BF9;&#x540E;&#x7EED;&#x65B0;&#x5EFA;&#x7684;&#x6B63;&#x5E38;&#x8FDE;&#x63A5;&#x7684;&#x4F20;&#x8F93;&#x9020;&#x6210;&#x7834;&#x574F;</p>
<h2 id="&#x4E3A;&#x4EC0;&#x4E48;&#x5BA2;&#x6237;&#x7AEF;&#x5728;-time-wait-&#x72B6;&#x6001;&#x5FC5;&#x987B;&#x7B49;&#x5F85;-2msl-&#x7684;&#x65F6;&#x95F4;&#xFF1F;">&#x4E3A;&#x4EC0;&#x4E48;&#x5BA2;&#x6237;&#x7AEF;&#x5728; TIME-WAIT &#x72B6;&#x6001;&#x5FC5;&#x987B;&#x7B49;&#x5F85; 2MSL &#x7684;&#x65F6;&#x95F4;&#xFF1F;</h2>
<p>1&#x3001;&#x4E3A;&#x4E86;&#x4FDD;&#x8BC1;&#x5BA2;&#x6237;&#x7AEF;&#x53D1;&#x9001;&#x7684;&#x6700;&#x540E;&#x4E00;&#x4E2A; ACK &#x62A5;&#x6587;&#x6BB5;&#x80FD;&#x591F;&#x8FBE;&#x5230;&#x670D;&#x52A1;&#x5668;&#x3002;&#x8FD9;&#x4E2A; ACK &#x62A5;&#x6587;&#x6BB5;&#x53EF;&#x80FD;&#x4E22;&#x5931;&#xFF0C; &#x56E0;&#x800C;&#x4F7F;&#x5904;&#x5728; LAST-ACK &#x72B6;&#x6001;&#x7684;&#x670D;&#x52A1;&#x5668;&#x6536;&#x4E0D;&#x5230;&#x786E;&#x8BA4;&#x3002;&#x670D;&#x52A1;&#x5668;&#x4F1A;&#x8D85;&#x65F6;&#x91CD;&#x4F20; FIN+ACK &#x62A5;&#x6587;&#x6BB5;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x5C31; &#x80FD;&#x5728; 2MSL &#x65F6;&#x95F4;&#x5185;&#x6536;&#x5230;&#x8FD9;&#x4E2A;&#x91CD;&#x4F20;&#x7684; FIN+ACK &#x62A5;&#x6587;&#x6BB5;&#xFF0C;&#x63A5;&#x7740;&#x5BA2;&#x6237;&#x7AEF;&#x91CD;&#x4F20;&#x4E00;&#x6B21;&#x786E;&#x8BA4;&#xFF0C;&#x91CD;&#x542F;&#x8BA1;&#x65F6;&#x5668;&#x3002;&#x6700; &#x597D;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x548C;&#x670D;&#x52A1;&#x5668;&#x90FD;&#x6B63;&#x5E38;&#x8FDB;&#x5165;&#x5230; CLOSED &#x72B6;&#x6001;&#x3002;&#x5982;&#x679C;&#x5BA2;&#x6237;&#x7AEF;&#x5728; TIME-WAIT &#x72B6;&#x6001;&#x4E0D;&#x7B49;&#x5F85;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C; &#x800C;&#x662F;&#x518D;&#x53D1;&#x9001;&#x5B8C; ACK &#x62A5;&#x6587;&#x540E;&#x7ACB;&#x5373;&#x91CA;&#x653E;&#x8FDE;&#x63A5;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x65E0;&#x6CD5;&#x6536;&#x5230;&#x670D;&#x52A1;&#x5668;&#x91CD;&#x4F20;&#x7684; FIN+ACK &#x62A5;&#x6587;&#x6BB5;&#xFF0C;&#x56E0;&#x800C;&#x4E5F; &#x4E0D;&#x4F1A;&#x518D;&#x53D1;&#x9001;&#x4E00;&#x6B21;&#x786E;&#x8BA4;&#x62A5;&#x6587;&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x5C31;&#x65E0;&#x6CD5;&#x6309;&#x7167;&#x6B63;&#x5E38;&#x6B65;&#x9AA4;&#x8FDB;&#x5165; CLOSED &#x72B6;&#x6001;&#x3002; 2&#x3001;&#x9632;&#x6B62;&#x5DF2;&#x5931;&#x6548;&#x7684;&#x8FDE;&#x63A5;&#x8BF7;&#x6C42;&#x62A5;&#x6587;&#x6BB5;&#x51FA;&#x73B0;&#x5728;&#x672C;&#x8FDE;&#x63A5;&#x4E2D;&#x3002;&#x5BA2;&#x6237;&#x7AEF;&#x5728;&#x53D1;&#x9001;&#x5B8C;&#x6700;&#x540E;&#x4E00;&#x4E2A; ACK &#x786E;&#x8BA4;&#x62A5;&#x6587;&#x6BB5; &#x540E;&#xFF0C;&#x518D;&#x7ECF;&#x8FC7;&#x65F6;&#x95F4; 2MSL&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x4F7F;&#x672C;&#x8FDE;&#x63A5;&#x6301;&#x7EED;&#x7684;&#x65F6;&#x95F4;&#x5185;&#x6240;&#x4EA7;&#x751F;&#x7684;&#x6240;&#x6709;&#x62A5;&#x6587;&#x6BB5;&#x90FD;&#x4ECE;&#x7F51;&#x7EDC;&#x4E2D;&#x6D88;&#x5931;&#x3002;&#x8FD9;&#x6837; &#x5C31;&#x53EF;&#x4EE5;&#x4F7F;&#x4E0B;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x8FDE;&#x63A5;&#x4E2D;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x8FD9;&#x79CD;&#x65E7;&#x7684;&#x8FDE;&#x63A5;&#x8BF7;&#x6C42;&#x62A5;&#x6587;&#x6BB5;&#x3002;</p>
<h2 id="&#x8BF4;&#x8BF4;-http-&#x548C;-https-&#x533A;&#x522B;&#xFF1F;">&#x8BF4;&#x8BF4; HTTP &#x548C; HTTPS &#x533A;&#x522B;&#xFF1F;</h2>
<p>HTTP &#x534F;&#x8BAE;&#x4F20;&#x8F93;&#x7684;&#x6570;&#x636E;&#x90FD;&#x662F;&#x672A;&#x52A0;&#x5BC6;&#x7684;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x660E;&#x6587;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x4F7F;&#x7528; HTTP &#x534F;&#x8BAE;&#x4F20;&#x8F93;&#x9690;&#x79C1;&#x4FE1;&#x606F;&#x975E;&#x5E38;&#x4E0D;&#x5B89;&#x5168;&#xFF0C;&#x4E3A;&#x4E86;&#x4FDD;&#x8BC1;&#x8FD9;&#x4E9B;&#x9690;&#x79C1;&#x6570;&#x636E;&#x80FD;&#x52A0;&#x5BC6;&#x4F20;&#x8F93;&#xFF0C;&#x4E8E;&#x662F;&#x7F51;&#x666F;&#x516C;&#x53F8;&#x8BBE;&#x8BA1;&#x4E86; SSL&#xFF08;Secure Sockets Layer&#xFF09;&#x534F;&#x8BAE;&#x7528;&#x4E8E; &#x5BF9; HTTP &#x534F;&#x8BAE;&#x4F20;&#x8F93;&#x7684;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x52A0;&#x5BC6;&#xFF0C;&#x4ECE;&#x800C;&#x5C31;&#x8BDE;&#x751F;&#x4E86; HTTPS&#x3002;&#x7B80;&#x5355;&#x6765;&#x8BF4;&#xFF0C;HTTPS &#x534F;&#x8BAE;&#x662F;&#x7531; SSL+HTTP &#x534F; &#x8BAE;&#x6784;&#x5EFA;&#x7684;&#x53EF;&#x8FDB;&#x884C;&#x52A0;&#x5BC6;&#x4F20;&#x8F93;&#x3001;&#x8EAB;&#x4EFD;&#x8BA4;&#x8BC1;&#x7684;&#x7F51;&#x7EDC;&#x534F;&#x8BAE;&#xFF0C;&#x8981;&#x6BD4; http &#x534F;&#x8BAE;&#x5B89;&#x5168;&#x3002; </p>
<p>HTTPS &#x548C; HTTP &#x7684;&#x533A;&#x522B;&#x4E3B;&#x8981;&#x5982;&#x4E0B;&#xFF1A;</p>
<p> 1&#x3001;https &#x534F;&#x8BAE;&#x9700;&#x8981;&#x5230; ca &#x7533;&#x8BF7;&#x8BC1;&#x4E66;&#xFF0C;&#x4E00;&#x822C;&#x514D;&#x8D39;&#x8BC1;&#x4E66;&#x8F83;&#x5C11;&#xFF0C;&#x56E0;&#x800C;&#x9700;&#x8981;&#x4E00;&#x5B9A;&#x8D39;&#x7528;&#x3002;</p>
<p> 2&#x3001;http &#x662F;&#x8D85;&#x6587;&#x672C;&#x4F20;&#x8F93;&#x534F;&#x8BAE;&#xFF0C;&#x4FE1;&#x606F;&#x662F;&#x660E;&#x6587;&#x4F20;&#x8F93;&#xFF0C;https &#x5219;&#x662F;&#x5177;&#x6709;&#x5B89;&#x5168;&#x6027;&#x7684; ssl &#x52A0;&#x5BC6;&#x4F20;&#x8F93;&#x534F;&#x8BAE;&#x3002;</p>
<p>3&#x3001;http &#x548C; https &#x4F7F;&#x7528;&#x7684;&#x662F;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#x7684;&#x8FDE;&#x63A5;&#x65B9;&#x5F0F;&#xFF0C;&#x7528;&#x7684;&#x7AEF;&#x53E3;&#x4E5F;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x524D;&#x8005;&#x662F; 80&#xFF0C;&#x540E;&#x8005;&#x662F; 443&#x3002;</p>
<p>4&#x3001;http &#x7684;&#x8FDE;&#x63A5;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x662F;&#x65E0;&#x72B6;&#x6001;&#x7684;&#xFF1B;HTTPS &#x534F;&#x8BAE;&#x662F;&#x7531; SSL+HTTP &#x534F;&#x8BAE;&#x6784;&#x5EFA;&#x7684;&#x53EF;&#x8FDB;&#x884C;&#x52A0;&#x5BC6;&#x4F20;&#x8F93;&#x3001;&#x8EAB;&#x4EFD;&#x8BA4;&#x8BC1;&#x7684;&#x7F51;&#x7EDC;&#x534F;&#x8BAE;&#xFF0C;&#x6BD4; http &#x534F;&#x8BAE;&#x5B89;&#x5168;&#x3002;</p>
<h2 id="&#x8C08;&#x4E00;&#x4E0B;-http-&#x534F;&#x8BAE;&#x4EE5;&#x53CA;&#x534F;&#x8BAE;&#x5934;&#x90E8;&#x4E2D;&#x8868;&#x793A;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x7684;&#x5B57;&#x6BB5;&#xFF1F;">&#x8C08;&#x4E00;&#x4E0B; HTTP &#x534F;&#x8BAE;&#x4EE5;&#x53CA;&#x534F;&#x8BAE;&#x5934;&#x90E8;&#x4E2D;&#x8868;&#x793A;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x7684;&#x5B57;&#x6BB5;&#xFF1F;</h2>
<p>HTTP &#x534F;&#x8BAE;&#x662F; Hyper Text Transfer Protocol&#xFF08;&#x8D85;&#x6587;&#x672C;&#x4F20;&#x8F93;&#x534F;&#x8BAE;&#xFF09;&#x7684;&#x7F29;&#x5199;&#xFF0C;&#x662F;&#x7528;&#x4E8E;&#x4ECE;&#x4E07;&#x7EF4;&#x7F51;&#xFF08;WWW:World Wide Web&#xFF09;&#x670D;&#x52A1;&#x5668;&#x4F20;&#x8F93;&#x8D85;&#x6587;&#x672C;&#x5230;&#x672C;&#x5730;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x4F20;&#x9001;&#x534F;&#x8BAE;&#x3002; HTTP &#x662F;&#x4E00;&#x4E2A;&#x57FA;&#x4E8E; TCP/IP &#x901A;&#x4FE1;&#x534F;&#x8BAE;&#x6765;&#x4F20;&#x9012;&#x6570;&#x636E;&#xFF08;HTML &#x6587;&#x4EF6;&#xFF0C; &#x56FE;&#x7247;&#x6587;&#x4EF6;&#xFF0C; &#x67E5;&#x8BE2;&#x7ED3;&#x679C;&#x7B49;&#xFF09;&#x3002; HTTP &#x662F;&#x4E00;&#x4E2A;&#x5C5E;&#x4E8E;&#x5E94;&#x7528;&#x5C42;&#x7684;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x534F;&#x8BAE;&#xFF0C;&#x7531;&#x4E8E;&#x5176;&#x7B80;&#x6377;&#x3001;&#x5FEB;&#x901F;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x9002;&#x7528;&#x4E8E;&#x5206;&#x5E03;&#x5F0F;&#x8D85;&#x5A92;&#x4F53; &#x4FE1;&#x606F;&#x7CFB;&#x7EDF;&#x3002;&#x5B83;&#x4E8E; 1990 &#x5E74;&#x63D0;&#x51FA;&#xFF0C;&#x7ECF;&#x8FC7;&#x51E0;&#x5E74;&#x7684;&#x4F7F;&#x7528;&#x4E0E;&#x53D1;&#x5C55;&#xFF0C;&#x5F97;&#x5230;&#x4E0D;&#x65AD;&#x5730;&#x5B8C;&#x5584;&#x548C;&#x6269;&#x5C55;&#x3002;&#x76EE;&#x524D;&#x5728; WWW &#x4E2D; &#x4F7F;&#x7528;&#x7684;&#x662F; HTTP/1.0 &#x7684;&#x7B2C;&#x516D;&#x7248;&#xFF0C; HTTP/1.1 &#x7684;&#x89C4;&#x8303;&#x5316;&#x5DE5;&#x4F5C;&#x6B63;&#x5728;&#x8FDB;&#x884C;&#x4E4B;&#x4E2D;&#xFF0C;&#x800C;&#x4E14; HTTP-NG(Next Generation of HTTP)&#x7684;&#x5EFA;&#x8BAE;&#x5DF2;&#x7ECF;&#x63D0;&#x51FA;&#x3002; HTTP &#x534F;&#x8BAE;&#x5DE5;&#x4F5C;&#x4E8E;&#x5BA2;&#x6237;&#x7AEF;-&#x670D;&#x52A1;&#x7AEF;&#x67B6;&#x6784;&#x4E3A;&#x4E0A;&#x3002;&#x6D4F;&#x89C8;&#x5668;&#x4F5C;&#x4E3A; HTTP &#x5BA2;&#x6237;&#x7AEF;&#x901A;&#x8FC7; URL &#x5411; HTTP &#x670D;</p>
<p>&#x52A1;&#x7AEF;&#x5373; WEB &#x670D;&#x52A1;&#x5668;&#x53D1;&#x9001;&#x6240;&#x6709;&#x8BF7;&#x6C42;&#x3002;Web &#x670D;&#x52A1;&#x5668;&#x6839;&#x636E;&#x63A5;&#x6536;&#x5230;&#x7684;&#x8BF7;&#x6C42;&#x540E;&#xFF0C;&#x5411;&#x5BA2;&#x6237;&#x7AEF;&#x53D1;&#x9001;&#x54CD;&#x5E94;&#x4FE1;&#x606F;&#x3002; &#x8868;&#x793A;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x5B57;&#x6BB5;&#xFF1A; Content-Type</p>
<h2 id="http-&#x8BF7;&#x6C42;&#x65B9;&#x6CD5;&#x90FD;&#x6709;&#x4EC0;&#x4E48;&#xFF1F;">HTTP &#x8BF7;&#x6C42;&#x65B9;&#x6CD5;&#x90FD;&#x6709;&#x4EC0;&#x4E48;&#xFF1F;</h2>
<p>&#x6839;&#x636E; HTTP &#x6807;&#x51C6;&#xFF0C;HTTP &#x8BF7;&#x6C42;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x591A;&#x79CD;&#x8BF7;&#x6C42;&#x65B9;&#x6CD5;&#x3002;</p>
<p> HTTP1.0 &#x5B9A;&#x4E49;&#x4E86;&#x4E09;&#x79CD;&#x8BF7;&#x6C42;&#x65B9;&#x6CD5;&#xFF1A; GET&#xFF0C;POST &#x548C; HEAD &#x65B9;&#x6CD5;&#x3002; </p>
<p>HTTP1.1 &#x65B0;&#x589E;&#x4E86;&#x4E94;&#x79CD;&#x8BF7;&#x6C42;&#x65B9;&#x6CD5;&#xFF1A;OPTIONS&#xFF0C; PUT&#xFF0C; DELETE&#xFF0C; TRACE &#x548C; CONNECT &#x65B9;&#x6CD5;&#x3002; 1&#x3001;GET &#x8BF7;&#x6C42;&#x6307;&#x5B9A;&#x7684;&#x9875;&#x9762;&#x4FE1;&#x606F;&#xFF0C;&#x5E76;&#x8FD4;&#x56DE;&#x5B9E;&#x4F53;&#x4E3B;&#x4F53;&#x3002;</p>
<p> 2&#x3001;HEAD &#x7C7B;&#x4F3C;&#x4E8E; get &#x8BF7;&#x6C42;&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;&#x8FD4;&#x56DE;&#x7684;&#x54CD;&#x5E94;&#x4E2D;&#x6CA1;&#x6709;&#x5177;&#x4F53;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x7528;&#x4E8E;&#x83B7;&#x53D6;&#x62A5;&#x5934; </p>
<p>3&#x3001;POST &#x5411;&#x6307;&#x5B9A;&#x8D44;&#x6E90;&#x63D0;&#x4EA4;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x5904;&#x7406;&#x8BF7;&#x6C42;&#xFF08;&#x4F8B;&#x5982;&#x63D0;&#x4EA4;&#x8868;&#x5355;&#x6216;&#x8005;&#x4E0A;&#x4F20;&#x6587;&#x4EF6;&#xFF09;&#x3002;&#x6570;&#x636E;&#x88AB;&#x5305;&#x542B;&#x5728; &#x8BF7;&#x6C42;&#x4F53;&#x4E2D;&#x3002;POST &#x8BF7;&#x6C42;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x65B0;&#x7684;&#x8D44;&#x6E90;&#x7684;&#x5EFA;&#x7ACB;&#x548C;/&#x6216;&#x5DF2;&#x6709;&#x8D44;&#x6E90;&#x7684;&#x4FEE;&#x6539;&#x3002; </p>
<p>4&#x3001;PUT &#x4ECE;&#x5BA2;&#x6237;&#x7AEF;&#x5411;&#x670D;&#x52A1;&#x5668;&#x4F20;&#x9001;&#x7684;&#x6570;&#x636E;&#x53D6;&#x4EE3;&#x6307;&#x5B9A;&#x7684;&#x6587;&#x6863;&#x7684;&#x5185;&#x5BB9;&#x3002; </p>
<p>5&#x3001;DELETE &#x8BF7;&#x6C42;&#x670D;&#x52A1;&#x5668;&#x5220;&#x9664;&#x6307;&#x5B9A;&#x7684;&#x9875;&#x9762;&#x3002; </p>
<p>6&#x3001;CONNECT HTTP/1.1 &#x534F;&#x8BAE;&#x4E2D;&#x9884;&#x7559;&#x7ED9;&#x80FD;&#x591F;&#x5C06;&#x8FDE;&#x63A5;&#x6539;&#x4E3A;&#x7BA1;&#x9053;&#x65B9;&#x5F0F;&#x7684;&#x4EE3;&#x7406;&#x670D;&#x52A1;&#x5668;&#x3002;</p>
<p> 7&#x3001;OPTIONS &#x5141;&#x8BB8;&#x5BA2;&#x6237;&#x7AEF;&#x67E5;&#x770B;&#x670D;&#x52A1;&#x5668;&#x7684;&#x6027;&#x80FD;&#x3002;</p>
<p> 8&#x3001;TRACE &#x56DE;&#x663E;&#x670D;&#x52A1;&#x5668;&#x6536;&#x5230;&#x7684;&#x8BF7;&#x6C42;&#xFF0C;&#x4E3B;&#x8981;&#x7528;&#x4E8E;&#x6D4B;&#x8BD5;&#x6216;&#x8BCA;&#x65AD;&#x3002;</p>
<h2 id="&#x4F7F;&#x7528;-socket-&#x5957;&#x63A5;&#x5B57;&#x9700;&#x8981;&#x4F20;&#x5165;&#x54EA;&#x4E9B;&#x53C2;&#x6570;-&#xFF1F;">&#x4F7F;&#x7528; Socket &#x5957;&#x63A5;&#x5B57;&#x9700;&#x8981;&#x4F20;&#x5165;&#x54EA;&#x4E9B;&#x53C2;&#x6570; &#xFF1F;</h2>
<p>Address Family &#x548C; Type&#xFF0C;&#x5206;&#x522B;&#x8868;&#x793A;&#x5957;&#x63A5;&#x5B57;&#x5E94;&#x7528;&#x573A;&#x666F;&#x548C;&#x7C7B;&#x578B;&#x3002; family &#x7684;&#x503C;&#x53EF;&#x4EE5;&#x662F; AF_UNIX(Unix &#x57DF;&#xFF0C;&#x7528;&#x4E8E;&#x540C;&#x4E00;&#x53F0;&#x673A;&#x5668;&#x4E0A;&#x7684;&#x8FDB;&#x7A0B;&#x95F4;&#x901A;&#x8BAF;)&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x662F; AF_INET &#xFF08;&#x5BF9;&#x4E8E; IPV4 &#x534F;&#x8BAE;&#x7684; TCP &#x548C; UDP&#xFF09;&#xFF0C;&#x81F3;&#x4E8E; type &#x53C2;&#x6570;&#xFF0C;SOCK_STREAM&#xFF08;&#x6D41;&#x5957;&#x63A5;&#x5B57;&#xFF09;&#x6216;&#x8005; SOCK_DGRAM&#xFF08;&#x6570;&#x636E;&#x62A5;&#x6587;&#x5957;&#x63A5;&#x5B57;&#xFF09;,SOCK_RAW&#xFF08;raw &#x5957;&#x63A5;&#x5B57;&#xFF09;&#x3002;</p>
<h2 id="http-&#x5E38;&#x89C1;&#x8BF7;&#x6C42;&#x5934;&#xFF1F;">HTTP &#x5E38;&#x89C1;&#x8BF7;&#x6C42;&#x5934;&#xFF1F;</h2>
<ol>
<li>Host (&#x4E3B;&#x673A;&#x548C;&#x7AEF;&#x53E3;&#x53F7;)</li>
</ol>
<ol>
<li>Connection (&#x94FE;&#x63A5;&#x7C7B;&#x578B;)</li>
</ol>
<ol>
<li>Upgrade-Insecure-Requests (&#x5347;&#x7EA7;&#x4E3A; HTTPS &#x8BF7;&#x6C42;)</li>
</ol>
<ol>
<li>User-Agent (&#x6D4F;&#x89C8;&#x5668;&#x540D;&#x79F0;)</li>
</ol>
<ol>
<li>Accept (&#x4F20;&#x8F93;&#x6587;&#x4EF6;&#x7C7B;&#x578B;)</li>
</ol>
<ol>
<li>Referer (&#x9875;&#x9762;&#x8DF3;&#x8F6C;&#x5904;)</li>
</ol>
<ol>
<li>Accept-Encoding&#xFF08;&#x6587;&#x4EF6;&#x7F16;&#x89E3;&#x7801;&#x683C;&#x5F0F;&#xFF09;</li>
</ol>
<ol>
<li>Cookie &#xFF08;Cookie&#xFF09;</li>
</ol>
<p>\9. x-requested-with :XMLHttpRequest (&#x662F; Ajax &#x5F02;&#x6B65;&#x8BF7;&#x6C42;)</p>
<h2 id="&#x4E03;&#x5C42;&#x6A21;&#x578B;&#xFF1F;-ip-&#xFF0C;tcpudp-&#xFF0C;http-&#xFF0C;rtsp-&#xFF0C;ftp-&#x5206;&#x522B;&#x5728;&#x54EA;&#x5C42;&#xFF1F;">&#x4E03;&#x5C42;&#x6A21;&#x578B;&#xFF1F; IP &#xFF0C;TCP/UDP &#xFF0C;HTTP &#xFF0C;RTSP &#xFF0C;FTP &#x5206;&#x522B;&#x5728;&#x54EA;&#x5C42;&#xFF1F;</h2>
<p>IP&#xFF1A; &#x7F51;&#x7EDC;&#x5C42; TCP/UDP&#xFF1A; &#x4F20;&#x8F93;&#x5C42; HTTP&#x3001;RTSP&#x3001;FTP&#x3001;SMTP&#x3001;POP3&#x3001;dns&#xFF1A; &#x5E94;&#x7528;&#x5C42;&#x534F;&#x8BAE;&#xFF08;&#x8868;&#x793A;&#x5C42;&#xFF0C;&#x4F1A;&#x8BDD;&#x5C42;&#xFF09;</p>
<p>arp/rarp&#x534F;&#x8BAE;&#xFF1A;&#x6570;&#x636E;&#x94FE;&#x8DEF;&#x5C42;</p>
<p>http/https&#xFF1A;&#x8D85;&#x6587;&#x672C;&#x4F20;&#x8F93;&#x534F;&#x8BAE;&#xFF0C;&#x670D;&#x52A1;&#x7AEF;&#x548C;&#x6D4F;&#x89C8;&#x5668;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x4EA4;&#x4E92;&#x7684;&#xFF0C;&#x662F;&#x57FA;&#x4E8E;tcp&#x534F;&#x8BAE;&#x7684;</p>
<h2 id="url-&#x7684;&#x5F62;&#x5F0F;&#xFF1F;">url &#x7684;&#x5F62;&#x5F0F;&#xFF1F;</h2>
<p>&#x5F62;&#x5F0F;&#xFF1A; scheme://host[:port#]/path/&#x2026;/[?query-string][#anchor] scheme&#xFF1A;&#x534F;&#x8BAE;(&#x4F8B;&#x5982;&#xFF1A;</p>
<p>http&#xFF0C; https&#xFF0C; ftp) host&#xFF1A;&#x670D;&#x52A1;&#x5668;&#x7684; IP &#x5730;&#x5740;&#x6216;&#x8005;&#x57DF;&#x540D;</p>
<p>port&#xFF1A;&#x670D;&#x52A1;&#x5668;&#x7684;&#x7AEF;&#x53E3;&#xFF08;&#x5982;&#x679C;&#x662F;&#x8D70;&#x534F;&#x8BAE;&#x9ED8;&#x8BA4;&#x7AEF;&#x53E3;&#xFF0C;80 or 443&#xFF09; path&#xFF1A;&#x8BBF;&#x95EE;&#x8D44;&#x6E90;&#x7684;&#x8DEF;&#x5F84; query-string&#xFF1A;&#x53C2;&#x6570;&#xFF0C;&#x53D1;&#x9001;&#x7ED9; http &#x670D;&#x52A1;&#x5668;&#x7684;&#x6570;&#x636E;</p>
<p>anchor&#xFF1A;&#x951A;&#xFF08;&#x8DF3;&#x8F6C;&#x5230;&#x7F51;&#x9875;&#x7684;&#x6307;&#x5B9A;&#x951A;&#x70B9;&#x4F4D;&#x7F6E;&#xFF09; <a href="http://localhost:4000/file/part01/1.2.html" target="_blank">http://localhost:4000/file/part01/1.2.html</a></p>
<h2 id="&#x8FDB;&#x7A0B;&#x548C;&#x7A0B;&#x5E8F;">&#x8FDB;&#x7A0B;&#x548C;&#x7A0B;&#x5E8F;</h2>
<p>&#x8FD0;&#x884C;&#x4E2D;&#x7684;&#x7A0B;&#x5E8F;&#x662F;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;</p>
<p>&#x8FDB;&#x7A0B;&#x7684;&#x4E09;&#x72B6;&#x6001;&#xFF1A;&#x5C31;&#x7EEA;&#xFF0C;&#x8FD0;&#x884C;&#xFF0C;&#x963B;&#x585E;</p>
<p>&#x5E76;&#x884C;&#x548C;&#x5E76;&#x53D1;</p>
<p><img src="file:///C:\Users\zhangyan\AppData\Local\Temp\ksohtml20092\wps32.jpg" alt="img"> &#x5E76;&#x884C;&#xFF1A;&#x540C;&#x4E00;&#x65F6;&#x523B;&#xFF0C;&#x591A;&#x4E2A;&#x4EFB;&#x52A1;&#x5728;&#x591A;&#x4E2A;cpu&#x4E2D;&#x88AB;&#x6267;&#x884C;&#xFF08;&#x6548;&#x7387;&#x66F4;&#x9AD8;&#xFF09;</p>
<p><img src="file:///C:\Users\zhangyan\AppData\Local\Temp\ksohtml20092\wps33.jpg" alt="img"> &#x5E76;&#x53D1;&#xFF1A;&#x540C;&#x4E00;&#x65F6;&#x95F4;&#x6BB5;&#x5185;&#xFF0C;&#x591A;&#x4E2A;&#x4EFB;&#x52A1;&#x4EA4;&#x66FF;&#x6267;&#x884C;&#x5728;cpu&#x4E0A;</p>
<p>&#x5F02;&#x6B65;&#x548C;&#x540C;&#x6B65;</p>
<p><img src="file:///C:\Users\zhangyan\AppData\Local\Temp\ksohtml20092\wps34.jpg" alt="img"> &#x5F02;&#x6B65;&#xFF1A;&#x4E24;&#x4E2A;&#x4EFB;&#x52A1;&#xFF08;&#x5F53;&#x524D;&#x6240;&#x5728;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x548C;&#x53E6;&#x4E00;&#x4E2A;&#x72EC;&#x7ACB;&#x7684;&#x4EFB;&#x52A1;&#xFF09;&#x4E4B;&#x95F4;&#x6CA1;&#x6709;&#x660E;&#x786E;&#x7684;&#x5148;&#x540E;&#x5173;&#x7CFB;</p>
<p><img src="file:///C:\Users\zhangyan\AppData\Local\Temp\ksohtml20092\wps35.jpg" alt="img"> &#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x7684;&#x7EE7;&#x7EED;&#x5E76;&#x4E0D;&#x5F71;&#x54CD;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x7684;&#x6267;&#x884C;</p>
<p><img src="file:///C:\Users\zhangyan\AppData\Local\Temp\ksohtml20092\wps36.jpg" alt="img"> &#x540C;&#x6B65;&#xFF1A;&#x4E24;&#x4E2A;&#x4EFB;&#x52A1;&#x4E4B;&#x95F4;&#x6709;&#x660E;&#x786E;&#x7684;&#x5148;&#x540E;&#x5173;&#x7CFB;</p>
<p><img src="file:///C:\Users\zhangyan\AppData\Local\Temp\ksohtml20092\wps37.jpg" alt="img"> &#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x7684;&#x7EE7;&#x7EED;&#x5FC5;&#x987B;&#x4F9D;&#x8D56;&#x4E8E;&#x4E0A;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x7684;&#x7ED3;&#x679C;</p>
<p>&#x963B;&#x585E;&#x548C;&#x975E;&#x963B;&#x585E;</p>
<p><img src="file:///C:\Users\zhangyan\AppData\Local\Temp\ksohtml20092\wps38.jpg" alt="img"> &#x963B;&#x585E;&#xFF1A;&#x7B49;&#x5F85;io&#x64CD;&#x4F5C;&#x7ED3;&#x675F;</p>
<p><img src="file:///C:\Users\zhangyan\AppData\Local\Temp\ksohtml20092\wps39.jpg" alt="img"> &#x975E;&#x963B;&#x585E;&#xFF1A;&#x4E0D;&#x7B49;&#x5F85;io&#x64CD;&#x4F5C;&#x7ED3;&#x675F;</p>
<p>&#x8FDB;&#x7A0B;&#xFF0C;&#x7EBF;&#x7A0B;&#xFF0C;&#x534F;&#x7A0B;</p>
<p><img src="file:///C:\Users\zhangyan\AppData\Local\Temp\ksohtml20092\wps40.jpg" alt="img"> &#x8FDB;&#x7A0B;&#xFF1A;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E2D;&#x8D44;&#x6E90;&#x5206;&#x914D;&#x7684;&#x6700;&#x5C0F;&#x5355;&#x4F4D;&#xFF0C;&#x8D44;&#x6E90;&#x72EC;&#x7ACB;&#xFF1B;&#x80FD;&#x5229;&#x7528;&#x591A;&#x6838;&#xFF1B;&#x5360;&#x7528;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5F00;&#x9500;&#x5927;&#xFF1B;&#x6709;&#x6570;&#x636E;&#x5B89;&#x5168;&#x95EE;&#x9898;</p>
<p><img src="file:///C:\Users\zhangyan\AppData\Local\Temp\ksohtml20092\wps41.jpg" alt="img"> &#x8D44;&#x6E90;&#x72EC;&#x7ACB;&#xFF08;&#x6700;&#x5927;&#x7279;&#x70B9;&#xFF09;</p>
<p><img src="file:///C:\Users\zhangyan\AppData\Local\Temp\ksohtml20092\wps42.jpg" alt="img"> &#x591A;&#x8FDB;&#x7A0B;&#xFF1A;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x5728;cpython&#x89E3;&#x91CA;&#x5668;&#x4E0B;&#x5229;&#x7528;&#x591A;&#x6838;</p>
<p><img src="file:///C:\Users\zhangyan\AppData\Local\Temp\ksohtml20092\wps43.jpg" alt="img"> &#x5B88;&#x62A4;&#x8FDB;&#x7A0B;&#xFF1A;&#x5B88;&#x62A4;&#x5230;&#x4E3B;&#x8FDB;&#x7A0B;&#x4EE3;&#x7801;&#x7ED3;&#x675F;</p>
<p><img src="file:///C:\Users\zhangyan\AppData\Local\Temp\ksohtml20092\wps44.jpg" alt="img"> &#x9501;&#xFF1A;&#xFF08;&#x4E92;&#x65A5;&#x9501;&#xFF0C;&#x9012;&#x5F52;&#x9501;&#xFF09;&#x5171;&#x540C;&#x8BBF;&#x95EE;&#x67D0;&#x6587;&#x4EF6;&#xFF0C;&#x5171;&#x4EAB;&#x53D8;&#x91CF;&#x7684;&#x65F6;&#x5019;</p>
<p><img src="file:///C:\Users\zhangyan\AppData\Local\Temp\ksohtml20092\wps45.jpg" alt="img"> &#x7EBF;&#x7A0B;&#xFF1A;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E2D;cpu&#x8C03;&#x5EA6;&#x7684;&#x6700;&#x5C0F;&#x5355;&#x4F4D;&#xFF0C;&#x8D44;&#x6E90;&#x5171;&#x4EAB;&#xFF1B;&#x80FD;&#x5229;&#x7528;&#x591A;&#x6838;&#xFF08;python&#x4E0D;&#x80FD;&#xFF09;&#xFF1B;&#x5360;&#x7528;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8D44;&#x6E90;&#x76F8;&#x5BF9;&#x8F83;&#x5C11;&#xFF1B;&#x6709;&#x6570;&#x636E;&#x5B89;&#x5168;&#x95EE;&#x9898;</p>
<p><img src="file:///C:\Users\zhangyan\AppData\Local\Temp\ksohtml20092\wps46.jpg" alt="img"> &#x5904;&#x7406;&#x5E76;&#x53D1;</p>
<p><img src="file:///C:\Users\zhangyan\AppData\Local\Temp\ksohtml20092\wps47.jpg" alt="img"> CIL&#x9501;&#xFF1A;cpython&#x89E3;&#x91CA;&#x5668;&#x4E2D;&#x7BA1;&#x7406;&#x7EBF;&#x7A0B;&#x7684;&#x673A;&#x5236;</p>
<p><img src="file:///C:\Users\zhangyan\AppData\Local\Temp\ksohtml20092\wps48.jpg" alt="img"> &#x4FDD;&#x8BC1;&#x4E86;cpython&#x89E3;&#x91CA;&#x5668;&#x4E2D;&#xFF0C;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#xFF0C;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x5728;&#x540C;&#x4E00;&#x65F6;&#x95F4;&#x70B9;&#x80FD;&#x8BBF;&#x95EE;cpu <img src="file:///C:\Users\zhangyan\AppData\Local\Temp\ksohtml20092\wps49.jpg" alt="img"> cpython&#x89E3;&#x91CA;&#x5668;&#x5BFC;&#x81F4;&#x4E86;&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x5145;&#x5206;&#x5229;&#x7528;&#x591A;&#x7EBF;&#x7A0B;&#x6765;&#x8BBF;&#x95EE;&#x591A;&#x4E2A;cpu</p>
<p><img src="file:///C:\Users\zhangyan\AppData\Local\Temp\ksohtml20092\wps50.jpg" alt="img"> &#x591A;&#x7EBF;&#x7A0B;&#xFF1A;&#x5F53;&#x6211;&#x4EEC;&#x4E0D;&#x786E;&#x5B9A;io&#x64CD;&#x4F5C;&#x6216;&#x8005;python&#x8BED;&#x8A00;&#x6CA1;&#x6709;&#x7ED9;io&#x64CD;&#x4F5C;&#x8BBE;&#x7F6E;&#x534F;&#x7A0B;&#x8BC6;&#x522B;&#x8BED;&#x6CD5;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x7EBF;&#x7A0B;</p>
<p><img src="file:///C:\Users\zhangyan\AppData\Local\Temp\ksohtml20092\wps51.jpg" alt="img"> &#x534F;&#x7A0B;&#xFF1A;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E0D;&#x53EF;&#x89C1;&#xFF08;&#x5E94;&#x7528;&#x7EA7;&#x522B;&#xFF09;&#xFF0C;&#x8D44;&#x6E90;&#x5171;&#x4EAB;&#xFF0C;&#x4E0D;&#x80FD;&#x5229;&#x7528;&#x591A;&#x6838;&#xFF0C;&#x672C;&#x8D28;&#x662F;&#x4E00;&#x6761;&#x7EBF;&#x7A0B;&#xFF0C;&#x5360;&#x7528;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8D44;&#x6E90;&#x76F8;&#x5F53;&#x4E8E;&#x4E00;&#x6761;&#x7EBF;&#x7A0B;&#xFF1B;&#x4E0D;&#x5B58;&#x5728;&#x6570;&#x636E;&#x5B89;&#x5168;&#x95EE;&#x9898;</p>
<p><img src="file:///C:\Users\zhangyan\AppData\Local\Temp\ksohtml20092\wps52.jpg" alt="img"> &#x5728;&#x5355;&#x7EBF;&#x7A0B;&#x4E2D;&#xFF0C;&#x6709;n&#x4E2A;&#x4EFB;&#x52A1;&#xFF0C;&#x8FD9;&#x591A;&#x4E2A;&#x4EFB;&#x52A1;&#x5982;&#x679C;&#x540C;&#x6B65;&#x6267;&#x884C;&#xFF0C;&#x90A3;&#x4E48;&#x6240;&#x6709;&#x7684;io&#x64CD;&#x4F5C;&#x7684;&#x65F6;&#x95F4;&#x662F;&#x7D2F;&#x52A0;&#x5230;&#x4E00;&#x8D77;&#x7684;</p>
<p><img src="file:///C:\Users\zhangyan\AppData\Local\Temp\ksohtml20092\wps53.jpg" alt="img"> &#x5982;&#x679C;&#x8FD9;&#x591A;&#x4E2A;&#x4EFB;&#x52A1;&#x80FD;&#x591F;&#x5171;&#x4EAB;&#x6240;&#x6709;&#x7684;io&#x65F6;&#x95F4;</p>
<p><img src="file:///C:\Users\zhangyan\AppData\Local\Temp\ksohtml20092\wps54.jpg" alt="img"> &#x5B8C;&#x6210;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#xFF0C;&#x9047;&#x5230;io&#x4E4B;&#x540E;&#xFF0C;&#x80FD;&#x591F;&#x5207;&#x6362;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x6267;&#x884C;&#xFF0C;&#x6240;&#x6709;&#x7684;io&#x64CD;&#x4F5C;&#x7684;&#x65F6;&#x95F4;&#x73AF;&#x80FD;&#x505A;&#x5176;&#x4ED6;&#x4EFB;&#x52A1;&#x7684;&#x6267;&#x884C;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E00;&#x6761;&#x7EBF;&#x7A0B;&#x5B8C;&#x6210;&#x591A;&#x4E2A;&#x4EFB;&#x52A1;</p>
<p><img src="file:///C:\Users\zhangyan\AppData\Local\Temp\ksohtml20092\wps55.jpg" alt="img"> &#x534F;&#x7A0B;&#x5207;&#x6362;&#x4E5F;&#x662F;&#x6709;&#x5F00;&#x9500;&#x7684;&#xFF0C;&#x548C;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x7684;&#x5F00;&#x9500;&#x4E00;&#x6837;</p>
<p><img src="file:///C:\Users\zhangyan\AppData\Local\Temp\ksohtml20092\wps56.jpg" alt="img"> &#x6570;&#x636E;&#x5B89;&#x5168;</p>
<p><img src="file:///C:\Users\zhangyan\AppData\Local\Temp\ksohtml20092\wps57.jpg" alt="img"> &#x591A;&#x4E2A;&#x8FDB;&#x7A0B;&#x64CD;&#x4F5C;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;</p>
<p><img src="file:///C:\Users\zhangyan\AppData\Local\Temp\ksohtml20092\wps58.jpg" alt="img"> &#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x64CD;&#x4F5C;&#x4E00;&#x4E2A;&#x5168;&#x5C40;&#x53D8;&#x91CF;</p>
<p><img src="file:///C:\Users\zhangyan\AppData\Local\Temp\ksohtml20092\wps59.jpg" alt="img"> &#x534F;&#x7A0B;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x6570;&#x636E;&#x4E0D;&#x5B89;&#x5168;&#xFF0C;&#x56E0;&#x4E3A;&#x534F;&#x7A0B;&#x662F;&#x6709;&#x7A0B;&#x5E8F;&#x5458;&#x63A7;&#x5236;&#x7684;&#xFF0C;&#x800C;&#x7A0B;&#x5E8F;&#x5458;&#x63A7;&#x5236;&#x7684;&#x667A;&#x80FD;&#x662F;&#x4EE3;&#x7801;&#xFF0C;&#x800C;&#x4E0D;&#x662F;cpu&#x6307;&#x4EE4; </p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="网络协议.html" class="navigation navigation-prev " aria-label="Previous page: 网络协议">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="vue.html" class="navigation navigation-next " aria-label="Next page: vue">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"系统编程","level":"1.2.7","depth":2,"next":{"title":"vue","level":"1.2.8","depth":2,"path":"part1/vue.md","ref":"part1/vue.md","articles":[]},"previous":{"title":"网络协议","level":"1.2.6","depth":2,"path":"part1/网络协议.md","ref":"part1/网络协议.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"part1/系统编程.md","mtime":"2020-09-17T03:14:56.704Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-09-17T03:27:10.161Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

